{
    "slug": "cashu",
    "title": "Cashu",
    "infrastructureType": "Chaumian Ecash Protocol",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["", ""],
    "bitcoinSecurity": "No",
    "nativeToken": "BTC",
    "purpose": "Ecash mint",
    "associatedLayers": "Lightning Network, nostr",
    "bitcoinOnly": true,
    "links": [
        "https://cashu.space/",
        "https://cashu.space/",
        "https://docs.cashu.space/",
        "https://github.com/cashubtc",
        "https://x.com/CashuBTC"
    ],
    "description": "Концепцію сліпих підписів та електронних грошей вперше запропонував Девід Чаум у 1982 році у своїй статті «[Blind Signatures for Untraceable Payments](https://chaum.com/wp-content/uploads/2022/01/Chaum-blind-signatures.pdf)». Cashu — це протокол Ecash, заснований на [варіанті сліпого підпису Девіда Вагнера](https://cypherpunks.venona.com/date/1996/03/msg01848.html), який використовує схему [Blind Diffie-Hellman Key Exchange (blind ecash) scheme](https://gist.github.com/RubenSomsen/be7a4760dd4596d06963d67baf140406). Він був [вперше представлений](https://x.com/callebtc/status/1569986110272540674) у 2022 році його творцем Калле, псевдонімом розробника Bitcoin та Lightning Network. Cashu — це протокол з відкритим кодом з чітко визначеними специфікаціями, які називаються [NUTs (Notation, Usage, and Terminology)](https://github.com/cashubtc/nuts), що дотримуються міні-економіки та гаманців. Система Ecash складається з двох частин: мінт і гаманець Ecash, що зберігає цифрові токени. Кожен може запустити мінт для свого застосунку, будь то гаманець, веб пейволл, платні стрімінгові послуги або система ваучерів і винагород. Існує [кілька бібліотек](https://docs.cashu.space/libraries), які дозволяють розробникам створювати відповідні сервіси. Використання сліпих підписів забезпечує конфіденційність користувачів щодо мінту під час транзакцій з токенами Ecash. Ця функціональність дозволяє створювати довірчі Bitcoin сервіси, які забезпечують кращий користувацький досвід та конфіденційність.",
    "sections": [
        {
            "id": "riskbits",
            "title": "Ризикові моменти",
            "content": [
                {
                    "title": "Власність мосту: Один мінт, одна організація - єдина точка відмови",
                    "content": "Мінт Cashu управляється однією організацією, яка зберігає кошти користувачів в обмін на випуск токенів Ecash. Якщо мінт буде зламано, стане неактивним або виявиться злочинним, повернення токенів буде під загрозою."
                },
                {
                    "title": "Фракційний резерв через складність аудиту зобов'язань",
                    "content": "Токени Ecash представляють вимогу до біткойнів, які зберігаються в мінті. Завдяки механізму сліпого підпису, який використовує мінт під час процесу випуску токенів, аудит його зобов'язань перед користувачами залишається складним. [Схема Доказу зобов'язань була запропонована](https://gist.github.com/callebtc/ed5228d1d8cbaade0104db5d1cf63939), без відкритого коду реалізації на даний момент. Така схема призведе до компромісу UX з вимогою активності користувача в визначений період ротації ключів."
                }
            ]
        },
        {
            "id": "coretechnology",
            "title": "Основні технологічні компоненти",
            "content": [
                {
                    "title": "Сліпий підпис Чаума",
                    "content": "Сліпий підпис Чаума працює, дозволяючи підписати повідомлення, не розкриваючи його зміст підписувачу. Процес включає сліпий фактор, який засліплює повідомлення. Підписане сліпе повідомлення розкривається його автором, використовуючи оригінальний сліпий фактор. Цей процес був розглянутий у легкому для розуміння [відео-поясненні від Rijndael](https://x.com/rot13maxi/status/1549766946366840834)."
                },
                {
                    "title": "Модуль мінта",
                    "content": "У контексті Cashu мінт є довіреною організацією, відповідальною за випуск («мінтинг») і викуп («спалювання») токенів Ecash. Ці токени діють як боргові зобов'язання і підтримуються BTC. Його можна вважати формою «[вільного банківництва](https://docs.cashu.space/faq#mints)», де банк випускав свої власні банкноти, які підтримуються золотом, наприклад. Оскільки мінти утримують кошти користувачів, це вимагає від користувача довіри до мінту для викупу їх Ecash, коли вони хочуть конвертувати назад у BTC. Пег-ін і пег-аут з мінта Cashu відбуваються через Lightning Network. Інфраструктура LN управляється самими мінтами або публічними та ненадійними Lightning шлюзами (гаманці Cashu не є гаманцями LN). Механізм сліпого підпису забезпечує, що оператор мінту залишається не в курсі залишку на рахунках користувачів або даних транзакцій. Хоча мінт залишається не в курсі своєї бази користувачів у поточній реалізації, [додатковий протокол автентифікації буде додано](https://x.com/CashuBTC/status/1791001643019809146) до протоколу, що дозволяє мінтам контролювати доступ до своїх послуг. Цей протокол автентифікації дозволяє інтеграцію KYC/AML з Ecash. Кожна організація, яка керує вузлом Lightning, може запустити мінт, використовуючи одну з [доступних реалізацій](https://docs.cashu.space/mints). Найлегший спосіб зробити це - через [Nutshell](https://github.com/cashubtc/nutshell)."
                },
                {
                    "title": "Випуск токенів",
                    "content": "Хоча Ecash сам є борговим зобов'язанням мінту перед користувачем, токени Ecash самі є носіями, що означає, що власник носія - у даному випадку [проста строка даних](https://www.youtube.com/watch?v=xfYmwc-gnK8&t=379s) - вважається власником активу. Щоб отримати токени Cashu, користувач має два варіанти: 1. Користувач може сплатити рахунок Lightning, виданий його [обраним мінтом](https://bitcoinmints.com/), який надає токени Ecash в обмін. 2. Користувач отримує Ecash від іншого користувача. Кожен мінт випускає свої власні токени."
                },
                {
                    "title": "Передача токенів",
                    "content": "Згадана строка даних (так званий токен Cashu) може бути надіслана через будь-який гаманець, який підтримує Cashu (навіть [офлайн](https://x.com/callebtc/status/1796071406624465113)) або через будь-який засіб обміну повідомленнями (наприклад, telegram, протокол nostr, .., навіть [радіо](https://x.com/jurbed/status/1748485334210396506)). Щоб запобігти подвійній витраті, одержувач повинен негайно обміняти свій токен на новий за допомогою відповідного мінту. Однак, якщо це токен, заблокований P2PK ([тут](https://github.com/cashubtc/nuts/blob/main/11.md)), відправник не може подвоїти витрату; одержувач може навіть бути офлайн і обмінятися в більш пізній момент. Використання гаманця Cashu, і якщо відправник і одержувач використовують той самий мінт (користувач може використовувати стільки мінтів, скільки хоче), призводить до безперебійного процесу, де мінт просто спалює токен відправника і випускає новий для одержувача. Міжмінтові трансакції реалізуються через функціональність «[Мульти-мінт обміну](https://docs.cashu.space/faq#mints)», яка працює через рахунки Lightning на базі. Недавно була реалізована еквівалентна Lightning MPP (Мульти-шляхове платежі), що називається «Multinut Payments» ([тут](https://x.com/callebtc/status/1793554488806248839)) у Cashu через [NUT15](https://github.com/cashubtc/nuts/blob/main/15.md). Cashu також пропонує [адреси Cashu](https://github.com/cashubtc/npubcash-server), сервіс LNURL."
                },
                {
                    "title": "Гаманці",
                    "content": "Гаманці Cashu керують транзакціями Ecash. На відміну від традиційних гаманців Lightning, гаманці Cashu не управляють вузлом Lightning. Натомість вони використовують протокол Cashu для взаємодії з мінтами Cashu, які обробляють інфраструктуру Lightning і зберігають кошти користувачів. Така структура вимагає, щоб користувачі довіряли мінту в процесі повернення їх Ecash назад у Lightning. [Безліч гаманців Cashu](https://docs.cashu.space/wallets) доступні: рідні гаманці, веб-гаманці та хедлесс CLI-гаманці. Всі вони дотримуються обов'язкових [Cashu NUTs](https://github.com/cashubtc/nuts), щоб забезпечити стандартизацію та безпеку. Вони відрізняються, наприклад, підтримкою Tor, інтеграцією nostr та додаванням різних необов'язкових специфікацій NUT. Для легкого інтегрування платежів Cashu в будь-який застосунок розробляється [CDK](https://github.com/cashubtc/cdk). [Cashu-ts](https://github.com/cashubtc/cashu-ts) є найпопулярнішою бібліотекою для гаманців на сьогодні."
                },
                {
                    "title": "Резервні копії",
                    "content": "Токени Cashu є токенами носія активів, що означає, що дані, збережені в гаманці (локальне сховище браузера), представляють фактичні гроші. Отже, якщо це сховище буде стерто, кошти будуть втрачені. Резервні копії підтримують той самий механізм сід-фрази. [Cashu.me](http://Cashu.me) має додаткову опцію експорту резервної копії, а [Minibits](https://github.com/minibits-cash/minibits_wallet) пропонує локальну резервну копію всіх ecash в базі даних, відокремленій від зберігання гаманця. Щоб перемістити свої токени Cashu до іншої реалізації гаманця, можна зробити передачу з гаманця в гаманець або спалити та перевипустити через LN."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Випадки використання",
            "content": [
                {
                    "title": "Кращий досвід зберігання завдяки підвищеному рівню конфіденційності користувачів",
                    "content": "Cashu намагається забезпечити кращий довірчий досвід, [посилюючи конфіденційність](https://maxmoney.substack.com/p/ecash-for-better-bitcoin-privacy) та захищаючи дані користувачів: довірена сторона не дізнається - на відміну від поточного стану - про залишки на рахунках користувачів або про їх історію транзакцій чи звички витрат."
                },
                {
                    "title": "Стійкість до цензури від конкретного користувача",
                    "content": "Довірена сторона може відмовити у пег-аут до BTC, але не може цього зробити проти конкретного користувача, оскільки мінт не знає, хто викуповує токен Cashu за BTC, що робить Ecash довіреним, але стійким до цензури. Більше того, користувачі отримують можливість легко обирати між різними мінтами, не проходячи складний процес реєстрації. Мінти зможуть обмежити доступ до свого мінту через [необов'язковий протокол автентифікації](https://github.com/cashubtc/nuts/pull/106)."
                },
                {
                    "title": "Cashu як кредитні токени для розблокування платних воріт",
                    "content": "Токени Cashu несуть властивості ваучера. Ці токени можуть використовуватися для отримання (приватності, що зберігає) та безоблікових доступів до онлайн-сервісів через платні ворота: будь то підключення до Інтернету, [анонімний доступ до API](https://github.com/cashubtc/xcashu), VPN-сервіс, [оплата за запит для LLM запитів](https://chatnut.sparkpay.pt/)."
                },
                {
                    "title": "Програмований Ecash",
                    "content": "Токен може також мати додаткові обмеження на витрати ([NUT11](https://github.com/cashubtc/nuts/blob/main/11.md)), використовуючи P2PK. Це дозволяє часово заблоковані платежі, мультипідписи або умовні платежі."
                },
                {
                    "title": "Субміні-нут? (Еквівалент Submarine Swap)",
                    "content": "На основі Ecash HTLC можуть бути атомарно пов'язані з HTLC Ecash ([Калле](https://x.com/callebtc/status/1742948259050500561)). Це може дозволити еквівалент субміні-обміну (BTC-LN), що називається «[субміні-нутами](https://x.com/callebtc/status/1704915759808303542)» (Cashu <--> LN), що означає, що вузли LN можуть допомагати один одному у отриманні коштів, навіть якщо у них немає жодних каналів або вхідної ліквідності."
                },
                {
                    "title": "Cashu через nostr",
                    "content": "Токени Cashu можуть бути [надіслані](https://x.com/CashuBTC/status/1616063616150634498) через [nostr](https://nostr.com/), відкритий протокол, який дозволяє створити дійсно стійку до цензури та глобальну соціальну мережу. [Повідомлення є зашифрованим NIP-04 DM](https://x.com/CashuBTC/status/1607423255681318914). Nostr Wallet Connect (NWC) ще більше [дозволить користувачам надсилати іншим користувачам токени Cashu](https://x.com/callebtc/status/1787519215051715016). Нещодавно був [запропонований новий протокол надсилання для nostr на основі Cashu ecash](https://github.com/nostr-protocol/nips/pull/1369)."
                },
                {
                    "title": "Stablenuts: USD Ecash, підтримуваний BTC (еквівалент Stablesats)",
                    "content": "Stablenuts [тестувалися](https://x.com/CashuBTC/status/1711676159639929135) як Cashu USD мінт, підтримуваний гаманцем Strike Lightning BTC. Це дозволяє конвертувати Lightning BTC в Ecash USD і назад у Lightning BTC, потенційно працюючи на DLC, USDT, LNMarkets, Stablesats або будь-яких стабільних біткойн-каналах. Версія без Strike була [представлена](https://x.com/callebtc/status/1770097016686645642) в березні 2024 року, з її [першими тестами](https://x.com/callebtc/status/1777598819355496587) в квітні 2024 року. [Boardwalk представив](https://x.com/makeprisms/status/1790423585888280756) перший доларовий Cashu гаманець, побудований на Bitcoin та підключений до nostr незабаром після."
                },
                {
                    "title": "Грошова одиниця вільного міста",
                    "content": "[Схоже](https://x0f.org/@waxwing/108459745605989567) вже була спроба використати форму Chaumian Ecash, звану “DMT” у Коста-Риці в 1990-х роках. Поточні випробування намагаються спрямуватися на (набагато) меншу версію вільного міста, яке є [приватною подією](https://x.com/SovereignProtoc/status/1777561415379042582), наприклад, конференцією або фестивалем."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Додаткові міркування",
            "content": [
                {
                    "title": "Точки зупинки конфіденційності (викликані користувачем) ([Cashu FAQ](https://docs.cashu.space/faq#general-safety-and-privacy-questions))",
                    "content": "Хоча передачі токенів Cashu забезпечують неперевершений рівень конфіденційності для транзакційної сторони, є кілька точок зупинки, про які слід пам'ятати: ненадання VPN/Tor/mixnet тощо під час взаємодії з мінтом може витікати мережеві метадані. Мінт може збирати мережеві дані, такі як час доступу, IP-адреси та інші метадані, які користувачі можуть витікати, взаємодіючи з мінтом та отримуючи Bitcoin через LN в обмін. Характеристики конфіденційності одержувача в LN у цьому випадку застосовуються."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Джерельний код",
            "content": [
                {
                    "title": "Код є відкритим виходом",
                    "content": "Весь код, пов'язаний з проектом Cashu, є безкоштовним і відкритим."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Головний веб-сайт Cashu](https://cashu.space/)\n[Курована секція ресурсів](https://docs.cashu.space/resources/learn)\n[Девід Чаум - сліпі підписи для неможливих платежів](https://chaum.com/wp-content/uploads/2022/01/Chaum-blind-signatures.pdf)\n[Схема підтвердження зобов'язань](https://gist.github.com/callebtc/ed5228d1d8cbaade0104db5d1cf63939)\n[Специфікація Cashu NUTs (нотація, використання та термінологія)](https://github.com/cashubtc/nuts)"
                }
            ]
        }
    ]
}
