{
    "slug": "fedimint",
    "title": "Fedimint",
    "infrastructureType": "Federation SDK",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "yes",
    "riskFactors": ["", ""],
    "bitcoinSecurity": "No",
    "nativeToken": "BTC",
    "purpose": "Federated Ecash mint",
    "associatedLayers": "-",
    "bitcoinOnly": true,
    "links": [
        "https://fedimint.org",
        "https://fedimint.org",
        "https://fedimint.org/docs/intro",
        "https://github.com/fedimint",
        "https://x.com/fedimint"
    ],
    "description": "Fedimint — це модульна відкрита платформа для створення федеративних додатків, які можуть спільно управлятися групою надійних учасників. Основним додатком, який зараз знаходиться в експлуатації, є відкрита федеративна електронна валюта. У конструкції Fedimint користувачі заморожують свої BTC у багатопідписі федерації і отримують в обмін електронну валюту IOU. Ця концепція покращує домінуючу в даний час форму третіх осіб, що зберігають кошти, оскільки користувач має соціально відому та надійну особу, яка охороняє його BTC; концепція, яка називається \"друге зберігання\".",
    "sections": [
        {
            "id": "riskbits",
            "title": "Ризики",
            "content": [
                {
                    "title": "Користувачі не мають зберігання своїх BTC і покладаються на охоронців для обробки виведень",
                    "content": "Користувачі вносять BTC у багатопідпис, щоб взаємодіяти з Fedimint. Fedimint не дозволяє односторонні виходи. Користувачі явно довіряють підписантам, відомим як охоронці, багатопідпису федерації, щоб вони не вкрали їхні кошти. Вкрасти кошти користувачів потрібно, щоб більшість (наприклад, 3/5 або 7/13) охоронців змовилися. Саме тому \"знати свою федерацію\" є ключовою вимогою при виборі другого зберігання."
                },
                {
                    "title": "Федерація може припинити свою роботу",
                    "content": "Fedimint розроблений для витривалості до візантійських збоїв. Він стійкий до m зловмисних вузлів у федерації з 3m + 1 вузлів. Це означає, що якщо ви запустите федерацію з 4 охоронцями, ви будете стійкими до 1 з них, що вийшов з ладу/зловмисного. Якщо ви запустите федерацію з 7 охоронцями, 2 з них можуть припинити свою роботу, не впливаючи на роботу монети. Нещодавня проблема з DNS призвела до того, що 1 з 4 охоронців у федерації залишився назавжди офлайн, що ставить федерацію під високий ризик стати нефункціональною."
                },
                {
                    "title": "Федерація може втратити доступ до ключів і, отже, до коштів користувачів",
                    "content": "Як і в будь-якому сховищі, федерація може втратити доступ до своїх ключів, що може призвести до неможливості для користувача викупити свої токени електронної валюти за внесені BTC. Ймовірність цього сценарію досить низька, оскільки це багатопідписова установка, яка стійка до кількох недоступних ключів."
                },
                {
                    "title": "Ризик девальвації",
                    "content": "Токени електронної валюти представляють претензію на BTC, що знаходяться у охоронців федерації. Як такі, існує ризик, що федерація видає більше претензій на біткоїни, ніж насправді має, що означає, що зобов'язання (випущені токени електронної валюти) перевищують реальні активи (біткоїни, що зберігаються в резерві). Ця невідповідність може призвести до того, що користувачі не зможуть викупити свої (не забезпечені) токени за біткоїн."
                }
            ]
        },
        {
            "id": "coretechnology",
            "title": "Основні технологічні компоненти",
            "content": [
                {
                    "title": "Chaumian електронна валюта",
                    "content": "Chaumian електронна валюта дозволяє Fedimint створювати та викуповувати нотатки IOU, які представляють претензії на біткоїн. Електронна валюта використовує затемнені підписи. Це захищає баланс користувачів у монеті та забезпечує конфіденційність транзакцій."
                },
                {
                    "title": "Федерації",
                    "content": "Fedimint класифікується як “федеративна Chaumian монета”, яка спільно управляється кількома надійними суб’єктами (які називаються охоронцями) через багатопідпис."
                },
                {
                    "title": "Свопи Lightning",
                    "content": "Fedimint забезпечує інтерактивність Lightning через LN шлюзи. Охоронець або будь-який користувач федерації можуть запустити вузол Lightning і оплачувати та приймати рахунки Lightning від імені користувачів у федерації. Це особливо корисно, оскільки користувачам Fedimint не потрібно бути онлайн, щоб приймати платежі Lightning."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Використання",
            "content": [
                {
                    "title": "Приватні платежі",
                    "content": "Fedimint дозволяє анонімні платежі за допомогою затемнених підписів. Монета не знає про транзакції, здійснені користувачами, або про їх відповідний баланс рахунку. Монета може встановити зв'язок з адресою користувача лише при закріпленні всередині та зовні монети."
                },
                {
                    "title": "Друге зберігання",
                    "content": "Вважається, що самозберігання в його теперішній формі є складним для користувачів, які не є технічно підготовленими. Fedimint дозволяє користувачам вносити свої біткоїни у федерацію надійних \"других\" сторін (наприклад, член родини або лідер спільноти). Федеративне зберігання в спільноті може бути переважним для деяких користувачів порівняно з домінуючою моделлю зберігання третіх осіб."
                },
                {
                    "title": "Дешеві та швидкі транзакції",
                    "content": "Fedimint забезпечує низькі комісії за транзакції для користувачів, оскільки монета є центральним суб'єктом, і транзакції не потребують блочного простору біткоїнів. Внески коштів можуть бути здійснені як через ончейн внесок, так і через мережу Lightning."
                },
                {
                    "title": "Смарт-контракти загального призначення",
                    "content": "Fedimint може підтримувати будь-які довільні обчислення. Федерації, які підтримують модулі додатків, такі як протоколи позик і кредитів, а також стейблкоіни, можливі."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Весь код, пов'язаний з проектом Fedimint, є вільним та відкритим."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнатися більше",
                    "content": "[Сайт документації Fedimint, що охоплює технологічні компоненти та варіанти використання.](https://fedimint.org)\n[Fedi пропонує гаманець Fedimint і демонструє, як Fedimint працює на практиці.](https://www.fedi.xyz/product)\n[Часті питання Fedimint відповідають на поширені запитання.](https://fedimint.org/docs/category/frequently-asked-questions)"
                }
            ]
        }
    ]
}
