{
    "slug": "lombard",
    "title": "Lombard",
    "infrastructureType": "Liquid Staking",
    "live": "Mainnet",
    "staking": true,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["", ""],
    "bitcoinSecurity": "No",
    "nativeToken": "LBTC",
    "purpose": "Staking",
    "associatedLayers": "Ethereum",
    "bitcoinOnly": true,
    "links": [
        "https://www.lombard.finance/app/",
        "https://docs.lombard.finance/",
        "https://docs.lombard.finance/",
        "https://docs.lombard.finance/",
        "https://github.com/lombard-finance",
        "https://x.com/Lombard_Finance"
    ],
    "description": "Lombard — це протокол ліквідного стейкінгу, де мережа консорціуму безпеки ставить активи від імені користувачів.",
    "sections": [
        {
            "id": "assessment",
            "title": "Оцінка",
            "content": [
                {
                    "title": "Зберігання активів",
                    "content": "Користувачі довіряють мережі зберігачів зберігання своїх BTC.\n\nКоли користувачі вносять BTC до протоколу Lombard, їх активи зберігаються в біткоїн-адресі, що зберігається у захищеному апараті. Ця адреса контролюється Консорціумом безпеки Lombard, федеративною мережею операторів, відповідальних за контроль коштів на адресі депозиту, а також за стейкінг BTC від імені користувачів.\n\nКонсорціум безпеки Lombard бере участь у протоколі консенсусу. Реалізацію вузла можна переглянути тут.\n\n🚨 Члени Консорціуму безпеки Lombard не були публічно розкриті."
                },
                {
                    "title": "Тип стейкінгу (делегований або прямий стейкінг)",
                    "content": "Користувачі делегують свої BTC Консорціуму безпеки Lombard для стейкінгу BTC від їх імені. Користувачі вибирають, через який протокол вони хочуть ставити (наприклад, Babylon) і/або на якій цільовій ланцюзі їх токен LBTC буде випущений (наприклад, Ethereum).\n\nЯкщо користувач випускає LBTC на цільовій ланцюзі, він може використовувати цей токен у різних ончейн-протоколах. Ці протоколи можуть виплачувати винагороди на основі різних параметрів."
                },
                {
                    "title": "Ризик штрафування",
                    "content": "Ризик штрафування користувачів виникне внаслідок того, що валідатори PoS, до яких їх токени делеговані, можуть бути штрафовані. Штрафування наразі не активне на Babylon."
                },
                {
                    "title": "Модель стимулювання",
                    "content": "Користувачі отримують бали за стейкінг у протоколі Lombard. Вони також мають можливість вносити кошти до “DeFi Vault” Lombard.\n\nКоли користувачі вносять свої токени LBTC до сховища, вони відмовляються від зберігання своїх токенів LBTC для сховища. Оператори сховища використовують цю ліквідність і застосовують її до торгової стратегії, яка може потенційно приносити прибуток користувачам.\n\nЗ часом, якщо торгова стратегія буде прибутковою, користувачі зароблять доходи на основі кількості LBTC, які вони внесли до DeFi сховища.\n\n⚠️ Якщо торгова стратегія буде реалізована погано, кошти користувачів можуть бути під загрозою ліквідації та втрати."
                },
                {
                    "title": "Як визначається APY",
                    "content": "Потенційні можливості доходу залежать від різних параметрів ончейн-додатків і моделі делегування у PoS-ланцюгах, де LBTC може використовуватися через Babylon."
                },
                {
                    "title": "Смарт-контракти та аудити",
                    "content": "Lombard опублікував аудиторські звіти про свої смарт-контракти тут.\n\nКод за Lombard також доступний для перегляду тут.\n\n⚠️ Аудити смарт-контрактів не означають, що експлойти неможливі. Користувачі не повинні вносити більше коштів, ніж вони готові втратити."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнатися більше",
                    "content": "[Документація Lombard](https://docs.gobob.xyz/docs/learn/security/privileged-roles)"
                }
            ]
        }
    ]
}
