{
    "slug": "lombard",
    "title": "Lombard",
    "infrastructureType": "Liquid Staking",
    "live": "Mainnet",
    "staking": true,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["", ""],
    "bitcoinSecurity": "No",
    "nativeToken": "LBTC",
    "purpose": "Staking",
    "associatedLayers": "Ethereum",
    "bitcoinOnly": true,
    "links": [
        "https://www.lombard.finance/app/",
        "https://docs.lombard.finance/",
        "https://docs.lombard.finance/",
        "https://docs.lombard.finance/",
        "https://github.com/lombard-finance",
        "https://x.com/Lombard_Finance"
    ],
    "description": "Lombard is a liquid staking protocol where a security consortium network stakes assets on users' behalf.",
    "sections": [
        {
            "id": "assessment",
            "title": "Assessment",
            "content": [
                {
                    "title": "Asset custody",
                    "content": "Users trust a network of custodians with the custody of their BTC.\n\nWhen users deposit BTC into the Lombard protocol, their assets are held in a Bitcoin address stored in a secured hardware. This address is controlled by Lombard’s Security Consortium, a federated network of operators responsible for controlling funds in the deposit address, as well as staking the BTC on users behalf.\n\nLombard’s Security Consortium participates in a consensus protocol. The node implementation is viewable here.\n\n🚨 The members of the Lombard Security Consortium have not been publicly disclosed."
                },
                {
                    "title": "Staking type (delegated or direct staking)",
                    "content": "Users delegate their BTC to the Lombard Security Consortium to stake BTC on their behalf. Users select which protocol they want to stake through (e.g. Babylon) and/or the destination chain their LBTC token is minted on (e.g. Ethereum).\n\nShould a user mint LBTC on a destination chain, they can use this token in various onchain protocols. These protocols may pay out rewards based on varying levels of parameters."
                },
                {
                    "title": "Slashing risk",
                    "content": "Users’ slashing risk will be a result of PoS validators, whom their tokens are delegated to, getting slashed.. Slashing is not currently live on Babylon."
                },
                {
                    "title": "Incentive model",
                    "content": "Users receive points for staking in the Lombard protocol. They additionally have an opportunity to deposit funds into the Lombard “DeFi Vault”.\n\nWhen users deposit their LBTC tokens into the vault, they give up the custody of their LBTC token to the vault. The operators of the vault take this liquidity and apply it to a trading strategy, which can potentially earn users profits.\n\nOver time, should the trading strategy be profitable, users would earn returns based on the amount of LBTC they deposited into the DeFi vault.\n\n⚠️ If a trading strategy was executed poorly, user funds could be at risk for liquidation and loss."
                },
                {
                    "title": "How APY is determined",
                    "content": "Potential yield opportunities are dependent on the various onchain applications parameters, and the delegation model in the PoS chains LBTC might be used via Babylon."
                },
                {
                    "title": "Smart contracts & audits",
                    "content": "Lombard has published audit reports on its smart contracts here.\n\nThe code behind Lombard’s is also source viewable here.\n\n⚠️ Audits of smart contracts do not mean exploits are not possible. Users should not deposit more funds than they’re willing to lose."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Knowledge Bits",
            "content": [
                {
                    "title": "Learn more",
                    "content": "[Lombard's documentation site](https://docs.gobob.xyz/docs/learn/security/privileged-roles)"
                }
            ]
        }
    ]
}
