{
    "slug": "tbtc",
    "title": "tBTC Протокол",
    "infrastructureType": "Брідж для Bitcoin",
    "live": "Mainnet",
    "staking": false,
    "bridge": true,
    "underReview": "так",
    "riskFactors": ["", ""],
    "bitcoinSecurity": "Ні",
    "nativeToken": "T",
    "purpose": "Загальний",
    "associatedLayers": "EVM-базовані блокчейни",
    "bitcoinOnly": false,
    "links": [
        "https://threshold.network/",
        "https://threshold.network/",
        "https://docs.threshold.network/",
        "https://github.com/threshold-network",
        "https://x.com/thetnetwork"
    ],
    "description": "tBTC — це обгорнута версія BTC, яка існує як токен ERC-20 на EVM-базованих блокчейнах. Його обліковий регістр — Ethereum. Bitcoin, що підкріплює tBTC, захищений розподіленим набором підписувачів і механізмом стейкінгу.",
    "sections": [
        {
            "id": "riskbits",
            "title": "Ризики",
            "content": [
                {
                    "title": "Кустодія біткоїнів, що підкріплює tBTC, управляється уповноваженими особами",
                    "content": "Біткоїн-гаманці, що зберігають біткоїни, які підкріплюють tBTC, управляються уповноваженим набором підписувачів. Підписувачі гаманців беруть участь як стейкери в контракті стейкінгу Ethereum, щоб отримати право підпису. Коли створюється новий гаманець, випадковий процес, відомий як пул відбору, вибирає підписувачів, які будуть відповідальні за зберігання коштів і підписування транзакцій для відповідних біткоїн-гаманців.\n\nЯкщо підписувачі змовляться і отримають достатню кількість підписувацької влади для біткоїн-гаманця, вони можуть вкрасти кошти з гаманця, який вони управляють."
                },
                {
                    "title": "Процес вибору підписувачів вплине на ставку токена T",
                    "content": "Підписувачі біткоїн-гаманців, що підкріплюють tBTC, вибираються випадковим процесом, відомим як пул відбору. Хоча це випадково, загальна вартість стейка потенційного підписувача вплине на кількість часток ключа, які вони отримують у схемі підпису з порогом. Якщо потенційний підписувач має значну частку (наприклад, > 51%), існує ймовірність, що вони можуть фактично отримати односторонній контроль над окремим біткоїн-гаманцем.\n\nЦе наразі пом'якшується тим, що права підпису tBTC наразі є уповноваженими, і підписувачі повинні бути затверджені DAO Threshold у його поточному налаштуванні. Якщо права підпису tBTC стануть бездозволеними, механізм може бути вразливим до злочинних осіб, які придбають велику частку."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Схема tECDSA",
                    "content": "Підписувачі, які беруть участь у захисті біткоїн-гаманців у протоколі tBTC, використовують схему tECDSA, щоб розподілити приватний ключ гаманця між кількома сторонами. У tBTC схема tECDSA має поріг 51%. Потрібно 51% підписувачів, щоб створити дійсний підпис для біткоїн-транзакції.\n\nПідписувачі біткоїн-гаманців вибираються через випадковий процес, відомий як пул відбору. Коли створюється новий гаманець, підписувач подає транзакцію відбору, щоб запустити церемонію розподіленого генерування ключа. Потім пул відбору вибирає кількість підписувачів для участі в церемонії, генерує новий гаманець і розподіляє частки приватного ключа серед групи підписувачів.\n\nПісля того, як підписувачі отримують свої індивідуальні частки ключа, вони беруть участь у подіях підпису через протокол комунікації поза ланцюгом."
                },
                {
                    "title": "Контракти стейкінгу Ethereum",
                    "content": "Участь у протоколі tBTC вимагає, щоб потенційний підписувач брав участь як стейкер. Контракти стейкінгу tBTC живуть на Ethereum. Підписувачу потрібно отримати необхідну кількість токенів T, щоб взяти участь як стейкер, стейкувати їх через контракт стейкінгу T і потім подати заявку на отримання статусу підписувача через управління Threshold."
                },
                {
                    "title": "Кілька біткоїн-гаманців",
                    "content": "tBTC періодично створює нові гаманці для зберігання біткоїнів, які підкріплюють tBTC. Кожен гаманець проходить свою власну церемонію розподіленого генерування ключа і має унікальну настройку підписувачів. Це розподіляє ризик змови та крадіжки між кількома гаманцями та групами підписувачів."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Порівняння tBTC, wBTC та cbBTC від Bitcoin Layers](https://mirror.xyz/0x715823F52163575f023b9090a775522249887619/3gaFbT7qQBKEbsjN3Gp_SQe6-QvdZNHuszoasNnvSUo)"
                }
            ]
        }
    ]
}
