{
    "slug": "ark",
    "title": "Ark",
    "layerType": "Virtual UTXOs",
    "staking": false,
    "live": "Mainnet",
    "bridge": false,
    "underReview": "yes",
    "riskFactors": ["Unverified", "Unverified", "Unverified", "Unverified"],
    "purpose": "Payments",
    "btcBridge": "LBTC",
    "settlement": "Offchain",
    "btcLocked": 0,
    "executionEnv": "Offchain",
    "consensus": "Under review",
    "nativeToken": "LBTC",
    "feeToken": "LBTC",
    "enshrinedBtc": "LBTC",
    "bitcoinOnly": true,
    "links": [
        "https://arklabs.to",
        "https://arkdev.info",
        "https://arkdev.info/docs/",
        "https://arkdev.info/docs/developers/get-started",
        "https://github.com/ark-network",
        "https://x.com/ArkLabsHQ"
    ],
    "description": "Цей огляд охоплює реалізацію Ark, написану на [Go](https://github.com/ark-network/ark), що працює в мережі Liquid. Окремий огляд для версії Ark без заповідників (clArk), яка працює на Bitcoin, буде наданий пізніше. Ark є запропонованим протоколом платежів, призначеним для переміщення вимог до ліквідності до центрального оператора, що є завжди активним сервером, відомим як Ark Service Provider (ASP). Наразі жоден ASP не підтримує Ark на Liquid.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "High",
            "title": "Користувачі вступають у 2-із-2 мультипідпис з ASP, що гарантує односторонній вихід на L-BTC, але не на BTC",
            "content": "Користувач вносить свій L-BTC у 2-із-2 мультипідпис з ASP, отримуючи натомість позначений VTXO. Ця установка дозволяє користувачу односторонньо виходити назад на блокчейн Liquid, забезпечуючи самостійне зберігання коштів, якщо вони перевищують мінімальну комісію за передачу на блокчейні Liquid. Однак кошти стають кастодіальними, якщо користувач не оновить свої монети протягом визначеного часу, що дозволяє ASP забрати їх. Важно зазначити, що L-BTC не може бути односторонньо виведений на BTC через федеративну природу Liquid.\n\n🔬Ми наразі переглядаємо підписантів для двостороннього пегу Liquid, що вплине на цю реалізацію Ark."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Дані зберігаються в ланцюгу (Liquid) в спільному виході транзакції",
            "content": "VTXO об'єднані в бінарне дерево, при цьому VTXO слугують листям дерева. Це бінарне дерево потім включається в блок Liquid як спільний вихід. У випадках вирішення спорів VTXO можуть бути розкриті. Під час проведення транзакцій користувач отримує дані дерева разом з індексом, що вказує на позицію його відповідного VTXO в дереві. Важно зазначити, що дані Liquid зберігаються поза блокчейном Bitcoin. Користувачі можуть запускати архівні вузли на Liquid, які зберігають повну історію блокчейну Liquid."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "High",
            "title": "Оперується постачальником послуг, ASP, і залежить від активності блокчейну Liquid для забезпечення одностороннього виходу",
            "content": "Мережа Ark управляється центральною сутністю, ASP, завжди активним сервером, що забезпечує ліквідність і відповідає за видачу VTXO після депозиту L-BTC на блокчейні Liquid. ASP є зменшено довіреним. Лише через змову з функціонерами Liquid він може обманути користувачів: ASP може зазвичай заявити про VTXO, якщо користувач не оновить їх або односторонньо не вийде вчасно. Один зі способів, як ASP може зловживати цим, - це змова з виробниками блоків батьківського ланцюга, щоб затримати односторонній вихід, так що ASP може в кінцевому підсумку заявити про кошти користувачів. Без змови ASP з функціонерами Liquid можливий односторонній вихід до Liquid. Крім того, оскільки ця реалізація Ark працює на Liquid, користувачі довіряють, що відповідні функціонери, які керують блокчейном Liquid, включать їхні зняття з ланцюга в блок Liquid."
        },
        {
            "category": "Settlement Assurance",
            "score": 0,
            "tier": "High",
            "title": "Кошти доступні відразу для подальших переказів VTXO, тоді як остаточність досягається лише з підтвердженням блоку на Liquid",
            "content": "Транзакції Ark працюють за принципом [запізненої остаточності, але миттєвої доступності](https://x.com/brqgoo/status/1661396945653448708). Хоча остаточність досягається лише тоді, коли спільний вихід підтверджується в блоці на блокчейні Liquid, кошти одразу доступні користувачу для використання в транзакції LN або іншій транзакції Ark."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Ark на Liquid не отримує жодної безпеки від мережі Bitcoin",
                    "content": "Ark на Liquid не отримує жодної безпеки від Bitcoin, оскільки Liquid є федеративним сайдчейном, незалежним від Bitcoin. Для отримання додаткової інформації відвідайте наш [Огляд ризиків Liquid](https://www.bitcoinlayers.org/layers/liquid)."
                },
                {
                    "title": "Протокол не дозволяє MEV на Bitcoin",
                    "content": "Ark на Liquid не вводить жодного MEV у Bitcoin."
                },
                {
                    "title": "Для безпеки мережі не потрібен альтернативний токен",
                    "content": "Альтернативний токен не потрібен для безпеки мережі. VTXO видаються ASP. Вони існують поза блокчейном Liquid і підтримуються L-BTC. Сам L-BTC пегується через федеративний мультипідпис до BTC."
                },
                {
                    "title": "Ark на Liquid не сприяє бюджету безпеки",
                    "content": "Ark на Liquid не сплачує жодних комісій видобувачам Bitcoin."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Додаткові міркування",
            "content": [
                {
                    "title": "На даний момент немає активних ASP на Ark на Liquid",
                    "content": "На даний момент немає ASP, які підтримують Ark на Liquid. Це означає, що користувачі не можуть взаємодіяти з мережею, якщо не запустять свій власний ASP. Демонстраційний додаток було створено для Bitcoin++ для тестування та демонстраційних цілей, але підтримка наразі застаріла."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення коштів",
            "content": [
                {
                    "title": "Користувачі можуть односторонньо виводити свої кошти з оптимістичними гарантіями врегулювання",
                    "content": "У випадку [кооперативного виходу](https://arkdev.info/docs/learn/leaving#cooperative-exit) користувач обмінює свій VTXO на UTXO в ланцюгу. Цей обмін здійснюється ASP за допомогою раундової транзакції. Кроки: ASP створює раундову транзакцію з додатковим виходом, заблокованим Алісою (вихід з'єднувача). Потім користувач підписує транзакцію про конфіскацію, яка витрачає старий VTXO та додає вихід з'єднувача з раніше створеної раундової транзакції. ASP потім транслює раундову транзакцію, надаючи користувачу новий UTXO. Протягом чотирьох тижнів користувач може подвоїти витрату свого VTXO. Спроба зробити це призводить до того, що ASP отримує можливість заявити про кошти користувача протягом 24 годин, використовуючи підписану користувачем транзакцію про конфіскацію.\n\nУ випадку некоперативного виходу, через непрацюючого або зловмисного ASP, VTXO Ark може бути викуплений як UTXO на блокчейні Liquid, за умови, що ASP не змовляється з функціонерами Liquid. Односторонній вихід ініціюється користувачем через розкриття гілки спільного виходу, що блокує їхні кошти. Це забезпечує самостійне зберігання коштів Ark у відношенні до L-BTC, навіть незважаючи на те, що третя сторона залучена до обробки транзакцій.\n\nЩоб обробити виведення коштів з L-BTC назад на BTC, користувачі повинні або довірити функціонерам Liquid обробку своїх виведень, або виконати обмін між BTC і L-BTC з третьою стороною."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технологія",
            "content": [
                {
                    "title": "VTXO та їх передача",
                    "content": "Транзакції VTXO поза ланцюгом відбуваються через так звані 'Ark-раунди', які здійснюються ASP. Раунд відбувається періодично, включаючи VTXO в спільний вихід на блокчейні Liquid як частину дерева заповідників. Передача VTXO відбувається атомарно за рахунок додавання так званих виходів-з'єднувачів. Виходи-з'єднувачі забезпечують, що ASP може претендувати на старий VTXO користувача лише тоді, коли новий був створений ASP як частина нового спільного виходу. Важно зазначити, що користувач може викупити ці чеки на блокчейні Liquid без взаємодії з ASP."
                },
                {
                    "title": "Оновлення VTXO з періодичними вимогами до активності користувача",
                    "content": "З введенням Ark-раундів користувач зобов'язаний оновлювати свої VTXO, відкриваючи свій Ark-гаманець до закінчення терміну спільного виходу (поточний стандартний тайм-аут встановлено на чотиритижневий період, але це специфічно для ASP). Невиконання цієї умови призводить до того, що ASP може забрати кошти користувачів. Ці [кошти потім утримуватимуться кастодіально оператором](https://x.com/brqgoo/status/1806875774265241781) і можуть бути повернені користувачеві для повторного зберігання в некостодіальному вигляді, якщо оператор обробить їх запит. Щоб пом'якшити це, пропонується рішення на зразок вежі спостереження, де користувач може делегувати оновлення VTXO."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Варіанти використання",
            "content": [
                {
                    "title": "Покращений UX самостійного зберігання для кінцевих користувачів",
                    "content": "Ark слугуватиме додатковим протоколом до Lightning Network. Самостійне використання коштів на LN залишається викликом для не технічних кінцевих користувачів, перш за все через проблеми з вхідною ліквідністю. Ark як самостійний варіант може обійти ці проблеми, оскільки вимоги до ліквідності перекладаються на ASP.\n\nКрім того, Ark може працювати як додаткова послуга обмінів або брокерських компаній для полегшення самостійного зберігання коштів користувачів. У разі, якщо користувач не оновить кошти, вони повертаються до традиційної кастодіальної моделі, яку забезпечують обміни."
                },
                {
                    "title": "Масштабування L-BTC для кінцевих користувачів",
                    "content": "Модель спільного виходу Ark слугує методом масштабування, оскільки UTXO розподіляються серед багатьох користувачів, потенційно до десятків або сотень тисяч користувачів. Ark функціонуватиме як додатковий протокол до Lightning. У той час як Lightning масштабує вертикально, [Ark масштабує горизонтально](https://x.com/tierotiero/status/1798301214905606227). Іншими словами, Ark можна розглядати як [шар очищення](https://x.com/RyanTheGentry/status/1663322538443698177) (який сприяє транзакціям між двома суб'єктами в одному ASP), тоді як Lightning слугуватиме шаром врегулювання (транзакції між двома ASP), а Liquid буде остаточним судом, підтверджуючи спільний вихід у блоці."
                },
                {
                    "title": "Офлайн платежі",
                    "content": "Протокол Ark на Liquid забезпечує (самостійні) офлайн транзакції, використовуючи заповідники, зокрема [опкоди інспекції](https://glossary.blockstream.com/introspection-opcodes/). Це є значним покращенням у порівнянні з поточним станом асинхронних платежів на LN."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Код є відкритим на [GitHub](https://github.com/ark-network/ark), доступний під ліцензією MIT."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Ark Developer Hub](https://arkdev.info)\n[Найпростіше пояснення Ark](https://gist.github.com/RubenSomsen/a394beb1dea9e47e981216768e007454?permalink_comment_id=4633382#simplest-ark-explanation)\n[Оновлення про Ark з Tiero](https://stephanlivera.com/episode/584/)"
                }
            ]
        }
    ]
}
