{
    "slug": "ark",
    "title": "Ark (on Liquid)",
    "layerType": "Virtual UTXOs",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Medium", "High", "High"],
    "purpose": "Payments",
    "btcBridge": "LBTC",
    "settlement": "Offchain",
    "btcLocked": 0,
    "executionEnv": "Offchain",
    "consensus": "Under review",
    "nativeToken": "LBTC",
    "feeToken": "LBTC",
    "enshrinedBtc": "LBTC",
    "bitcoinOnly": true,
    "links": [
        "https://arklabs.to",
        "https://arkdev.info",
        "https://arkdev.info/docs/",
        "https://arkdev.info/docs/developers/get-started",
        "https://github.com/ark-network",
        "https://x.com/ArkLabsHQ"
    ],
    "description": "Цей огляд охоплює реалізацію Ark, написану на [Go](https://github.com/ark-network/ark), яка працює в мережі Liquid. Окремий огляд для версії Ark без ковенантів (clArk), яка працює на Bitcoin, буде надано пізніше. Ark — це запропонований протокол платежів, розроблений для переміщення вимог до ліквідності до центрального оператора, що є завжди активним сервером, відомим як Ark Service Provider (ASP). Наразі немає жодних ASP, що підтримують Ark на Liquid.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "Користувачі входять у 2-зі 2 мультипідпис з ASP, що гарантує односторонній вихід на L-BTC, але не на BTC",
            "content": "Користувач вносить свої L-BTC у 2-зі 2 мультипідпис з ASP, отримуючи натомість позамежний VTXO. Налаштування дозволяє користувачу односторонньо вийти назад на Liquid blockchain, забезпечуючи самостійне зберігання коштів, якщо вони перевищують мінімальну плату за пересилку в мережі Liquid. Однак, кошти стають кастодіальними, якщо користувач не оновить свої монети протягом визначеного періоду очікування, що дозволяє ASP їх забрати. Важливо зазначити, що L-BTC не може бути односторонньо виведено на BTC через федеративну природу Liquid.\n\n🔬Ми наразі перевіряємо підписантів для двостороннього пегу Liquid, що вплине на цю реалізацію Ark."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Дані зберігаються в мережі (Liquid) у спільному виході транзакції",
            "content": "VTXO згруповані в бінарне дерево, причому VTXO є листям дерева. Це бінарне дерево потім включається в блок Liquid як спільний вихід. У випадках розв'язання суперечок VTXO можуть бути виявлені. Під час проведення транзакцій користувач отримує дані дерева разом з індексом, що вказує на позицію їх відповідного VTXO в дереві. Важно зазначити, що дані Liquid зберігаються поза блокчейном Bitcoin. Користувачі можуть запускати архівні вузли в Liquid, які зберігають повну історію блокчейну Liquid."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "High",
            "title": "Оперативність надається постачальником послуг, ASP, та залежить від активності блокчейну Liquid для забезпечення одностороннього виходу",
            "content": "Мережа Ark управляється центральною сутністю, ASP, завжди активним сервером, який забезпечує ліквідність і відповідає за випуск VTXO після депозиту L-BTC у блокчейн Liquid. ASP є мінімізованим за довірою. Тільки шляхом змови з функціонерами Liquid, він може обманути користувачів: ASP загалом може вимагати VTXO, якщо користувач не оновлює їх або не виконує односторонній вихід вчасно. Один зі способів, як ASP може зловживати цим, — змова з виробниками блоків батьківського ланцюга для затримки одностороннього виходу, щоб ASP в кінцевому підсумку міг вимагати кошти користувачів. Без змови ASP з функціонерами Liquid можливий односторонній вихід на Liquid. Крім того, оскільки ця реалізація Ark працює на Liquid, користувачі довіряють відповідним функціонерам, які управляють блокчейном Liquid, включити їх ончейн-виведення в блок Liquid."
        },
        {
            "category": "Settlement Assurance",
            "score": 0,
            "tier": "High",
            "title": "Кошти доступні одразу для подальших VTXO-трансферів, тоді як фіналізація досягається лише після підтвердження блоку в Liquid",
            "content": "Транзакції Ark функціонують за принципом [затриманої фіналізації, але негайної доступності](https://x.com/brqgoo/status/1661396945653448708). Хоча фіналізація досягається лише після підтвердження спільного виходу в блоці на блокчейні Liquid, кошти негайно доступні для користувача для використання в транзакції LN або іншій транзакції Ark."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Ark на Liquid не успадковує безпеки від мережі Bitcoin",
                    "content": "Ark на Liquid не успадковує жодної безпеки від Bitcoin, оскільки Liquid є федеративним сайдчейном, незалежним від Bitcoin. Для отримання додаткової інформації відвідайте наш [Огляд ризиків Liquid](https://www.bitcoinlayers.org/layers/liquid)."
                },
                {
                    "title": "Протокол не дозволяє MEV на Bitcoin",
                    "content": "Ark на Liquid не вводить MEV до Bitcoin."
                },
                {
                    "title": "Альтернативний токен не потрібен для безпеки мережі",
                    "content": "Альтернативний токен не потрібен для безпеки мережі. VTXO випускаються ASP. Вони живуть поза блокчейном Liquid і забезпечуються L-BTC. L-BTC сам по собі є прив'язаним через федеративний мультипідпис до BTC."
                },
                {
                    "title": "Ark на Liquid не сприяє бюджету безпеки",
                    "content": "Ark на Liquid не сплачує жодних зборів майнерам Bitcoin."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Додаткові міркування",
            "content": [
                {
                    "title": "Наразі немає активних ASP на Ark на Liquid",
                    "content": "Наразі немає ASP, що підтримують Ark на Liquid. Це означає, що користувачі не можуть взаємодіяти з мережею, якщо не запустять свій власний ASP. Демонстраційний додаток був створений для Bitcoin++ для тестування та демонстраційних цілей, але підтримка наразі знята."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення коштів",
            "content": [
                {
                    "title": "Користувачі можуть односторонньо виводити свої кошти з оптимістичними гарантіями розрахунків",
                    "content": "У випадку [кооперативного виходу](https://arkdev.info/docs/learn/leaving#cooperative-exit) користувач обмінює свій VTXO на ончейн UTXO. Цей обмін здійснюється ASP за допомогою раундної транзакції. Кроки такі: ASP створює раундну транзакцію з додатковим виходом, заблокованим Алісою (вихід конектора). Потім користувач підписує транзакцію зазнання, яка витрачає з старого VTXO і додає вихід конектора з раніше створеної раундної транзакції. ASP потім транслює раундну транзакцію, надаючи користувачу новий UTXO. Протягом чотирьох тижнів користувач може подвоїти витрату свого VTXO. Спроба зробити це призведе до того, що ASP отримає можливість вимагати кошти користувачів протягом 24 годин, використовуючи транзакцію зазнання, підписану користувачем.\n\nУ випадку некооперативного виходу, через неактивний або зловмисний ASP, Ark VTXO може бути обміняно на UTXO в блокчейні Liquid, за умови, що ASP не змовляється з функціонерами Liquid. Односторонній вихід ініціюється користувачем через виявлення гілки спільного виходу, що блокує їх кошти. Це забезпечує самостійне зберігання коштів Ark щодо L-BTC, навіть якщо третя сторона бере участь у процесінгу транзакцій.\n\nЩоб обробити виведення з L-BTC назад до BTC, користувачі повинні або довірити функціонерам Liquid обробку своїх виведень, або здійснити обмін між BTC та L-BTC з третьою стороною."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "VTXO та їх передача",
                    "content": "Транзакції VTXO поза ланцюгом відбуваються через так звані \"Ark-раунди\", які здійснюються ASP. Раунд відбувається періодично, включаючи VTXO у спільний вихід у блокчейні Liquid як частину дерева ковенантів. Передача VTXO відбувається атомарно, додаючи так звані виходи конектора. Виходи конектора забезпечують, що ASP може вимагати старі VTXO користувачів лише якщо нові були створені ASP як частина нового спільного виходу. Важливо, що користувач може викупити ці чеки в блокчейні Liquid без взаємодії з ASP."
                },
                {
                    "title": "Оновлення VTXO з періодичними вимогами активності для користувача",
                    "content": "З введенням Ark-раундів користувач зобов'язаний оновлювати свої VTXO, відкриваючи свій Ark-гаманець до закінчення терміну дії спільного виходу (поточний стандартний період очікування встановлений на чотири тижні, але це специфічно для ASP). Якщо цього не зробити, ASP зможе забрати кошти користувачів. Ці [кошти потім будуть утримуватися кастодіально оператором](https://x.com/brqgoo/status/1806875774265241781) і можуть бути повернені користувачу для повторного утримання у некостодіальному вигляді, якщо оператор обробить їхній запит. Щоб зменшити це, пропонується рішення, подібне до вежі спостереження, де користувач може делегувати оновлення VTXO."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Випадки використання",
            "content": [
                {
                    "title": "Покращений UX для самостійного зберігання для кінцевих користувачів",
                    "content": "Ark слугуватиме як доповнюючий протокол до Lightning Network. Використання коштів у самостійному зберіганні в LN залишається викликом для не технічних кінцевих користувачів, перш за все через проблеми з вхідною ліквідністю. Ark як самостійна опція може обійти ці проблеми, оскільки вимоги до ліквідності перекладаються на ASP.\n\nКрім того, Ark може бути запущений як доповнююча служба обмінниками або брокерами для полегшення самостійного зберігання коштів користувачів. У випадку, якщо користувач не оновить кошти, вони повертаються до традиційної кастодіальної моделі, яку забезпечують обмінники."
                },
                {
                    "title": "Масштабування L-BTC для кінцевих користувачів",
                    "content": "Модель спільного виходу Ark слугує як метод масштабування, оскільки UTXO діляться між багатьма користувачами, потенційно до десятків або сотень тисяч користувачів. Ark функціонуватиме як доповнюючий протокол до Lightning. Поки Lightning масштабується вертикально, [Ark масштабується горизонтально](https://x.com/tierotiero/status/1798301214905606227). Іншими словами, Ark можна вважати [платформою для клірінгу](https://x.com/RyanTheGentry/status/1663322538443698177) (яка полегшує транзакції між двома сутностями в рамках одного ASP), Lightning служитиме як шар розрахунків (транзакції між двома ASP), тоді як Liquid слугує остаточним судом, підтверджуючи спільний вихід у блоці."
                },
                {
                    "title": "Офлайн-платежі",
                    "content": "Протокол Ark на Liquid забезпечує (самостійні) офлайн-транзакції, використовуючи ковенанти, зокрема [опкодів інтроспекції](https://glossary.blockstream.com/introspection-opcodes/). Це є значним покращенням порівняно з поточним станом асинхронних платежів у LN."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Джерельний код",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Код є відкритим на [GitHub](https://github.com/ark-network/ark), доступний під ліцензією MIT."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Ark Developer Hub](https://arkdev.info)\n[Найпростішим поясненням Ark](https://gist.github.com/RubenSomsen/a394beb1dea9e47e981216768e007454?permalink_comment_id=4633382#simplest-ark-explanation)\n[Оновлення щодо Ark з Tiero](https://stephanlivera.com/episode/584/)"
                }
            ]
        }
    ]
}
