{
    "slug": "bitlayer",
    "title": "Bitlayer",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Medium", "Unverified", "High"],
    "purpose": "General",
    "btcBridge": "Federated Multisig",
    "settlement": "Offchain",
    "btcLocked": 5397,
    "executionEnv": "Offchain",
    "consensus": "Federated Sidechain",
    "nativeToken": "BTR",
    "feeToken": "WBTC",
    "enshrinedBtc": "-",
    "bitcoinOnly": false,
    "links": [
        "https://www.bitlayer.org/",
        "https://www.bitlayer.org/",
        "https://docs.bitlayer.org/docs/Learn/Introduction",
        "https://www.btrscan.com/home",
        "https://github.com/bitlayer-org",
        "https://twitter.com/BitlayerLabs"
    ],
    "description": "Головна мережа Bitlayer v1 є федеративним сайдчейном. Вона підтримує середовище виконання EVM з планами підтримки інших віртуальних машин.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "Unverified",
            "title": "Користувачі довіряють федеративному набору підписувачів для зберігання своїх BTC. Підписувачі на розгляді",
            "content": "Поточний BTC міст Bitlayer є федеративним двостороннім пегом з інституційними підписувачами. Bitlayer працює з кількома платформами кастодіального зберігання.\n\nКористувачі не зберігають біткоїн-активи, що підкріплюють токени на BitLayer.\n\n🔬Ми наразі переглядаємо підписувачів для двостороннього пегу BitLayer."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Дані зберігаються поза ланцюгом з відкритим програмним забезпеченням вузлів",
            "content": "Bitlayer наразі не використовує Bitcoin для доступності даних. Вимоги до доступності даних наразі виконуються повними вузлами Bitlayer. Програмне забезпечення вузлів Bitlayer є відкритим, і кожен може запустити вузол і перевірити стан Bitlayer."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Unverified",
            "title": "Bitlayer керується дозволеним набором валідаторів",
            "content": "Блоки Bitlayer наразі виробляються дозволеним набором валідаторів. У Bitlayer бере участь 21 валідатор. Користувачі не можуть обійти цей набір операторів, якщо вони піддаються цензурі валідатором.\n\n🔬Ми наразі переглядаємо, хто керує валідаторами BitLayer."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "High",
            "title": "Валідатори BitLayer завершують блоки",
            "content": "На Bitcoin немає примусового виконання станів Bitlayer. Стану Bitlayer завершаються дозволеним набором валідаторів. Валідатори підписують запропоновані блоки і завершують їх у ланцюзі."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Bitlayer наразі не отримує жодної безпеки від учасників консенсусу Bitcoin",
                    "content": "Bitlayer є федеративним сайдчейном, і учасники консенсусу Bitcoin не беруть участі у забезпеченні безпеки Bitlayer."
                },
                {
                    "title": "Токен BTR випущено, але валідатори не зобов'язані ставити BTR",
                    "content": "Ніхто з валідаторів у наборі валідаторів Bitlayer не ставить свій токен BTR. Наразі постачання BTR становить 1 мільярд і розподілене між 6 адресами. Невідомо, чи буде Bitlayer використовувати цей токен для стимулювання свого поточного набору валідаторів або інших майбутніх операторів."
                },
                {
                    "title": "Немає MEV, що вводиться в Bitcoin",
                    "content": "Bitlayer, через відсутність поточного зв'язку з Bitcoin, не вводить MEV у блокчейн Bitcoin. Користувачі довіряють, що дозволений набір валідаторів Bitlayer не буде витягувати MEV."
                },
                {
                    "title": "Bitlayer не вносить внесок у бюджет безпеки",
                    "content": "Bitlayer наразі не вносить внесок у бюджет безпеки Bitcoin."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення коштів",
            "content": [
                {
                    "title": "Користувачі не можуть односторонньо виводити свої кошти з сайдчейну Bitlayer",
                    "content": "Користувачі основної програми мосту Bitlayer або третіх сторін не можуть односторонньо виводити свої активи з Bitlayer. Вони довіряють, що валідатори Bitlayer включать транзакції на зняття у блоки Bitlayer, і що підписувачі мультипідпису оброблять їх виведення назад до основного ланцюга Bitcoin."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технологія",
            "content": [
                {
                    "title": "Учасники мосту",
                    "content": "Coinbase і Sinohope — це дві установи, про які повідомлялося, що вони беруть участь у забезпеченні офіційного мосту BitLayer. Обмежена інформація щодо поточної конструкції двостороннього пегу доступна."
                },
                {
                    "title": "Дослідження BitVM",
                    "content": "Команда Bitlayer має відкритий репозиторій досліджень, пов'язаних з BitVM. Вони прагнуть побудувати міст з мінімізацією довіри між Bitlayer і Bitcoin. Документаційний сайт Bitlayer вказує, що реалізація BitVM буде федеративною."
                },
                {
                    "title": "Дослідження альтернативної доступності даних",
                    "content": "Згідно з документацією Bitlayer, команда планує використовувати альтернативне рішення для доступності даних. Користувачі довірять механізму консенсусу, що стоїть за цим рішенням, а не повним вузлам Bitcoin для доступності даних."
                },
                {
                    "title": "Дослідження дружнього до Bitcoin FRI",
                    "content": "Швидкий взаємодіючий орієнтир Ріда-Соломона (FRI) є криптографічною системою доказів. Найбільш помітно, що FRI використовується для побудови STARK. Bitlayer досліджує верифікацію FRI та вважає своє рішення 'дружнім до Bitcoin' — оскільки воно не потребує OP_CAT або будь-яких інструментів, які не існують на Bitcoin сьогодні. Система Bitlayer використовує Taptrees для необхідних Меркле-комітментів у схемі доказів і BitCommitments у стилі BitVM для поширення стану. Bitlayer ще не опублікував відкритий код або документацію для цієї системи верифікації FRI."
                },
                {
                    "title": "Дослідження OP-DLC",
                    "content": "Контракт на дискретний лог (DLC) є системою виконання контрактів, що дозволяє двом сторонам здійснювати умовні платежі, посередництвом орієнтира. У моделі OP-DLC, яку розробляє Bitlayer, орієнтир налаштований як федерація з умовами 'сечення' на вимагану заставу. Bitlayer ще не опублікував відкритий код або документацію для цієї системи виконання контрактів OP-DLC."
                },
                {
                    "title": "Ефірна віртуальна машина",
                    "content": "Bitlayer використовує сумісну з EVM віртуальну машину. Ефірна віртуальна машина — це програмне забезпечення, відповідальне за виконання смарт-контрактів для кількох блокчейнів, зокрема мережі Ethereum. Вона використовує Solidity/Vyper як код і є домінуючим середовищем для виконання смарт-контрактів у криптовалютній екосистемі. Bitlayer є сумісною з EVM, що означає, що розробник з Ethereum матиме менше труднощів з розгортанням своїх додатків на Bitlayer у порівнянні з іншими середовищами виконання."
                },
                {
                    "title": "Швидші часи блокування",
                    "content": "Bitlayer наразі виробляє блоки кожні дві секунди, що забезпечує кращий досвід для користувачів, ніж використання основної мережі Bitcoin."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Варіанти використання",
            "content": [
                {
                    "title": "Додатки на основі EVM",
                    "content": "Потенційні варіанти використання Bitlayer схожі на інші сайдчейни на основі EVM. Розробники можуть розгортати смарт-контракти, які дозволяють такі додатки, як протоколи запозичення та кредитування, стейблкоїни, NFT та інше. Основний запропонований варіант використання для Bitlayer полягає в тому, щоб діяти як рівень додатків для Bitcoin."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Bitlayer керується дозволеним набором валідаторів",
                    "content": "Bitlayer наразі керується 21 федеративним валідатором, які забезпечують мережу. Оператори цих валідаторів невідомі. Хоча є заяви про те, що ці валідатори ставитимуть рідний токен Bitlayer, BTR, для забезпечення мережі, жодна з активних адрес валідаторів наразі не володіє жодними токенами BTR. Ці вузли, ймовірно, відповідають за доступність даних, виробництво блоків і завершення стану сайдчейну."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Частини коду є відкритими",
                    "content": "Деякі частини коду, пов'язаного з проектом Bitlayer, є відкритими."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Блокчейн-експлорер Bitlayer](https://www.btrscan.com/home)\n[Набір валідаторів Bitlayer](https://www.btrscan.com/leaderboard)"
                }
            ]
        }
    ]
}
