{
    "slug": "bob",
    "title": "BOB",
    "layerType": "Ethereum Rollup",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Medium", "Medium", "Medium"],
    "purpose": "Bitcoin Apps",
    "btcBridge": "Various Multisig(s)",
    "settlement": "Offchain",
    "btcLocked": 974,
    "executionEnv": "Under Development",
    "consensus": "Centralized Sequencer",
    "nativeToken": "ETH",
    "feeToken": "ETH",
    "enshrinedBtc": "None",
    "bitcoinOnly": false,
    "links": [
        "https://www.gobob.xyz/",
        "https://www.gobob.xyz/",
        "https://docs.gobob.xyz/",
        "https://twitter.com/build_on_bob",
        "https://github.com/bob-collective/bob",
        "https://twitter.com/build_on_bob"
    ],
    "description": "BOB — це оптимістичний роллап, що слугує як прикладний шар для Bitcoin. Він був запущений як роллап на базі Ethereum, з планами отримати більше безпеки від майнерів Bitcoin і повних вузлів з часом. Його відношення до Bitcoin наразі подібне до бічної ланцюга, оскільки це альтернативний консенсусний протокол з двостороннім зв'язком між ним і основним ланцюгом Bitcoin.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "Critical",
            "title": "Користувачі Bitcoin довіряють операторам різних мультипідписів для зберігання своїх BTC",
            "content": "BOB переважно використовує два BTC синтетики на своїй ланцюгу: tBTC і wBTC. Обидва є токенами ERC-20 на Ethereum. Двосторонній зв'язок tBTC на BOB керується ⅗ мультипідписом, але його можна оновити, щоб дозволити управлінню Threshold керувати карбуванням і знищенням tBTC на BOB. Управління Threshold покладається на окремий токен і механізм консенсусу. wBTC фактично управляється централізованим кастодієм, BitGo. Наразі обидва ці токени карбуються на BOB через його рідний Ethereum міст.\n\nКористувачі довіряють, що оператори мосту не вкрадуть їх BTC, що пропонент BOB не опублікує шкідливу, неперевірену трансакцію або що проксі-адміністратор BOB не створить шкідливе оновлення смарт-контракту.\n\nУ разі шкідливого оновлення смарт-контракту немає вікна виходу для користувачів BOB."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Дані зберігаються та доступні через повні вузли Ethereum",
            "content": "Дані про стан BOB зберігаються на блокчейні Ethereum. Будь-хто може запустити вузол Ethereum і перевірити стан BOB."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Medium",
            "title": "Блоки BOB створюються та пропонуються централізованим оператором, але можлива примусова включеність до Ethereum L1",
            "content": "Наразі секвенсер BOB керується однією сутністю. Секвенсер BOB може цензурувати транзакції і також викликати збої в життєздатності в роллапі, якщо він вийде з ладу. Однак користувачі можуть обійти секвенсер і надіслати свої транзакції безпосередньо до контракту Ethereum L1. Користувачі, однак, довіряють, що дозволений пропонент опублікує останній корінь стану на Ethereum L1, дозволяючи виведення."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Medium",
            "title": "Стан BOB переходить в остаточність на Ethereum",
            "content": "BOB успадковує гарантії остаточності від Ethereum. Секвенсер BOB надає м'яке підтвердження транзакцій, які в кінцевому підсумку підсумовуються та надсилаються на Ethereum.\n\nСеквенсер BOB може провести реорганізацію перед прийняттям партії транзакцій на Ethereum."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "BOB не успадковує жодної безпеки від учасників консенсусу Bitcoin. Optimine в розробці",
                    "content": "BOB наразі розробляє Optimine: механізм, що дозволить майнерам Bitcoin об'єднувати видобуток з секвенсером BOB. У цьому дизайні секвенсер BOB створюватиме блоки роллапу, а майнери перевірятимуть, що блоки створені правильно. Майнери потім надаватимуть блокам «Proof-of-Work» валідацію, щоб їх можна було виконати. Ця валідація Proof-of-Work займе кілька хвилин, тому вона також може слугувати як м'який механізм остаточності, оскільки ланцюги OP Stack зазвичай потребують 7 днів для завершення періоду оскарження."
                },
                {
                    "title": "Токен ETH використовується для сплати комісій",
                    "content": "Користувачі BOB сплачують комісії секвенсера в ETH. Оператори BOB також сплачують комісії DA в ETH. Однак користувачі можуть вибрати сплату комісій іншим токеном (наприклад, tBTC) постачальнику послуг, який сплатить комісії секвенсера в ETH від імені користувачів."
                },
                {
                    "title": "Немає MEV, впровадженого в Bitcoin",
                    "content": "BOB не впроваджує жодного MEV на Bitcoin L1. Користувачі довіряють секвенсеру BOB, що той не перепорядкує їхні транзакції для отримання MEV."
                },
                {
                    "title": "BOB не вносить внесок до бюджету безпеки",
                    "content": "BOB наразі не вносить внесок до бюджету безпеки Bitcoin."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Роль пропонента централізована та дозволена. Користувачі BTC повинні виводити на Ethereum L1 перед виведенням до Bitcoin",
                    "content": "Користувачі можуть обійти секвенсер і подати запити на виведення безпосередньо на Ethereum L1. Проте вони не можуть змусити виведення, оскільки самопропозиція не увімкнена на ланцюгах OP Stack. Користувачі покладаються на пропонента, щоб він публікував оновлені корені стану на Ethereum для забезпечення обробки виведень. Виведення з BOB на Ethereum займає 7 днів для остаточного завершення.\n\nПісля того, як користувачі потраплять на Ethereum L1, вони можуть обміняти свої BTC на Bitcoin через механізм двостороннього зв'язку, підтримуваний їхнім BTC синтетиком.\n\nКористувачі в основному довіряють операторам мосту, щоб дозволити виведення назад на основний ланцюг Bitcoin."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технологія",
            "content": [
                {
                    "title": "Докази шахрайства в розробці",
                    "content": "Ланцюги OP Stack використовуватимуть інтерактивні докази шахрайства для забезпечення коректності стану. Ця функція наразі в розробці, що означає, що BOB наразі дозволяє недійсні корені стану."
                },
                {
                    "title": "Легкий клієнт Bitcoin",
                    "content": "Легкий клієнт Bitcoin BOB перевіряє минулі транзакції на основному ланцюгу Bitcoin, а також дозволяє смарт-контракту на BOB перевіряти заголовки блоків Bitcoin. Це дає BOB можливість бачити стан Bitcoin, і буде корисним для майбутніх програм мостів."
                },
                {
                    "title": "Віртуальна машина Ethereum",
                    "content": "BOB використовує віртуальну машину, сумісну з EVM. Віртуальна машина Ethereum — це програмне забезпечення, відповідальне за виконання смарт-контрактів для ряду блокчейнів, зокрема мережі Ethereum. Вона використовує Solidity/Vyper як свій код і є домінуючим середовищем для виконання смарт-контрактів в екосистемі криптовалют. BOB сумісний з EVM, що означає, що розробнику з Ethereum буде легше розгортати свої додатки на BOB порівняно з іншими середовищами виконання."
                },
                {
                    "title": "Швидші часи блоків",
                    "content": "BOB наразі виробляє блоки кожні дві секунди, що забезпечує кращий досвід для користувачів, ніж використання основних ланцюгів Bitcoin або Ethereum."
                },
                {
                    "title": "Досліджується міст BitVM",
                    "content": "BOB активно досліджує BitVM і як він може підтримати покращену програму мосту для активів Bitcoin на ланцюзі."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Випадки використання",
            "content": [
                {
                    "title": "Ончейн додатки",
                    "content": "Первісний випадок використання BOB полягає в наданні користувачам Ethereum доступу до Bitcoin додатків, таких як ординали, BRC-20, стейблкоїни, забезпечені Bitcoin, та інші. Він також дає користувачам Bitcoin доступ до прикладного шару, що забезпечує швидші часи підтвердження, нижчі комісії та кращий досвід користувачів (хоча з додатковими припущеннями довіри). Для цього BOB підтримує BOB SDK, набір інструментів для розробників, що дозволяє створювати додатки, орієнтовані на Bitcoin, на BOB."
                },
                {
                    "title": "Абстракція облікового запису",
                    "content": "BOB підтримуватиме ряд функцій Bitcoin UX через абстракцію облікового запису. Ці функції дозволять користувачам отримувати доступ до BOB через гаманці Bitcoin, сплачувати комісії у своїх улюблених токенах та карбувати BTC безпосередньо на BOB."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "BOB має централізованого оператора",
                    "content": "Виробництво блоків контролюється одним оператором. Користувачі довіряють, що оператор буде чесним. Вони також довіряють, що оператор не буде перепорядковувати транзакції для отримання MEV."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Джерельний код",
            "content": [
                {
                    "title": "На перегляді",
                    "content": "Ми переглядаємо, чи є програмне забезпечення вузлів BOB відкритим вихідним кодом."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Цей документ описує привілейовані ролі, які беруть участь в управлінні різними компонентами ланцюга BOB](https://docs.gobob.xyz/docs/learn/security/privileged-roles)\n[Огляд ризиків ланцюга OP Mainnet на Ethereum, який має подібні припущення довіри, як і ланцюг BOB, оскільки BOB побудований на OP Stack](https://l2beat.com/scaling/projects/optimism)\n[Блог, що охоплює області НДР, пов'язані з безпекою Bitcoin на BOB.](https://mirror.xyz/0xE4dF449bDC1ec8f7688F68F7E839f1370617Ac73/UvQH9D3RyVcozOlz091gLKnbX8aqn8goFVYtHVmin-w)\n[Розподіл TVL BOB, включаючи загальну кількість BTC, заблокованих на ньому.](https://l2beat.com/scaling/projects/bob/tvl-breakdown)"
                }
            ]
        }
    ]
}
