{
    "slug": "bouncebit",
    "title": "BounceBit",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Unverified", "Unverified", "Unverified"],
    "purpose": "BTC Applications",
    "btcBridge": "Third Party Bridge",
    "settlement": "Offchain",
    "btcLocked": 3901,
    "executionEnv": "Offchain",
    "consensus": "Delegated Proof-of-Stake",
    "nativeToken": "BB",
    "feeToken": "BB",
    "enshrinedBtc": "BBTC",
    "bitcoinOnly": false,
    "links": [
        "https://bouncebit.io/",
        "https://bouncebit.io/",
        "https://docs.bouncebit.io/",
        "https://bbscan.io/",
        "https://github.com/BounceBit-Labs",
        "https://x.com/bounce_bit"
    ],
    "description": "BounceBit — це бічний ланцюг для біткоїна. Він використовує механізм консенсусу делегованого proof-of-stake та токени BB і BBTC (синтетичний BTC на BounceBit) для стейкінгу. Він сумісний з EVM і може підтримувати екосистему ончейн-додатків.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "Unverified",
            "title": "Міст керується третьою стороною",
            "content": "Офіційний біткоїн-міст BounceBit, ймовірно, управляється мережею Polyhedra. Двосторонній зв'язок в даний час є протоколом MPC, де обране число підписантів відповідає за забезпечення мосту та зберігання BTC користувачів.\n\n🛑 Ми наразі не можемо перевірити інформацію, пов'язану з двостороннім зв'язком BounceBit. Polyhedra не розкрила жодної інформації щодо його роботи."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Unverified",
            "title": "Набір валідаторів з дозволами, що бере участь у механізмі делегованого proof-of-stake, задовольняє вимоги до доступності даних",
            "content": "Наразі набір валідаторів BounceBit відповідає за збереження запису останнього стану мережі. В даний час є 25 активних валідаторів.\n\nРеалізація вузлів головної мережі не є відкритим кодом, тому користувачі не можуть запускати вузли BounceBit і підтримувати запис його стану."
        },
        {
            "category": "Liveness & Reorg Resistance",
            "score": 0,
            "tier": "Unverified",
            "title": "Мережа управляється дозволеним набором операторів, що беруть участь у механізмі делегованого proof-of-stake",
            "content": "Блоки BounceBit наразі підписуються та пропонуються 25 валідаторами, що беруть участь у мережі proof-of-stake. Ці оператори наразі мають дозволи.\n\nОператори ставлять токени BB для участі в мережі. Користувачі можуть делегувати BBTC (упакований біткоїн) та токени BB валідаторам, щоб збільшити їхню голосуючу силу, що підвищує шанси на виграш блоків."
        },
        {
            "category": "State Validation",
            "score": 0,
            "tier": "Unverified",
            "title": "Гарантії розрахунків надаються консенсусом BounceBit",
            "content": "Гарантії розрахунків надаються набором валідаторів BounceBit, а не Bitcoin. Понад 2/3 голосуючої сили валідаторів BounceBit необхідно для підписання запропонованого блоку, щоб завершити його в ончейні.\n\nBounceBit має односекундну фіналізацію, що означає, що блоки не можуть бути перепідключені, як тільки вони стають частиною канонічного блокчейну.\n\nBitcoin не може перевірити переходи стану BounceBit. Оператори мосту можуть обробляти шахрайські виведення та красти кошти користувачів."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Економічна безпека BounceBit може залежати від упакованих BTC активів",
                    "content": "Через свою архітектуру стейкінгу з двома токенами BounceBit може покладатися на упаковані форми BTC для економічної безпеки. Це залежність зростає з кількістю BTC, які ставляться для забезпечення мережі."
                },
                {
                    "title": "BounceBit не витікає MEV до Bitcoin",
                    "content": "BounceBit не витікає MEV до основного ланцюга Bitcoin. Користувачі довіряють валідаторам BounceBit, що вони не перебудовують їхні транзакції для витягування MEV."
                },
                {
                    "title": "Необхідний альтернативний токен для безпеки мережі",
                    "content": "BB є одним з токенів, необхідних для стейкінгу та використовується для виплати винагород валідаторам."
                },
                {
                    "title": "Внески та виведення мосту сплачують збори шахтарям",
                    "content": "Комісії за транзакції сплачуються шахтарям Bitcoin, коли користувачі вносять та виводять кошти з мосту BounceBit. Нагороди за блоки на BounceBit розподіляються валідаторам BounceBit."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Програмне забезпечення вузлів головної мережі не є відкритим кодом",
            "content": [
                {
                    "title": "📝 Проект наразі перебуває на етапі перевірки",
                    "content": "Програмне забезпечення вузлів головної мережі не є відкритим кодом. Користувачі довіряють інформації в панелях, наданих BounceBit, оскільки вони не можуть запустити вузол і перевірити поточний стан мережі та її учасників."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Користувачі довіряють третьосторонньому постачальнику мосту для обробки виведень",
                    "content": "Виведення в кінцевому підсумку обробляються учасниками протоколу MPC, що управляється мережею Polyhedra. Користувачі довіряють, що валідатори BounceBit включать їхню транзакцію на виведення в блок, а оператори мережі Polyhedra оброблять їхнє виведення та випустять кошти в основному ланцюзі Bitcoin."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технологія",
            "content": [
                {
                    "title": "Evmos & CometBFT",
                    "content": "L1 блокчейн BounceBit є форком Evmos, сумісного з EVM ланцюга, побудованого за допомогою Cosmos SDK. Cosmos SDK побудовано на CometBFT, протоколі консенсусу, що забезпечує високу пропускну здатність та швидку фіналізацію (~2-секундні блоки).\n\nЦя архітектура дозволяє користувачам обробляти переходи як в форматах Cosmos, так і EVM, а також забезпечує сумісність BounceBit з різними модулями Cosmos SDK. Крім того, ланцюги, побудовані з CometBFT, сумісні зі стандартом IBC, який широко використовується в екосистемі Cosmos."
                },
                {
                    "title": "Сумісність з EVM",
                    "content": "Оскільки BounceBit заснований на архітектурі Evmos, розробники можуть розгортати EMV-сумісні додатки на BounceBit. BounceBit може використовувати бібліотеки, підтримувані EVM, та переносити додатки на основі EVM на BounceBit."
                },
                {
                    "title": "Делегований Proof-of-Stake",
                    "content": "Консенсус BounceBit покладається на модель делегованого proof-of-stake (DPoS). Тримачі токенів делегують свої токени BB та BBTC своїм улюбленим валідаторам. Валідатори з найбільшими сумами делегованих та стейкованих токенів мають вищу ймовірність виграшу права на пропозицію блоків.\n\nПроцес делегування передбачає передачу токена валідатору BounceBit і отримання синтетичного токена, що представляє їх делеговані токени. Валідатори BounceBit можуть визначати, скільки винагород вони розподіляють тим, хто делегував їм токени, і зацікавлені у розподілі справедливої кількості, щоб користувачі постійно делегували свої токени."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Випадки використання",
            "content": [
                {
                    "title": "Ончейн-додатки",
                    "content": "Оскільки BounceBit сумісний з EMV, він може підтримувати ряд ончейн-додатків. Це може включати протоколи кредитування та позичання, децентралізовані біржі та ринок NFT."
                },
                {
                    "title": "Інституційні фінанси",
                    "content": "BounceBit інтегрований з інституційними фінансовими додатками, надаючи користувачам можливість вносити свої кошти у кастодіана, щоб кастодіан міг використовувати їхні токени в інвестиційних стратегіях від їхнього імені.\n\n⚠️ Якщо ви вносите кошти у кастодіана, ви довіряєте цьому кастодіану не красти або неправильно використовувати ваші кошти."
                },
                {
                    "title": "BTC Стейкінг",
                    "content": "BounceBit дозволяє тримачам BTC делегувати свої BTC у рамках DPoS в BounceBit і делегувати цей стейк конкретному валідатору в мережі BounceBit.\n\nВ обмін на делегування своїх BTC користувачі можуть отримувати винагороди у вигляді токенів BB."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "BounceBit наразі управляється закритим набором валідаторів",
                    "content": "Оператори ланцюга BounceBit є федеративним набором операторів. Перспективні валідатори можуть спробувати приєднатися до набору операторів після того, як реалізація вузлів головної мережі стане відкритим кодом."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код не є відкритим",
                    "content": "Реалізація вузлів головної мережі BounceBit наразі не є відкритим кодом."
                }
            ]
        }
    ]
}
