{
    "slug": "bsquared",
    "title": "Bsquared Network",
    "layerType": "Sidechain Rollup",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Unverified", "Critical", "Critical"],
    "purpose": "General",
    "btcBridge": "Federated Multi-sig",
    "settlement": "Offchain",
    "btcLocked": "Under review",
    "executionEnv": "Offchain",
    "consensus": "Federateded Sidechain",
    "nativeToken": "BSQ",
    "feeToken": "WBTC",
    "enshrinedBtc": "WBTC",
    "bitcoinOnly": false,
    "links": [
        "https://www.bsquared.network/",
        "https://www.bsquared.network/",
        "https://docs.bsquared.network/",
        "https://explorer.bsquared.network/",
        "https://github.com/b2network",
        "https://twitter.com/BSquaredNetwork"
    ],
    "description": "Основна мережа Bsquared Network складається з двох різних ланцюгів. Батьківський ланцюг є форком EVM-реалізації на Tendermint і має три дозволені валідатори, які керують мережею. Ланцюг ролапу є форком Polygon zkEVM, який здійснює розрахунки на батьківському ланцюзі Bsquared.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "Unverified",
            "title": "Користувачі вносять кошти в MPC-протокол, керований Bsquared Network і кастодіаном. Підписанти на розгляді.",
            "content": "Попередні блоги зазначали, що коли користувачі вносять кошти в Bsquared, вони вносять кошти в MPC-гаманець, керований командою Bsquared Network та Cobo, інституційним кастодіаном. Інформація про те, скільки підписантів бере участь у цій схемі MPC, наразі недоступна. Bsquared заявив, що в цю схему зберігання будуть додані нові учасники.\n\n🔬Ми наразі переглядаємо підписантів для двостороннього моста Bsquared."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Critical",
            "title": "Вимога DA виконується трьома дозволеними валідаторами",
            "content": "Пакети послідовника публікуються на L1 мережі Bsquared. Ця мережа складається з дозволеного набору валідаторів, відповідальних за забезпечення доступності даних.\n\n🔬Ми наразі переглядаємо операторів, які задовольняють вимогу DA Bsquared."
        },
        {
            "category": "Network Operator",
            "score": 0,
            "tier": "Critical",
            "title": "Як ланцюг ролапу, так і батьківський ланцюг управляються федеративними, централізованими сторонами",
            "content": "Імплементація Polygon zkEVM в Bsquared Network має єдиного послідовника, який публікує пакети послідовника на своїй мережі з трьома валідаторами L1. У разі цензури користувачі не можуть змусити включити свою транзакцію в послідовність."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Critical",
            "title": "SNARK забезпечує правильність стану, але фіналізація гарантується дозволеним набором валідаторів",
            "content": "Bsquared не отримує жодних гарантій розрахунків від Bitcoin. Фіналізація розрахунків Bsquared здійснюється групою з трьох федеративних валідаторів, які перевіряють дійсність доказу, поданого провайдером zkEVM мережі Bsquared."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Односторонні виходи неможливі",
                    "content": "Користувачі не можуть односторонньо вийти з Bsquared Network. Користувачі довіряють централізованій програмі мосту з управлінням своїм Bitcoin."
                },
                {
                    "title": "Протокол не дозволяє MEV на Bitcoin. Користувачі довіряють централізованому оператору, щоб той не змінював порядок їх транзакцій.",
                    "content": "Оскільки Bsquared не має стосунків з майнерами Bitcoin, він не вводить MEV на основному шарі Bitcoin. Користувачі довіряють, що послідовник zkEVM мережі Bsquared не змінить порядок транзакцій для отримання MEV."
                },
                {
                    "title": "Альтернативний токен існує, але не використовується для безпеки мережі",
                    "content": "Bsquared Network випустив токен зTicker BSQ на своєму L1-протоколі. Його запас складає 210 000 000. Одна адреса володіє більшістю цього запасу. Валідатори L1 мережі Bsquared наразі не ставлять цей токен."
                },
                {
                    "title": "Bsquared Network не сприяє бюджету безпеки",
                    "content": "Поточна основна мережа Bsquared Network не сплачує жодних зборів майнерам Bitcoin."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення коштів",
            "content": [
                {
                    "title": "Користувачі можуть вивести кошти, якщо це дозволено централізованими операторами",
                    "content": "Користувачі можуть вивести свої кошти з Bsquared Network назад до Bitcoin через двох централізованих постачальників мостів. Інформація про підписантів цих мостів недоступна."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Наразі тестуються подальші інтеграції з Bitcoin",
                    "content": "Bsquared Network наразі тестує OP Stack ролап на тестнеті Ethereum Sepolia. У цій реалізації вони запускають свій «коммітер», який дозволяє OP Stack ролапу публікувати останній корінь стану ролапу в Bitcoin."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Використання",
            "content": [
                {
                    "title": "EVM-орієнтовані програми",
                    "content": "Потенційні випадки використання Bsquared Network подібні до інших EVM-орієнтованих сайдчейнів. Розробники можуть розгортати смарт-контракти, які дозволяють такі програми, як протоколи позики та кредитування, стейблкоїни, NFT та інше. Основний, запропонований випадок використання для Bsquared Network - це діяти як прикладний шар для Bitcoin."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Bsquared Network управляється централізованими сторонами",
                    "content": "Користувачі мають транзакції, упорядковані централізованим послідовником ролапу."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код програмного забезпечення вузлів є відкритим",
                    "content": "Програмне забезпечення вузлів та контракти Polygon zkEVM є відкритими. На нашу думку, ці реалізації Polygon zkEVM та Ethermint наразі не були перевірені."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Експлорер L1 Bsquared Network](https://hub-explorer.bsquared.network)\n[Github Bsquared Network](https://github.com/b2network)"
                }
            ]
        }
    ]
}
