{
    "slug": "core",
    "title": "Core",
    "layerType": "Сайдчейн",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "ні",
    "riskFactors": ["Непідтверджений", "Середній", "Середній", "Середній"],
    "purpose": "Загальний",
    "btcBridge": "Федеративний мультипідпис",
    "settlement": "Позамережевий",
    "btcLocked": 6705,
    "executionEnv": "Позамережевий",
    "consensus": "Гібридний консенсус",
    "nativeToken": "CORE",
    "feeToken": "CORE",
    "enshrinedBtc": "coreBTC",
    "bitcoinOnly": false,
    "links": [
        "https://coredao.org/",
        "https://www.stacks.co/explore/discover-apps",
        "https://docs.coredao.org/developer/introduction/quick-links",
        "https://scan.coredao.org/",
        "https://github.com/coredao-org",
        "https://twitter.com/Coredao_Org"
    ],
    "description": "Core (в контексті Bitcoin) — це EVM сайдчейн з гібридним механізмом консенсусу, Satoshi Plus, який використовує як DPoW, так і DPoS. Він використовує федеративний мультипідпис для зв'язку BTC з кількома сторонами, що забезпечують чесність двостороннього зв'язку. Нативним токеном мережі є CORE, який використовується для комісій за транзакції, стекингу та управління в Core DAO.",
    "riskAnalysis": [
        {
            "category": "Безпека моста",
            "score": 0,
            "tier": "Непідтверджений",
            "title": "Фонди зберігаються федеративним набором підписувачів, кілька сторін забезпечують чесність моста",
            "content": "Користувачі довіряють різним сторонам у підтримці чесності мосту Core з Bitcoin. Локери відповідають за безпеку біткоїнів, які забезпечують coreBTC на Core Chain. Ці учасники ставлять заставу у вигляді токенів Core, щоб взяти участь як Локер. У разі зловмисного переміщення біткоїнів з мультипідпису або неможливості виконати виведення, Локери будуть оштрафовані та втратять заставу.\n\nІнші учасники мосту відповідають за моніторинг активності Локерів та ініціювання процесу штрафування."
        },
        {
            "category": "Доступність даних",
            "score": 0,
            "tier": "Середній",
            "title": "Вимога щодо доступності даних виконана повними вузлами мережі Core",
            "content": "Вимога щодо доступності даних мережі Core виконується її власною мережею повних вузлів. Будь-хто з достатніми обчислювальними ресурсами може запустити повний вузол Core."
        },
        {
            "category": "Оператор мережі",
            "score": 0,
            "tier": "Середній",
            "title": "Гібридний механізм консенсусу Core керує мережею",
            "content": "На мережі Core Chain є група валідаторів, які беруть участь як виробники блоків. Щодня 23 валідатори з найвищим гібридним балом (з DPOW та DPOS) обираються для участі у виробництві блоків. Будь-який повний вузол мережі Core може зареєструватися, щоб стати частиною цього набору. Core Chain не підтримує виходи, які обходять його набір валідаторів, що означає, що користувачі повинні довіряти валідаторам мережі Core для пропозиції та фіналізації блоків.\n\nІснує мінімальна застава для роботи вузла валідатора мережі Core."
        },
        {
            "category": "Гарантії фіналізації",
            "score": 0,
            "tier": "Середній",
            "title": "Фіналізація транзакцій забезпечується консенсусом мережі Core і не має жодних запевнень, успадкованих від Bitcoin",
            "content": "Перехід станів фіналізується механізмом консенсусу мережі Core. Усі ролі в цьому механізмі є мінімально дозволеними."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Core непрямо успадковує безпеку від учасників консенсусу Bitcoin",
                    "content": "Як частина свого гібридного механізму консенсусу, біткоїн-майнери можуть делегувати хешрейт валідаторам Core для покращення їх загальної voting power."
                },
                {
                    "title": "Core Chain вимагає ще один токен для функціонування",
                    "content": "Токен CORE необхідний для оплати комісій за транзакції та виконання смарт-контрактів на Core Chain. Він також використовується для стекингу та управління. Токен безпосередньо потрібен для безпеки мережі, оскільки ставлення його є одним з двох змінних, що використовуються для створення зваженого балу для вибору валідаторів та вибору лідера."
                },
                {
                    "title": "Не вводиться MEV на Bitcoin",
                    "content": "Core Chain не вводить жодного MEV на Bitcoin. Користувачі довіряють валідаторам мережі Core, щоб вони не витягували MEV."
                },
                {
                    "title": "Core Chain непрямо вносить внесок до бюджету безпеки.",
                    "content": "Валідатори Core винагороджують майнерів, які делегували свій хешрейт, новими токенами CORE."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Виведення з coreBTC покладається на кілька дозволених ролей.",
                    "content": "Консенсус мережі Core, який закріплює біткоїни, coreBTC, покладається на кілька ролей для виведення, хоча всі вони є дозволеними. Він також залежить від життєздатності мережі Core, оскільки одна з цих ролей є набором смарт-контрактів на мережі Core."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Satoshi Plus",
                    "content": "Satoshi Plus — це гібридна модель Делегованого Доказу Работи (DPoW) і Делегованого Доказу Ставки (DPoS). DPoW і DPoS використовуються для вибору валідаторів, які беруть участь у консенсусі мережі Core.\n\nDPoW виконується біткоїн-майнерами та майнінговими пулами, які делегують свій існуючий хешрейт для вибору валідаторів на мережі Core. DPoS виконується тими, хто делегує свої токени CORE або BTC для вибору валідаторів на мережі Core. Валідатору присвоюється зважений бал в залежності від кількості хешрейту Bitcoin і делегованої ставки, яку вони отримують. Топ-21 валідатор за цим зваженим балом є тими, хто обирається для участі в консенсусі мережі Core.\n\nВалідатори, які обираються для участі у виробництві блоків, отримують винагороди за блоки у вигляді нових токенів CORE та комісій. Валідатори обирають, скільки з цих винагород вони ділять з майнерами та делегаторами, якщо взагалі, але зацікавлені ділитися якомога більше, щоб забезпечити, що майнери та делегатори продовжують вибирати їх для виробництва блоків.\n\nШляхом розділення майнінгу Доказу Работи від виробництва блоків, Satoshi Plus здатен пом'якшити витрати MEV від біткоїн-майнерів."
                },
                {
                    "title": "Віртуальна машина Ethereum",
                    "content": "Core Chain використовує Віртуальну машину Ethereum (EVM) для свого середовища виконання. Хоча це середовище було спочатку створене для Ethereum, його було прийнято багатьма іншими мережами.\n\nЯк і багато інших сайдчейнів Bitcoin, Core Chain використовує EVM для доступу до існуючих ресурсів розробників і інструментів."
                },
                {
                    "title": "coreBTC",
                    "content": "coreBTC — це нативний зв'язаний BTC. У кількох ролях беруть участь в спалюванні та випуску coreBTC.\n\nЛокери зберігають BTC після випуску та розподіляють його після спалювання. Вони повинні бути надмірно забезпеченими під загрозою ліквідації з боку ліквідаторів. Інші ролі також беруть участь, такі як Охоронці, Легкі клієнти Bitcoin, Штрафники, Пересилачі та Перевіряльники."
                },
                {
                    "title": "Швидші часи блокування",
                    "content": "Core Chain виробляє блок кожні три секунди, станом на березень 2024 року."
                },
                {
                    "title": "Нижчі комісії",
                    "content": "Комісії на Core Chain в середньому становлять кілька центів, станом на березень 2024 року."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Варіанти використання",
            "content": [
                {
                    "title": "DeFi",
                    "content": "Найпопулярнішим варіантом використання Core Chain є DeFi. У Core Chain є кілька DeFi-додатків, включаючи кредитування, запозичення та децентралізовані біржі, з акцентом на зв'язані активи BTC."
                },
                {
                    "title": "Стекинг BTC",
                    "content": "Core Chain дозволяє власникам BTC нативно ставити свої BTC, як частину DPOS у Satoshi Plus, і делегувати цю ставку конкретному валідатору в мережі Core Chain."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Core Chain управляється валідаторами Satoshi Plus",
                    "content": "Виробництво блоків управляється валідаторами, які беруть участь у гібридному механізмі консенсусу мережі."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Імплементація вузлів Core є відкритим кодом."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Розуміння Core Chain від Messari](https://messari.io/report/understanding-core-chain)\n[Біла книга Core Chain](https://github.com/coredao-org/whitepaper/blob/main/COREWhitepaper_v1.0.6.pdf)"
                }
            ]
        }
    ]
}
