{
    "slug": "fractal",
    "title": "Fractal",
    "layerType": "Сайдчейн",
    "live": "Mainnet",
    "bridge": false,
    "underReview": "ні",
    "riskFactors": ["Не перевірений", "Середній", "Середній", "Середній"],
    "purpose": "Загальний",
    "btcBridge": "Третій партійний міст",
    "settlement": "Позамежний",
    "btcLocked": "На розгляді",
    "executionEnv": "Позамежний",
    "consensus": "Сайдчейн",
    "nativeToken": "FB",
    "feeToken": "FB",
    "enshrinedBtc": "-",
    "bitcoinOnly": false,
    "links": [
        "https://www.fractalbitcoin.io/",
        "https://www.fractalbitcoin.io/",
        "https://docs.fractalbitcoin.io/",
        "https://docs.fractalbitcoin.io/",
        "https://github.com/fractal-bitcoin/fractald-release",
        "https://x.com/fractal_bitcoin"
    ],
    "description": "Fractal — це сайдчейн Bitcoin, створений для масштабування біткойн-орієнтованих додатків, таких як Runes та BRC-20. Він використовує новий механізм консенсусу, схожий на злиття видобутку.",
    "riskAnalysis": [
        {
            "category": "Безпека мосту",
            "score": 0,
            "tier": "Не перевірений",
            "title": "Fractal покладається на третю сторону для інфраструктури мосту",
            "content": "Міст активів Fractal між Bitcoin і Fractal управляється третьою стороною, Bool Network. Bool Network відповідає за зберігання біткойн-активів, які підтримують BTC на Fractal.\n\n⚠️ Код мосту Bool Network не є відкритим. Ми не знаємо механізму підписання або хто є підписантами для Bool Network.\n\n⚠️ Якщо зловмисний вивід буде оброблений оператором мосту, користувачі не зможуть оскаржити це. Оператори мосту можуть вкрасти кошти."
        },
        {
            "category": "Доступність даних",
            "score": 0,
            "tier": "Середній",
            "title": "Вимога до доступності даних задовольняється повними вузлами Fractal",
            "content": "Вимога до доступності даних задовольняється повними вузлами сайдчейну. Програмне забезпечення вузлів Fractal є відкритим, і будь-хто може запустити повний вузол для перевірки поточного стану ланцюга.\n\nЯк і в будь-якому сайдчейні, блоки сайдчейну можуть бути сирими, тому шахтарі зацікавлені в передачі даних і не блокують свої блоки, оскільки вони не отримають винагороду за видобуток."
        },
        {
            "category": "Виробництво блоків",
            "score": 0,
            "tier": "Середній",
            "title": "Блоки виробляються двома різними наборами шахтарів",
            "content": "Fractal успадковує ймовірну фінальність від свого набору операторів. Він реалізує механізм видобутку, званий 'cadence mining', який бачить, що кожен ⅓ блоків видобувається біткойн-шахтарями, а ⅔ блоків видобуваються шахтарями, які використовують програмне забезпечення видобутку Fractal. Це означає, що Fractal працює з двома різними алгоритмами видобутку, спрямованими на два різні набори операторів.\n\nБлоки Fractal вважаються фіналізованими після того, як достатня кількість хешрейту побудовано на найтривалішому ланцюзі."
        },
        {
            "category": "Гарантії фінальності",
            "score": 0,
            "tier": "Середній",
            "title": "Повні вузли Fractal перевіряють запропоновані блоки",
            "content": "Перехід стану Fractal перевіряється його набором шахтарів. Після того, як блок видобуто шахтарем Fractal, він передається його набору повних вузлів, які перевіряють блок і включають його в ланцюг."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Fractal частково зливається в видобутку",
                    "content": "Fractal частково забезпечується біткойн-шахтарями, які зливаються в видобутку Fractal як частину налаштування cadence mining."
                },
                {
                    "title": "MEV не безпосередньо на біткойні",
                    "content": "Fractal не передає MEV безпосередньо на біткойн. Біткойн-шахтарі можуть використовувати можливості витягування MEV, якщо мережа зазнає високої активності."
                },
                {
                    "title": "Альтернативний токен використовується для зборів і стимулювання шахтарів",
                    "content": "Збори на Fractal оплачуються токенами FB. Випуск токенів виплачується в токенах FB для стимулювання шахтарів."
                },
                {
                    "title": "Злиття в видобутку дозволяє біткойн-шахтарям заробляти більше зборів",
                    "content": "Fractal опосередковано сприяє безпеці біткойна, надаючи біткойн-шахтарям можливість заробляти дохід від зборів через злиття в видобутку."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Додаткові міркування",
            "content": [
                {
                    "title": "Блокчейн Fractal зростає швидкими темпами",
                    "content": "Блокчейн Fractal зростає швидше, ніж біткойн. Як блокчейн продовжує зростати, стає складніше для користувачів запускати повні вузли Fractal. Це може призвести до того, що більшість користувачів покладуть вимогу до доступності даних на іншу сторону."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Користувачі довіряють консенсусу сайдчейну та третім сторонам з виведенням",
                    "content": "Виведення з Fractal, як і в будь-якому сайдчейні, користувачам потрібно довіряти операторам ланцюга Fractal та оператору мосту, Bool Network, щоб обробити їх транзакцію на виведення та випустити кошти на головному ланцюгу Bitcoin."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Bitcoin Script",
                    "content": "Bitcoin Script — це мова сценаріїв біткойна, яка дозволяє користувачам визначати умови, за яких UTXO біткойна може бути витрачено. Це мова програмування низького рівня на основі асемблера.\n\nFractal базується на Bitcoin Script."
                },
                {
                    "title": "OP_CAT",
                    "content": "OP_CAT — це опкод Bitcoin, скорочений від Operation Concatenate. Він дозволяє об'єднувати два елементи даних у стеку біткойна. Цей опкод спочатку був представлений Сатоші Накамото, але був видалений через потенційні вектори атак відмови в обслуговуванні.\n\nOP_CAT дозволить більш виразні смарт-контракти на біткойні, включаючи 'ковенанти', спосіб встановлення умов витрачання для окремих UTXO. Команди також перевіряють, як це може підтримувати перевірку SNARK в Script, що ще більше покращить містіння активів L1 у протоколи другого шару."
                },
                {
                    "title": "Злиття в видобутку",
                    "content": "Злиття в видобутку — це функція механізму консенсусу Fractal, яка дозволяє поєднання між біткойном і Fractal. По суті, пули видобутку BTC додають посилання на блоки Fractal у завдання видобутку, надіслані учасникам видобутку. Оскільки алгоритм видобутку Fractal такий самий, як і біткойна, витрати енергії мінімальні. Це дозволяє біткойн-шахтарям додатково видобувати частину блоків Fractal. Шахтарі заохочуються через отримання частки зборів за транзакції та нових випущених токенів за видобуток Fractal."
                },
                {
                    "title": "Cadence mining",
                    "content": "Cadence mining — це новий механізм видобутку, в якому ⅓ блоків Fractal видобуваються біткойн-шахтарями, які зливаються в видобутку Fractal, а ⅔ блоків видобуваються власним набором шахтарів. Таким чином, безпека видобутку Fractal залежить від двох різних наборів операторів.\n\nБіткойн-шахтарі, які хочуть зливатися в видобутку Fractal, спрямовують частину свого хешрейту для забезпечення ланцюга Fractal. Шахтарі Fractal використовують особливе програмне забезпечення для видобутку, яке має інше налаштування складності."
                },
                {
                    "title": "Треті партійні мости",
                    "content": "Bool Network наразі полегшує мостіння біткойн-активів між Fractal і головним ланцюгом Bitcoin. Bool Network використовує унікальну схему MPC для свого набору підписантів, але код механізму не є відкритим."
                },
                {
                    "title": "Швидші часи блокування",
                    "content": "Fractal досягає підтвердження блоків приблизно кожні 30 секунд."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Використання",
            "content": [
                {
                    "title": "Торговля Ordinals і BRC-20",
                    "content": "Завдяки подібній мові сценаріїв до головного ланцюга Bitcoin, Fractal надає користувачам подібні можливості для торговлі Ordinals і токенами BRC-20, як і на L1 біткойна."
                },
                {
                    "title": "Тестова площадка для нових опкодів",
                    "content": "Оскільки Fractal дозволив опкоди, які ще не активні на біткойні, розробники можуть розгортати програми там, щоб попередньо переглянути, як це буде виглядати на біткойні. Це включає аналіз досвіду розробника, потенційних вразливостей безпеки та представлення того, як ці зміни можуть назавжди вплинути на мережу Bitcoin."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Вихідний код реалізації вузла Fractal є відкритим."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Блокчейн-експлорер Fractal.](https://fractal.unisat.io/explorer)"
                }
            ]
        }
    ]
}
