{
    "slug": "internetcomputer",
    "title": "Internet Computer",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["High", "High", "Medium", "Medium"],
    "purpose": "General",
    "btcBridge": "Consensus-level Multi-sig",
    "settlement": "Offchain",
    "btcLocked": 277,
    "executionEnv": "Offchain",
    "consensus": "Sidechain",
    "nativeToken": "ICP",
    "feeToken": "ckBTC",
    "enshrinedBtc": "ckBTC",
    "bitcoinOnly": false,
    "links": [
        "https://internetcomputer.org/bitcoin-integration",
        "https://internetcomputer.org/bitcoin-integration",
        "https://internetcomputer.org/docs/current/references/bitcoin-how-it-works",
        "https://dashboard.internetcomputer.org/bitcoin",
        "https://github.com/dfinity/bitcoin-canisteri",
        "https://twitter.com/dfinity"
    ],
    "description": "Протокол Internet Computer (ICP) — це мережа з'єднаних підмереж блокчейнів. Він має модуль смарт-контрактів, відомий як Bitcoin Canister, який дозволяє смарт-контрактам ICP отримувати інформацію про стан Bitcoin та здійснювати транзакції Bitcoin. Додатково має синтетичний токен, відомий як ckBTC, який забезпечує мультипідписну схему для зберігання BTC та випуску і знищення синтетичних токенів ckBTC на ICP. Розробники можуть розгортати різноманітні програми, використовуючи Bitcoin Canister та ckBTC.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "High",
            "title": "Кошти зберігаються набором підписувачів, обраних консенсусом ICP",
            "content": "Користувачі, які вносять кошти в ckBTC, довіряють групі операторів, які обираються через управління ICP, відповідальність за зберігання своїх біткойнів. Оператори підмережі ‘pzp6e…’ управляють модулем смарт-контракту “ckBTC”, який відповідає за випуск, зберігання та знищення токенів, забезпечених біткойном, на сайдчейні ICP.\n\nЦей смарт-контракт є частиною підмережі з 34 операторів вузлів. Ці оператори пройшли процес перевірки для управління ICP і є публічно відомими."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "High",
            "title": "Вимога до доступності даних виконана альтернативним механізмом консенсусу, але експлуатація вузлів не є бездозвільною",
            "content": "Дані щодо стану ‘pzp6e…’ надаються та зберігаються 34 індивідуальними операторами вузлів, які працюють у підмережі. Якщо вузли для цієї підмережі вийдуть з ладу, і резервна копія стану не буде регулярно створена, користувачі втратять доступ до свого балансу ckBTC і не зможуть знищити токени ckBTC для біткойнів, заблокованих у відповідній мультипідписній схемі на головній ланцюзі."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Medium",
            "title": "Безліч ролей, залучених до створення блоків та врегулювання транзакцій ckBTC",
            "content": "Врегулювання передач ckBTC є результатом консенсусу операторів підмережі ‘pzp6e…’. Після того, як транзакція буде завершена, її неможливо переписати. Користувачі можуть використовувати свої ckBTC на будь-якій підмережі ICP залежно від програм, з якими вони взаємодіють. Користувачі ініціюють “виклик” до конкретної програми на будь-якій підмережі, і граничний вузол маршрутизує цей виклик відповідно. Контракт потім приймає виклик, ініціює транзакцію та підтверджує її, якщо 2/3 операторів вузлів на даній підмережі приймуть її. Це змушує припущення довіри до активності варіюватися від підмережі до підмережі. Специфічні для Bitcoin додатки також залежать від Bitcoin Canister, який знаходиться на підмережі ‘w4rem…’, що управляється 13 вузлами. 22 Граничні Вузли управляються централізованою розробницькою організацією, Фондом DFINITY."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Medium",
            "title": "Гарантії остаточності забезпечуються альтернативним механізмом консенсусу",
            "content": "Після того, як транзакції прийняті в блок валідаторами підмережі, їх неможливо скасувати."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "ICP не успадковує безпеку від консенсусу біткойн",
                    "content": "ICP не має відносин з учасниками консенсусу біткойн."
                },
                {
                    "title": "Протокол не дозволяє MEV на Bitcoin.",
                    "content": "Модуль Bitcoin ICP є окремою мережею консенсусу і не має прямого відношення до Bitcoin, отже, не вводить MEV на базовому рівні."
                },
                {
                    "title": "Альтернативний токен відіграє роль у безпеці мережі",
                    "content": "Безпека мережі ICP залежить від моделі управління, яка використовує токен ICP для голосування. Валідатори отримують винагороду новими токенами ICP за ведення валідаторів. Користувачі не сплачують жодних зборів за транзакції на підмережах ICP."
                },
                {
                    "title": "ICP не робить прямого внеску в бюджет безпеки",
                    "content": "ICP наразі не сплачує зборів біткойн-майнерам."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення коштів",
            "content": [
                {
                    "title": "Виведення дозволені конкретною підмережею ICP",
                    "content": "Виведення врешті-решт обробляються операторами підмережі ‘pzp6e’, яка управляє смарт-контрактом ckBTC. Користувачі довіряють, що принаймні 12 з 34 підписувачів залишаться чесними, не вкрадуть їхні кошти та оброблять їхні виведення. Якщо Bitcoin Canister вийде з ладу, смарт-контракт ckBTC не зможе видати виведення для користувачів, які хочуть знищити ckBTC та отримати біткойн. Виведення будуть призупинені, поки підмережа Bitcoin Canister не повернеться в онлайн."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Підписи ECDSA з порогом",
                    "content": "Мережа ICP використовує tECSDA підписи для двостороннього з'єднання ckBTC з Bitcoin. Це означає, що приватний ключ для біткойн-адреси, що зберігає кошти, ділиться між 34 вузлами, що управляють відповідною підмережею."
                },
                {
                    "title": "Bitcoin Canister & Адаптер",
                    "content": "Мережа ICP підтримує інтеграцію з Bitcoin. Мережа ICP має підмережу, присвячену Bitcoin Canister та Адаптеру. Bitcoin Canister дозволяє підмережам блокчейну ICP взаємодіяти з мережею Bitcoin. Вони можуть мати біткойн-адреси, підписувати транзакції та подавати транзакції до мережі Bitcoin. Bitcoin Адаптер дозволяє Bitcoin Canister отримувати стан Bitcoin, періодично запитуючи випадково обрану групу біткойн-вузлів."
                },
                {
                    "title": "Підтримуються різні мови програмування та модулі",
                    "content": "Мережа ICP підтримує різноманітні мови програмування та модулі. Завдяки архітектурі багатьох підмереж ICP немає закріпленої мови програмування. Розробники можуть будувати на підмережі, яка найкраще підтримує їхні індивідуальні випадки використання. Дві основні мови, що використовуються для розробки в ICP, це Rust і Mokoto. Модулі ICP також можуть підтримувати більш виразні смарт-контракти, ніж основна ланцюг Bitcoin."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Варіанти використання",
            "content": [
                {
                    "title": "Низькі збори",
                    "content": "Транзакції ckBTC в ICP коштують частку цента станом на липень 2024 року."
                },
                {
                    "title": "Торгівля Ordinals та Runes",
                    "content": "ICP підтримує створення Runes, BRC-20 та ринків Ordinals. Розробники додатків можуть розгортати на ICP для покращення продуктивності своїх додатків. Ці модулі додатків підтримуються Bitcoin Canister та Bitcoin Adapter."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Оператори вузлів ICP обираються системою управління NNS",
                    "content": "Мережа ICP управляється кількома уповноваженими сторонами, які обираються через процес управління NNS. NNS — це токенізований механізм управління, в якому тримачі токенів блокують свої токени в контракті управління та можуть голосувати за пропозиції та оновлення мережі, включаючи додавання та видалення операторів вузлів з конкретних підмереж. Голоси зважуються залежно від кількості токенів, що ставляться в системі, та часу, протягом якого токени були заблоковані. Голосуючі можуть делегувати свій голос, якщо не можуть особисто голосувати за конкретні пропозиції.\n\nОператори вузлів підмережі ICP обираються механізмом управління NNS ICP. Оператори вузлів не ставлять жодного капіталу і не підлягають штрафам, але якщо вони поводитимуться неналежно, їх буде виключено через механізм управління ICP, і вони втратять можливість отримувати винагороди в майбутньому."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Код джерела",
            "content": [
                {
                    "title": "Код, пов'язаний з модулями біткойна, є відкритим",
                    "content": "Модулі, що стосуються інтеграції ICP з Bitcoin, є відкритими."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Документація для розробників ICP](https://internetcomputer.org/docs/current/developer-docs/getting-started/overview-of-icp)\n[Огляд ckBTC](https://wiki.internetcomputer.org/wiki/Chain-key_Bitcoin)"
                }
            ]
        }
    ]
}
