{
    "slug": "lightning",
    "title": "Lightning Network",
    "layerType": "State Channel",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Low", "Low", "Low", "Low"],
    "purpose": "Payments",
    "btcBridge": "2-2 Multi-sig",
    "settlement": "Onchain",
    "btcLocked": 5208,
    "executionEnv": "Optimistic",
    "consensus": "Peer-to-Peer",
    "nativeToken": "BTC",
    "feeToken": "BTC",
    "enshrinedBtc": "BTC",
    "bitcoinOnly": true,
    "links": [
        "https://lightning.network/",
        "https://docs.corelightning.org/docs/home",
        "https://docs.corelightning.org/docs/home",
        "https://github.com/ACINQ/eclair",
        "https://twitter.com/lightning"
    ],
    "description": "Lightning Network (іноді відомий як Lightning) — це базова платіжна мережа другого рівня, що використовує канали платежів. Вона дозволяє користувачам відкривати платіжний канал з контрагентом і здійснювати необмежену кількість платежів у межах каналу. Вона також дозволяє користувачам маршрутизувати платежі через мережу цих каналів до користувачів поза їхнім конкретним каналом.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "Low",
            "title": "Користувачі зберігають свої кошти у контрагента",
            "content": "Коли користувач відкриває платіжний канал, він вносить свої кошти у 2-2 мультипідписний адрес з контрагентом через ончейн-транзакцію Bitcoin. Цей адрес зберігає кошти, що переносяться в каналі, і користувачі можуть спільно вийти з каналу, погодившись на остаточний стан перед підписанням зняття коштів.\n\nЯкщо контрагент каналу не реагує на спробу кооперативного закриття каналу, користувачі можуть одноосібно вийти з каналу, витративши некоректну транзакцію закриття каналу на ончейні. Існує механізм викликів-відповідей для вирішення потенційних суперечок між контрагентами каналу щодо остаточного стану транзакції закриття каналу."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Low",
            "title": "Користувачі несуть відповідальність за виконання вимог до доступності даних. Дані стану за замовчуванням самостійно хостяться",
            "content": "Користувачі Lightning повинні відповідати за свою доступність даних, а не покладатися на мережу вузлів для виконання цієї функції. Якщо користувачі незворотно втрачають свої дані стану каналу, вони втрачають усі кошти, які мали в каналі."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Low",
            "title": "Транзакції Lightning здійснюються через рівноправну мережу",
            "content": "У платіжному каналі користувачі взаємодіють у рівноправний спосіб, що означає, що немає потреби в секвенсорах або побудовниках блоків. Якщо користувач хоче передати кошти комусь, хто не є в їхньому конкретному каналі, він може маршрутизувати свій платіж через мережу вузлів, щоб дістатися отримувача. Якщо контрагент каналу не вдається маршрутизувати платіж, користувачу доведеться пройти через інший канал (якщо у нього є інший відкритий канал і є маршрут до отримувача) або повернутися на ончейн для передачі коштів отримувачу.\n\nМаршрутовані платежі є атомарними, тобто всі компоненти транзакції або успішні, або зазнають невдачі.\n\nТранзакції Lightning Network вважаються остаточними лише тоді, коли канал закритий. Консенсус Bitcoin забезпечує це закриття, як і будь-яку іншу транзакцію. При закритті каналу користувачі можуть спільно підписати остаточний стан, перевірити цей стан через консенсус Bitcoin і потім продовжити знімати свої кошти."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Low",
            "title": "Користувачі можуть оскаржити злочинного контрагента",
            "content": "Транзакції в Lightning Network відбуваються атомарно через HTLC. Після підтвердження їх неможливо скасувати. Користувачі також можуть забезпечити остаточність при закритті каналу з контрагентом."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Розрахунок остаточний за консенсусом Bitcoin",
                    "content": "Як зазначено в аналізі ризиків, розрахунок оптимістично завершується за консенсусом Bitcoin."
                },
                {
                    "title": "Протокол не дозволяє MEV на Bitcoin",
                    "content": "Lightning не дозволяє злочинні форми MEV на Bitcoin. Оскільки всі транзакції здійснюються поза мережею в межах платіжного каналу, майнери не можуть впливати на порядок транзакцій, виконаних через Lightning."
                },
                {
                    "title": "Інший токен не потрібен для безпеки мережі",
                    "content": "Lightning не використовує інший токен для забезпечення безпеки мережі."
                },
                {
                    "title": "Відкриття та закриття каналів сприяє безпековому бюджету",
                    "content": "Lightning безпосередньо не робить внесок у безпековий бюджет Bitcoin, але користувачі платять ончейн-комісії майнерам, коли відкривають та закривають канали Lightning."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Додаткові міркування",
            "content": [
                {
                    "title": "Фрикції самостійного хостингу даних призводять користувачів до централізованих рішень",
                    "content": "Нетехнічним користувачам може бути важко самостійно хостити свій вузол Lightning, що може призвести до використання кастодіальних рішень. Це може призвести до централізації мережі, оскільки користувачі не взаємодіють безпосередньо. Звіт River 2024 року виявив, що 80% ліквідності Lightning Network знаходиться в каналах, які хостять централізовані постачальники послуг."
                },
                {
                    "title": "Атаки заміщення циклів",
                    "content": "У 2023 році було виявлено вразливість, відому як атака заміщення циклів. Ця атака вимагає наявності двох відкритих каналів з користувачем, які використовуються разом для циклічних транзакцій користувача протягом їхнього періоду виклику."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення коштів",
            "content": [
                {
                    "title": "Користувачі можуть одноосібно знімати свої кошти з оптимістичними гарантіями розрахунку",
                    "content": "Користувачі можуть закрити канал і зняти свої кошти в будь-який час. Вони можуть закрити канал спільно з контрагентом, погодившись на остаточний стан каналу і знявши свої баланси на відповідні адреси. У разі суперечки щодо остаточного стану модель Lightning Network є оптимістичною. Злочинний користувач може спробувати вкрасти кошти каналу, подавши транзакцію закриття каналу зі старим станом. Якщо їхній контрагент офлайн і не має вежі спостереження протягом усього періоду виклику, старий стан буде остаточним, що дозволить крадіжці відбутися. Якщо контрагент або їхня вежа спостереження онлайн під час періоду виклику, вони можуть подати викликову транзакцію на ончейн, що зупинить спробу крадіжки та забере повний баланс каналу, який було неправильно закрито. Користувачі повинні усвідомлювати, що вартість оскарження неправильного закриття каналу може значно зменшити баланс каналу до точки, коли це може стати економічно невигідним, якщо тарифи на Bitcoin занадто високі. Користувачі також повинні бути обережними, що якщо вони не зможуть підтвердити свою викликову транзакцію до закінчення періоду виклику, наприклад, через те, що їхня транзакція затримується майнерами Bitcoin, вони ризикують втратити повний баланс свого каналу контрагенту."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Платіжні канали",
                    "content": "Платіжні канали — це 2-2 мультипідписні адреси, які дозволяють двом контрагентам заблокувати кошти в адресі та обробити необмежену кількість платежів між собою. Платежі вважаються остаточними, коли сторони знімають свої кошти назад на ончейн і закривають свій канал. Створення та управління одним або кількома платіжними каналами — це спосіб, яким користувач взаємодіє з Lightning."
                },
                {
                    "title": "Маршрутизація мережі",
                    "content": "Lightning — це мережа різних двосторонніх платіжних каналів. Користувачі можуть маршрутизувати свої платежі через різноманітні канали, щоб досягти кінцевого призначення (отримувача). Атомарність забезпечується за допомогою скрипта, що гарантує, що транзакція або досягає свого призначення, або повністю зазнає невдачі."
                },
                {
                    "title": "Контракти з хешованим таймлоком (HTLC)",
                    "content": "HTLC — це смарт-контракти, які забезпечують умовні та атомарні платежі. HTLC використовуються в Lightning для дозволу маршрутизації транзакцій через кілька вузлів. Ці контракти спроектовані так, щоб маршрутизовані платежі проходили атомарно, тобто платіж або успішний, або повністю зазнає невдачі. Вузли маршрутизації не можуть неправомірно привласнити кошти, оскільки вони не можуть розкрити секретний преобразувач, який є умовою для завершення транзакції. Тільки призначений отримувач має доступ до секретного преобразувача, створеного під час генерації рахунку транзакції."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Варіанти використання",
            "content": [
                {
                    "title": "Мікроплатежі",
                    "content": "Завдяки низьким комісіям, Lightning добре підходить для невеликих або частих транзакцій."
                },
                {
                    "title": "Швидші транзакції",
                    "content": "Завдяки майже миттєвим підтвердженням завдяки позанесеній мережі та використанню P2P-консенсусу, Lightning добре підходить для швидких транзакцій."
                },
                {
                    "title": "Інтероперабельність",
                    "content": "Lightning може виступати як шар інтероперабельності між блокчейн-протоколами та операторами мостів."
                },
                {
                    "title": "Провайдери послуг Lightning (LSP)",
                    "content": "Провайдер LSP розгортає ліквідність у Lightning від імені інших. LSP покращують UX Lightning для користувачів, постачаючи ліквідність і управляючи платіжними каналами від їхнього імені. Управління платіжним каналом може супроводжуватися низкою труднощів UX, тому LSP усувають більшість складнощів та стягують комісії за свою роботу. Ці провайдери зазвичай взаємодіють з користувачами так, щоб забезпечити збереження контролю над їхніми коштами. Однак навіть використовуючи самостійний гаманець, що підтримується LSP, користувачі все ще повинні ініціювати основні транзакції, щоб внести кошти в свій гаманець."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Lightning Network є рівноправною",
                    "content": "Єдиними операторами є користувач і контрагент, з яким вони відкривають платіжний канал. Користувачі можуть транзитивно взаємодіяти з іншими, у кого відкриті канали з їхніми контрагентами. Оператори Lightning Network повинні запускати свої власні вузли та мати майже ідеальний час роботи, щоб забезпечити, що їхні канали не примусово закриваються або закриваються зі старим станом каналу. Використання самостійного гаманця, що підтримується LSP, гарантує, що користувачі зберігають контроль над своїми коштами, але оператор LSP може в будь-який момент припинити обслуговування користувачів, що означає, що користувачі повинні зняти свої кошти на ончейн-адресу та знайти нового LSP."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Код джерела",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Існує кілька безкоштовних та відкритих реалізацій протоколу Lightning Network."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Корисна інформація",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Доклад про Lightning Network](https://lightning.network/lightning-network-paper.pdf)\n[Посібник користувача Lightning Network](https://bitcoiner.guide/lightning/)"
                }
            ]
        }
    ]
}
