{
    "slug": "liquid",
    "title": "Liquid",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Medium", "High", "Medium"],
    "purpose": "General",
    "btcBridge": "Federated Multisig",
    "settlement": "External",
    "btcLocked": 3834,
    "executionEnv": "Offchain",
    "consensus": "Federated Sidechain",
    "nativeToken": "LBTC",
    "feeToken": "LBTC",
    "enshrinedBtc": "LBTC",
    "bitcoinOnly": true,
    "links": [
        "https://liquid.net/",
        "https://docs.liquid.net/docs/technical-overview",
        "https://docs.liquid.net/docs/technical-overview",
        "https://blockstream.info/liquid",
        "https://github.com/ElementsProject/elements",
        "https://twitter.com/bitcoinlayers"
    ],
    "description": "Liquid Network — це сайдчейн, який дозволяє користувачам здійснювати конфіденційні транзакції, обміни, випуск токенізованих активів тощо на сайдчейні. Він управляється дозволеною федерацією і не використовує основний шар Bitcoin для забезпечення безпеки. BTC, що використовується для випуску BTC IOU (L-BTC) на сайдчейні, зберігається в мультипідписному гаманці.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "Unverified",
            "title": "Користувачі довіряють федерації з утриманням їх BTC. Підписанти підлягають перевірці",
            "content": "Виведення BTC наразі контролюється федерацією Liquid. Користувачі повинні довіряти, що підписанти не зможуть зговоритися і вкрасти їх BTC. Більшість користувачів зазвичай отримують L-BTC на вторинних ринках, а не через мости. Підтримувані ринки для L-BTC також є членами федерації Liquid. Користувачі довіряють, що федерація не вкраде BTC, що зробить їх новостворений L-BTC безвартісним. BTC, що підтримує L-BTC, зберігається в мультипідписному гаманці 11-15, де для крадіжки BTC потрібно скомпрометувати 11 (⅔ + 1) підписантів.\n\n🔬Ми наразі перевіряємо підписантів для двостороннього з'єднання Liquid."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Дані зберігаються та надаються вузлами Liquid. Кожен може запустити вузол Liquid",
            "content": "Дані для сайдчейну Liquid зберігаються на блокчейні Liquid. Федерація відповідальна за публікацію та валідацію транзакцій, які публікуються на вузлах Liquid Network. Програмне забезпечення вузлів є відкритим, і будь-хто може запустити вузол і перевірити стан Liquid. Однак оператори вузлів підключаються до мережі через \"містові вузли\", які управляються дозволеними учасниками. Доступ до містових вузлів може бути заблокований, якщо ці учасники (близько 65) не нададуть доступ."
        },
        {
            "category": "Network Operator",
            "score": 0,
            "tier": "High",
            "title": "Блоки виробляються федерацією",
            "content": "Блоки Liquid пропонуються та фіналізуються федерацією Liquid. Роль виробництва блоків є дозволеною, що означає, що будь-хто з достатніми ресурсами не може приєднатися до мережі як виробник блоків. Користувачі довіряють, що федерація не буде цензурувати їх і включати їх транзакції в блоки Liquid."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Medium",
            "title": "Блоки Liquid фіналізуються через повні вузли Liquid",
            "content": "Після того, як блоки запропоновані функціонерами, 11 з 15 функціонерів мають підписати блок, щоб поширити його в мережі. Після цього повні вузли Liquid приймають блок і включають його в ланцюг."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Liquid не успадковує жодної безпеки від учасників консенсусу Bitcoin",
                    "content": "Оскільки оператори мережі є закритим набором, сайдчейн Liquid не успадковує безпеку від учасників консенсусу Bitcoin."
                },
                {
                    "title": "Інший токен не потрібен",
                    "content": "Liquid не має нативного токена, який відіграє роль у безпеці мережі. Користувачі довіряють репутації функціонерів Liquid і членів федерації, які також пройшли KYC у компанії Blockstream, щоб чесно управляти мережею."
                },
                {
                    "title": "Не вводить MEV на Bitcoin",
                    "content": "Liquid не впускає MEV в базовий шар Bitcoin."
                },
                {
                    "title": "Не робить прямого внеску в бюджет безпеки",
                    "content": "Liquid сплачує комісії за транзакції майнерам під час проведення виведень і депозитів для свого двостороннього з'єднання."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Користувачі довіряють дозволеним операторам обробляти свої виведення",
                    "content": "Виведення дозволяються федерацією Liquid. Користувачі не можуть вивести свої кошти, якщо федерація цензурує їх. Користувачі також можуть використовувати вторинний ринок, щоб обміняти BTC на LBTC, але також повинні довіряти федерації, щоб включити, запропонувати і валідувати їхню обмінну транзакцію в рамках Liquid."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Elements",
                    "content": "Liquid побудований на технологічному стеку Elements. Elements — це відкритий технологічний стек, побудований на основі коду Bitcoin. Оскільки він побудований на основі коду Bitcoin, Elements дозволяє Liquid бути майданчиком для тестування потенційних змін до протоколу Bitcoin."
                },
                {
                    "title": "Більш виразні смарт-контракти",
                    "content": "Liquid має ряд додаткових опкодів, які дозволяють розробникам створювати більш виразні додатки смарт-контрактів. Ці додатки можуть включати лімітні ордери, контракти опціонів і протоколи атомарних обмінів. Однак середовище виконання Liquid все ще не є Turing-complete."
                },
                {
                    "title": "Швидші блоки",
                    "content": "Liquid має фіксований час блоків і виробляє блок кожну хвилину."
                },
                {
                    "title": "Нижчі комісії",
                    "content": "Станом на 23 квітня 2024 року комісії в мережі Liquid значно нижчі, ніж у основному ланцюзі Bitcoin."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Варіанти використання",
            "content": [
                {
                    "title": "Конфіденційні транзакції",
                    "content": "Liquid дозволяє здійснювати конфіденційні транзакції, що забезпечує користувачам вищий рівень конфіденційності. Ця функція гарантує, що ніхто, крім учасників транзакції, не може бачити токени та їх кількість, що передаються між ними."
                },
                {
                    "title": "Токенізовані активи",
                    "content": "Liquid дозволяє розробникам і користувачам випускати токенізовані цінні папери, стейблкоїни та синтетичні форми криптовалют."
                },
                {
                    "title": "Атомарні обміни",
                    "content": "Усі токени, випущені на Liquid, включаючи L-BTC, підпорядковуються одному стандарту токенів. Це забезпечує атомарний обмін між будь-якими токенами на Liquid."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Liquid управляється федерацією",
                    "content": "Liquid в основному управляється заздалегідь визначеною, дозволеною групою операторів, відомою як \"Функціонери\", які є частиною її федерації. Більша група \"Членів\" бере участь у федерації, визначаючи оновлення мережі та голосуючи на виборах до правління. Користувачі можуть довіряти цим операторам через репутаційний ризик, який вони беруть на себе в екосистемі Bitcoin, якщо вони діють зловмисно."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Код джерела",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Весь код, пов'язаний з проектом Liquid Network, є відкритим."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Корисна інформація",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Сайт Liquid](https://liquid.net/)\n[Стаття, що пояснює, як працює L-BTC](https://help.blockstream.com/hc/en-us/articles/900001408623-How-does-Liquid-Bitcoin-L-BTC-work)\n[Документація Liquid](https://docs.liquid.net/docs/technical-overview)\n[Стаття, що висвітлює нюанси моделі безпеки Liquid](https://blog.liquid.net/the-truth-about-liquid/)"
                }
            ]
        }
    ]
}
