{
    "slug": "moneta",
    "title": "Moneta (Демо)",
    "layerType": "Роллап",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "ні",
    "riskFactors": ["Середній", "Низький", "Високий", "Середній"],
    "purpose": "Загальний",
    "btcBridge": "Федеративний 1-із-N",
    "settlement": "На ланцюзі",
    "btcLocked": 3555,
    "executionEnv": "EVM",
    "consensus": "PoS Мережа",
    "nativeToken": "MTA",
    "feeToken": "mBTC",
    "enshrinedBtc": "mBTC",
    "bitcoinOnly": false,
    "links": [
        "https://twitter.com/bitcoinlayers",
        "https://twitter.com/bitcoinlayers",
        "https://twitter.com/bitcoinlayers",
        "https://twitter.com/bitcoinlayers",
        "https://twitter.com/bitcoinlayers",
        "https://twitter.com/bitcoinlayers"
    ],
    "description": "Moneta — це роллап, який використовує Bitcoin для доступності даних і консенсусу. Він має оптимістично перевірений валідуючий міст через BitVM. Використовуються STARK докази для підтвердження переходів стану. У разі недійсного переходу стану валідатори в мосту BitVM можуть подати доказ шахрайства, щоб показати, що перехід стану був недійсним.",
    "riskAnalysis": [
        {
            "category": "Односторонні виходи",
            "score": 0,
            "tier": "Середній",
            "title": "Виведення залежить від довірчих припущень 1-із-N.",
            "content": "Виведення BTC та/або біткоїн-активів з роллапу не є бездовірним. Користувачі повинні довіряти, що 1 з будь-якої кількості валідаторів BitVM у валідуючому мосту діє чесно, щоб обробити їхнє виведення."
        },
        {
            "category": "Доступність даних",
            "score": 0,
            "tier": "Низький",
            "title": "Різниці станів зберігаються на Bitcoin.",
            "content": "Усі дані, необхідні для відновлення стану роллапу, зберігаються на Bitcoin Layer 1."
        },
        {
            "category": "Виробництво блоків",
            "score": 0,
            "tier": "Високий",
            "title": "Користувачі можуть самостійно послідовно обробляти, але не самостійно пропонувати.",
            "content": "Якщо централізований послідовник Moneta виходить з ладу, користувачі можуть подати свої транзакції на L1 для упорядкування. У разі цензури, доказувач Moneta зобов'язаний включити транзакції, що послідовно оброблені L1, у свій перехід стану, інакше генерування доказів не вдасться. Щодо пропозиції змін стану, лише включені до списку пропоненти можуть публікувати корені стану на L1, тому у разі збою виведення заморожується."
        },
        {
            "category": "Перевірка стану",
            "score": 0,
            "tier": "Середній",
            "title": "Розрахунок відбувається поза ланцюгом.",
            "content": "Оптимістично перевірені zkSTARK докази забезпечують правильність стану. У разі недійсного переходу стану, актори, що спостерігають за ланцюгом, можуть подавати докази шахрайства, щоб довести, що перехід стану є неправильним."
        }
    ],
    "sections": [
        {
            "id": "description",
            "title": "Опис",
            "content": [
                {
                    "content": "Moneta — це роллап, який використовує Bitcoin для доступності даних і консенсусу. Він має оптимістично перевірений валідуючий міст через BitVM. Використовуються STARK докази для підтвердження переходів стану. У разі недійсного переходу стану валідатори в мосту BitVM можуть подати доказ шахрайства, щоб показати, що перехід стану був недійсним."
                }
            ]
        },
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Роллап покладається на Bitcoin для доступності даних і консенсусу",
                    "content": "Стан Moneta може бути відновлено на основі даних, які зберігаються на блокчейні Bitcoin."
                },
                {
                    "title": "Хешпот Bitcoin використовується для забезпечення Moneta",
                    "content": "Хешпот Bitcoin використовується для видобутку блоків, що містять транзакції, які включають переходи стану Moneta."
                },
                {
                    "title": "Moneta не має альтернативного токена",
                    "content": "Moneta використовує ваучер BTC для роботи роллапу."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технологія",
            "content": [
                {
                    "title": "Докази дійсності забезпечують правильність стану",
                    "content": "Кожен перехід стану повинен містити доказ дійсності, який доводить, що виконання було здійснене правильно до серії транзакцій користувачів. Якщо доказ включає недійсний перехід стану, то валідатор у налаштуванні BitVM може подати доказ шахрайства, щоб оскаржити перехід стану."
                },
                {
                    "title": "Використовується криптографія нульового знання STARK",
                    "content": "Переходи стану доводяться через криптографічні докази, відомі як zkSTARK. Якщо реалізація криптографії була виконана неправильно, кошти користувачів можуть бути під загрозою. STARK не вимагають довіреного налаштування."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Система має централізованого оператора",
                    "content": "Виробництво блоків управляється однією сутністю. Користувачі довіряють цій сутності діяти в найкращих інтересах системи."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Виведення залежить від довірчих припущень 1-із-N",
                    "content": "У разі, якщо оператори системи діють чесно, користувачі довіряють, що 1 сторона в налаштуванні мосту BitVM діє чесно і дозволить їм виведення з L2."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Програмне забезпечення вузла є відкритим і доступним",
                    "content": "Програмне забезпечення вузла є відкритим, і його вихідний код можна знайти тут. Користувачі можуть запустити вузол зі своїм обладнанням або через постачальника хмарних послуг."
                }
            ]
        }
    ]
}
