{
    "slug": "rollux",
    "title": "Rollux",
    "layerType": "Sidechain Rollup",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Medium", "Medium", "Medium"],
    "purpose": "General",
    "btcBridge": "Federated",
    "settlement": "Offchain",
    "btcLocked": 10,
    "executionEnv": "Offchain",
    "consensus": "Hybrid Consensus",
    "nativeToken": "SYS",
    "feeToken": "SYS",
    "enshrinedBtc": "wBTC",
    "bitcoinOnly": false,
    "links": [
        "https://rollux.com/",
        "https://docs.rollux.com/docs/developers/",
        "https://docs.rollux.com/docs/developers/",
        "https://explorer.rollux.com/",
        "https://github.com/SYS-Labs/rollux",
        "https://twitter.com/RolluxL2"
    ],
    "description": "Rollux — це оптимістичний ролап, який використовує Syscoin, дві блокчейн-системи, які одночасно мердж-майнять біткоїн-майнери, як свою базову платформу для доступності даних та валідації стану відповідно. Він має середовище виконання, сумісне з EVM.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "Critical",
            "title": "Rollux не має мосту на рівні консенсусу з біткоїном",
            "content": "Rollux L2 наразі не має прямого мосту з головною ланцюгом Bitcoin. Єдиний синтетичний біткоїн на Rollux — це контракт wBTC. Контракт є оновлювальним і управляється певною адресою, контролером, на Syscoin L1, блокчейн, до якого розраховується Rollux. wBTC можна депонувати на Rollux через Ethereum, Polygon PoS та Binance Smart Chain. Контролер цієї адреси відповідає за випуск і спалювання токенів, пов'язаних з контрактом wBTC.\n\nКонтракт мосту Rollux L1, який полегшує передачу wBTC з Syscoin на Rollux, може бути оновлений миттєво багатопідписною гаманцем з анонімними підписантами.\n\nКонтракт Rollux L1 розташований на ланцюзі Syscoin NEVM."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Блокчейн Syscoin задовольняє вимоги до доступності даних Rollux",
            "content": "Ланцюг Rollux публікує дані транзакцій у рішеннях доступності даних UTXO-ланцюга Syscoin, [PoDA](https://docs.syscoin.org/docs/tech/poda/). L1 Syscoin є мердж-майнінговим ланцюгом з Bitcoin.\n\nДоступність даних задовольняється за допомогою блобів, що означає, що вузли Syscoin зберігають дані, пов'язані з Rollux, принаймні шість годин після досягнення фінальності. Після цього періоду вони видаляються. PoDA не шардить дані і вимагає, щоб повні вузли зберігали весь вміст блобу протягом певного періоду часу. Принаймні один архівний вузол повинен архівувати повний вміст блобу, щоб забезпечити цілісність історичного стану Rollux.\n\nПісля отримання блобу з Rollux, UTXO-ланцюг підтверджує доступність даних для NEVM-ланцюга.\n\nТільки один непросіяний онлайн-вузол потрібен, щоб відновити весь стан Syscoin та Rollux."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Medium",
            "title": "Rollux експлуатується централізованим секвенсором з можливістю примусового включення до Syscoin L1",
            "content": "Ланцюг Rollux експлуатується централізованим секвенсором. Користувачів можуть цензурувати централізований секвенсор, і ланцюг може зазнати збоїв у доступності, якщо секвенсор зникне."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Medium",
            "title": "Rollux успадковує гарантії фінальності від Syscoin",
            "content": "Секвенсор Rollux забезпечує м'яке підтвердження транзакцій, які врешті-решт підсумовуються та відправляються до Syscoin."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Односторонні виходи до Bitcoin не можливі",
                    "content": "Користувачі не можуть вийти з Rollux до Bitcoin взагалі, оскільки немає мосту; вони повинні спочатку вивести до Syscoin, а потім до Bitcoin. Користувачі не можуть односторонньо вийти з Syscoin за допомогою L1 транзакції Bitcoin. Вони наразі довіряють централізованим операторам для обробки своїх виведень."
                },
                {
                    "title": "Протокол не дозволяє MEV на Bitcoin",
                    "content": "Rollux не передає MEV на L1 Bitcoin. Користувачі довіряють централізованому секвенсору, що він не витягуватиме MEV з їхніх транзакцій."
                },
                {
                    "title": "Альтернативний токен грає роль у безпеці мережі",
                    "content": "Плата за газ і плата за доступність даних Rollux сплачуються в [SYS](https://www.coingecko.com/en/coins/syscoin)."
                },
                {
                    "title": "Платежі та емісія сплачуються майнерам, які мердж-майнять Syscoin",
                    "content": "Плати, пов'язані з доступністю даних Rollux, сплачуються біткоїн-майнерам, які за бажанням мердж-майнять шар доступності даних Rollux, Syscoin."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Користувачі довіряють численним операторам для обробки своїх виведень",
                    "content": "Користувачі довіряють, що централізований пропонент включить їх запит на виведення в останній корінь стану, опублікований на Syscoin L1. Вони також довіряють, що контролер контракту wBTC обробить їх запит на виведення, а майнери Syscoin видобудуть транзакцію спалення на ланцюзі Syscoin."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Докази шахрайства в процесі розробки",
                    "content": "[OP Stack](https://github.com/SYS-Labs/rollux/tree/develop/op-node) ланцюги використовуватимуть інтерактивні докази шахрайства для забезпечення правильності стану. Ця функція наразі в процесі розробки, що означає, що Rollux наразі дозволяє недійсні корені стану."
                },
                {
                    "title": "Мердж-майнінг",
                    "content": "Змішане майнінг є критично важливою частиною механізму консенсусу Syscoin, що дозволяє зв'язок між Bitcoin і Syscoin. По суті, пули BTC-майнінгу додають посилання на блоки Syscoin у завданнях майнінгу, надісланих учасникам. Крім того, оскільки алгоритм майнінгу Syscoin такий же, як і у Bitcoin, витрати енергії мінімальні. Це, у поєднанні з тим, що майнери отримують частину транзакційних зборів та нововиданих токенів SYS від майнінгу блоків Syscoin, створює стимул для забезпечення безпеки як BTC, так і Syscoin."
                },
                {
                    "title": "Сумісний з EVM",
                    "content": "Rollux використовує віртуальну машину, сумісну з EVM. Ethereum Virtual Machine — це програмне забезпечення, відповідальне за виконання смарт-контрактів для ряду блокчейн-систем, а саме мережі Ethereum. Вона використовує Solidity/Vyper як свою мову програмування, яка є домінуючим середовищем для виконання смарт-контрактів у криптовалютній екосистемі. Rollux є сумісним з EVM, що означає, що розробнику з Ethereum буде легше розгорнути свої додатки на Rollux порівняно з іншими середовищами виконання."
                },
                {
                    "title": "Швидші часи блокування",
                    "content": "Rollux наразі виробляє блоки кожні дві секунди, що забезпечує кращий користувацький досвід, ніж використання головної ланцюга Bitcoin."
                },
                {
                    "title": "Дослідження BitVM",
                    "content": "Команда Rollux оголосила про своє намір [розробити](https://x.com/rolluxl2/status/1808176959618228551) міст стилю BitVM. Вони прагнуть побудувати міст з мінімальним рівнем довіри між Syscoin та Bitcoin, який також може підтримувати ланцюг Rollux."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Випадки використання",
            "content": [
                {
                    "title": "Додатки EVM",
                    "content": "Потенційні випадки використання Rollux подібні до інших EVM-базованих сайдчейнів. Розробники можуть розгортати смарт-контракти, які дозволяють такі програми, як протоколи позик і кредитування, стейблкоїни, NFT та інше. Основний, запропонований випадок використання Rollux — діяти як прикладний шар для Bitcoin."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Rollux експлуатується централізованим секвенсором",
                    "content": "Блокчейн Rollux експлуатується централізованим валідатором. Якщо валідатор цензурує користувачів або зникає, користувачі можуть самостійно послідовно виконувати свої транзакції."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Джерело коду",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Імплементація [вузла Rollux](https://github.com/sys-labs/rollux) є відкритою."
                }
            ]
        }
    ]
}
