{
    "slug": "rootstock",
    "title": "Rootstock",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["High", "Medium", "Medium", "Medium"],
    "purpose": "General",
    "btcBridge": "Federated Multisig",
    "settlement": "Offchain",
    "btcLocked": 2757,
    "executionEnv": "Offchain",
    "consensus": "Merge-Mining",
    "nativeToken": "RBTC",
    "feeToken": "RBTC",
    "enshrinedBtc": "RBTC",
    "bitcoinOnly": true,
    "links": [
        "https://rootstock.io/",
        "https://dev.rootstock.io",
        "https://dev.rootstock.io",
        "https://explorer.rsk.co/",
        "https://github.com/rsksmart",
        "https://twitter.com/rootstock_io"
    ],
    "description": "Rootstock — це об'єднана майнінгова, EVM-сумісна бокова ланцюг Bitcoin. Як об'єднана мережа, майнери Bitcoin можуть одночасно майнити консенсус Rootstock. Мережа не забезпечується іншим токеном. Як EVM-сумісна мережа, розробники можуть розгортати контракти Solidity та інші EVM-сумісні смарт-контракти з довільною логікою, створюючи нові додатки для BTC. Rootstock має вбудований крос-ланцюговий актив BTC під назвою ''Smart Bitcoin'' (RBTC), який прив'язаний 1:1 до BTC і забезпечується дозволеною федерацією мульти-підписів.",
    "riskAnalysis": [
        {
            "category": "Bridge Security",
            "score": 0,
            "tier": "High",
            "title": "Для зберігання BTC користувачів використовується федеративний мульти-підпис, відомий як Powpeg",
            "content": "Міст між Bitcoin і Rootstock забезпечується федеративним мульти-підписом 5 з 9, відомим як Powpeg (Proof of Work Peg). Ідентичності суб'єктів, які беруть участь у Powpeg, відомі публічно. Користувачі довіряють операторам Powpeg зберігати свої кошти. Дізнайтеся більше про Powpeg у розділі технологій нижче."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Дані зберігаються і надаються через вузли Rootstock. Запуск вузла є бездозвільним",
            "content": "Дані для оновлень стану Rootstock зберігаються на блокчейні Rootstock. Кожен може запустити вузол Rootstock і перевірити стан блокчейну Rootstock. Якщо хоча б один повний вузол Rootstock не буде очищено, користувачі зможуть відновити всю історію та стан блокчейну Rootstock."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Medium",
            "title": "Будь-який майнер Bitcoin може брати участь в об'єднаному майнінгу Rootstock",
            "content": "Виробництво блоків є бездозвільним. Будь-хто, хто готовий і має можливість об'єднаного майнінгу Rootstock і Bitcoin, може виробляти блоки Rootstock і отримувати винагороди. Якщо зацікавлені сторони не мають достатньої потужності для конкурентоспроможного сольного майнінгу, вони можуть приєднатися до майнінгового пулу, що підтримує об'єднаний майнінг Rootstock."
        },
        {
            "category": "Finality Guarantees",
            "score": 0,
            "tier": "Medium",
            "title": "Гарантії фіналізації надаються механізмом консенсусу Rootstock",
            "content": "Не існує примусу Bitcoin для переходів стану Rootstock. Повні вузли Rootstock приймають блоки, запропоновані майнерами Rootstock."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "Rootstock дозволяє майнерам Bitcoin об'єднано майнити Rootstock",
                    "content": "Rootstock непрямо успадковує безпеку від учасників консенсусу Bitcoin. Майнери Bitcoin можуть бездозвільно приєднуватися до об'єднаного майнінгу Rootstock і забезпечувати мережу."
                },
                {
                    "title": "Інший токен не використовується для забезпечення мережі",
                    "content": "Повна винагорода за блок виплачується в RBTC. Її розподіл: 20% до Rootstock Labs, 0.8% до федерації Powpeg, 79.2% до майнерів. Майнери отримують винагороди лише з комісій за транзакції. Комісії, призначені для федерації і майнерів, слугують для стимулювання подальшої безпеки, тоді як 20%, призначені для Rootstock Labs, використовуються для обслуговування та розвитку мережі."
                },
                {
                    "title": "MEV не впроваджується в Bitcoin, але майнери Bitcoin можуть витягувати MEV бокової ланцюги",
                    "content": "Rootstock не витікає MEV безпосередньо в Bitcoin. Через особливості середовища виконання Rootstock, майнери Bitcoin можуть скористатися можливостями для витягнення MEV, якщо мережа зазнає високої активності."
                },
                {
                    "title": "Об'єднаний майнінг дозволяє майнерам Bitcoin заробляти більше комісій",
                    "content": "Rootstock непрямо сприяє бюджету безпеки Bitcoin, надаючи майнерам Bitcoin ексклюзивну можливість заробляти доходи від комісій через об'єднаний майнінг."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технологія",
            "content": [
                {
                    "title": "Об'єднаний майнінг",
                    "content": "Об'єднаний майнінг є важливою частиною механізму консенсусу Rootstock, що дозволяє з'єднання між Bitcoin і Rootstock. По суті, майнінгові пулу BTC додають посилання на блоки Rootstock в робочі завдання, надіслані учасникам майнінгу. Крім того, оскільки алгоритм майнінгу Rootstock є таким же, як у Bitcoin, енергетичні витрати практично не збільшуються. Це разом з тим, що майнери отримують частину комісій за транзакції від майнінгу блоків Rootstock, створює інcentiv для забезпечення безпеки як BTC, так і Rootstock.\n\nВ даний час більше 50% хешрейту Bitcoin бере участь в об'єднаному майнінгу Rootstock. Rootstock Labs вказує на три фази росту об'єднаного майнінгу: початкова фаза (<30% хешрейту BTC), стабільна фаза (60% ≥ Rootstock ≥ 30%), та зріла фаза (≥60%). В даний час Rootstock перебуває у своїй стабільній фазі.\n\nЩоб виплатити майнерам, кожен блок виконує Смарт-контракт Менеджера Винагороди (REMASC). Контракт веде облік балансу винагороди, який змінює свою вартість під час виробництва нових блоків. Коли блок досягає зрілості, відповідні частини винагороди розподіляються згідно з правилами, визначеними REMASC."
                },
                {
                    "title": "Powpeg",
                    "content": "Powpeg працює завдяки спеціальним вузлам, відомим як функціонери Powpeg. Функціонери Powpeg: BlockVenture, Collider, Constata, Luxor, MyCointainer, pNetwork, Rootstock Labs, Sovryn та Xapo.\n\nКожен функціонер експлуатує вузол Powpeg. Вузол Powpeg поєднує спеціалізований повний вузол Rootstock з модулем апаратної безпеки (PowHSM) для Proof of Work. PowHSM - це апаратний пристрій, призначений для усунення людського контролю над приватними ключами Bitcoin, які використовуються для підписання транзакцій Powpeg. Оператори PowHSM не можуть вручну підписувати транзакції, витягувати приватні ключі або виконувати будь-які інші функції з приватними ключами. Прошивка PowHSM є відкритим кодом і доступна в репозиторії Rootstock на GitHub. Оператори PowHSM можуть бути публічно перевірені за допомогою віддаленої атестації.\n\nЗапити користувачів на зняття BTC з моста Powpeg повинні бути схвалені більшістю функціонерів Powpeg. Якщо PowHSM функціонера працює, то він автоматично підпише транзакцію на зняття після того, як запит на зняття досягне достатньої кількості підтверджень на блокчейні Rootstock.\n\nBTC, утримуваний на мосту Powpeg, може бути вкрадений, якщо більшість пристроїв PowHSM зламані.\n\nКрім того, Powpeg використовує механізм надзвичайного часу з мульти-підписом 3 з 4 як запобіжний захід проти можливих збоїв пристроїв PowHSM або зовнішнього втручання. Надзвичайний мульти-підпис автоматично отримує право витрачати кошти на мосту Powpeg, якщо більшість пристроїв PowHSM не відповідають протягом року. Підписанти надзвичайного мульти-підпису: Rootstock Labs, MoneyOnChain, Jameson Lopp та Adrian Eidelman. У разі надзвичайної ситуації ці підписанти оцінять ситуацію та координуватимуть повернення коштів.\n\nBTC, утримуваний у надзвичайному мульти-підпису, може бути втраченим або вкраденим, якщо більшість підписантів надзвичайного мульти-підпису зламані.\n\nЯкщо BTC, утримуваний на мосту Powpeg (або у надзвичайному мульти-підпису, якщо процедура надзвичайного мульти-підпису була активована), буде втрачено або вкрадено, користувачі не зможуть конвертувати RBTC у BTC та вийти з моста.\n\nЩоб потенційно покращити довіру до моста Bitcoin Rootstock, Rootstock Labs фінансує дослідження BitVMX, протоколу, який може бути використаний для розробки довірчо мінімізованого федеративного моста Bitcoin 1 з N."
                },
                {
                    "title": "Віртуальна машина Ethereum",
                    "content": "Rootstock використовує модифіковану версію Віртуальної машини Ethereum (EVM), яку називає Віртуальною машиною Rootstock (RVM). EVM — це виконувальне середовище з повною потужністю Тюрінга, розроблене для Ethereum та прийняте різними іншими мережами. Solidity є основною мовою програмування, що використовується для розробки смарт-контрактів в EVM. Solidity та EVM є домінуючими мовою та середовищем для смарт-контрактів в більш широкій криптовалютній екосистемі відповідно. Смарт-контракти, створені для EVM, безпосередньо сумісні з RVM. RVM є EVM-сумісною як на рівні байт-коду, так і на рівні операційного коду, і може взаємодіяти з інструментами для розробників Ethereum. RVM використовує RBTC як витрати на газ для виконання смарт-контрактів."
                },
                {
                    "title": "Швидші часи блокування",
                    "content": "Rootstock досягає підтвердження блоку приблизно кожні 30 секунд."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Випадки використання",
            "content": [
                {
                    "title": "Децентралізовані фінанси",
                    "content": "Завдяки низьким комісіям та середовищу виконання смарт-контрактів Rootstock розроблено як дружнє до застосувань екосистему. Вона містить кілька додатків, які є фундаментальними для розвитку здорового сектора DeFi: Sovryn (кредитування), Uniswap (DEX) та MoneyOnChain (стейблкоїни)."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "Будь-який майнер Bitcoin може об'єднано майнити Rootstock",
                    "content": "Виробництво блоків є бездозвільним. Будь-хто, хто готовий до об'єднаного майнінгу, може виробляти блоки і отримувати винагороди. Якщо зацікавлені сторони не мають достатнього капіталу для конкурентоспроможного сольного майнінгу, вони можуть приєднатися до майнінгового пулу, що підтримує об'єднаний майнінг."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Користувачі довіряють дозволеним операторам обробляти свої зняття",
                    "content": "Виведення наразі контролюється федеративною групою підписантів. Користувачі повинні довіряти, що коли вони вносять BTC на блокчейн Rootstock, підписанти не зговоряться і не вкрадуть їх BTC. Дізнайтеся більше про мульти-підпис Powpeg у розділі Знання."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Джерельний код",
            "content": [
                {
                    "title": "Код є відкритим",
                    "content": "Весь код, пов'язаний з проектом Rootstock, є відкритим."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Портал розробника Rootstock](https://dev.rootstock.io/)\n[Білий папір Rootstock](https://rootstock.io/static/a79b27d4889409602174df4710102056/RS-whitepaper.pdf)\n[Документація Powpeg](https://dev.rootstock.io/rsk/architecture/powpeg/)\n[Віддалена атестація Powpeg](https://rootstock.io/powpeg/)"
                }
            ]
        }
    ]
}
