{
    "slug": "satoshivm",
    "title": "SatoshiVM",
    "layerType": "Permissioned chain",
    "live": "Mainnet",
    "staking": false,
    "bridge": false,
    "underReview": "no",
    "riskFactors": ["Unverified", "Unverified", "Unverified", "Unverified"],
    "purpose": "BTC Applications",
    "btcBridge": "Third Party Bridge",
    "settlement": "Offchain",
    "btcLocked": 0,
    "executionEnv": "Offchain",
    "consensus": "Permissioned chain",
    "nativeToken": "SAVM",
    "feeToken": "WBTC",
    "enshrinedBtc": "WBTC",
    "bitcoinOnly": false,
    "links": [
        "https://satoshivm.io/",
        "https://satoshivm.io/",
        "https://docs.satoshivm.io/",
        "https://svmscan.io/",
        "https://github.com/SatoshiVM",
        "https://x.com/SatoshiVM"
    ],
    "description": "SatoshiVM — це дозволена мережа, побудована на програмному забезпеченні Frontier. Її рідний токен є ERC-20 на Ethereum.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "Unverified",
            "title": "Двосторонній пег управляється третьою стороною",
            "content": "Біткоїн-гаманець SatoshiVM для депозитів мосту управляється мережею Bool. Як мережа Bool, так і інтерфейси SatoshiVM для мосту вносять кошти на ту ж адресу Bitcoin. Контракт мосту Bitcoin на SatoshiVM може бути оновлений єдиним EOA акаунтом."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Unverified",
            "title": "Набір дозволених валідаторів задовольняє вимогу доступності даних",
            "content": "Валідуючі вузли SatoshiVM також задовольняють вимогу доступності даних. Програмне забезпечення вузла не є відкритим, тому користувачі не можуть запустити повний вузол і перевірити стан SatoshiVM."
        },
        {
            "category": "Живучість і опір перезапису",
            "score": 0,
            "tier": "Unverified",
            "title": "Мережа управляється набором дозволених операторів",
            "content": "Експлорер SatoshiVM в даний час показує 4 активних валідатора, які пропонують блоки. Ідентичності цих валідаторів невідомі."
        },
        {
            "category": "State Validation",
            "score": 0,
            "tier": "Unverified",
            "title": "Гарантії розрахунку надаються консенсусом SatoshiVM",
            "content": "Фіналізація гарантується набором валідаторів SatoshiVM. У нього немає живих доказів шахрайства, які можна подати на Bitcoin."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Безпека Bitcoin",
            "content": [
                {
                    "title": "SatoshiVM не успадковує безпеки від Bitcoin",
                    "content": "SatoshiVM не має відношення до основної мережі Bitcoin."
                },
                {
                    "title": "SatoshiVM не витікає MEV до Bitcoin",
                    "content": "SatoshiVM не витікає MEV до основної мережі Bitcoin. Користувачі довіряють валідаторам, щоб не перетасовувати їх транзакції для витягування MEV."
                },
                {
                    "title": "Альтернативний токен наразі не потрібен для безпеки мережі",
                    "content": "Комісії за газ оплачуються в обгорнутому BTC. SatoshiVM випустила токен на Ethereum, який наразі не відіграє жодної ролі в мережі."
                },
                {
                    "title": "Депозити мосту та зняття коштів сплачують комісії майнерам",
                    "content": "Комісії за транзакції сплачуються майнерам Bitcoin, коли користувачі вносять та знімають кошти з мосту BounceBit. Нагороди за блоки на BounceBit розподіляються валідаторам BounceBit."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Програмне забезпечення вузлів основної мережі не є відкритим",
            "content": [
                {
                    "title": "📝 Проект наразі не підлягає перегляду",
                    "content": "Програмне забезпечення вузлів основної мережі не є відкритим. Користувачі довіряють інформації в документації SatoshiVM, оскільки не можуть запустити вузол і перевірити поточний стан мережі та її учасників."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Виведення",
            "content": [
                {
                    "title": "Користувачі довіряють сторонньому постачальнику мосту для обробки виведень",
                    "content": "Користувачі довіряють мережі Bool, щоб звільнити їхні кошти на основній мережі Bitcoin для виведень."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Оператор",
            "content": [
                {
                    "title": "SatoshiVM наразі управляється закритим набором валідаторів",
                    "content": "Експлорер SatoshiVM показує, що він управляється невеликою кількістю валідаторів."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Вихідний код",
            "content": [
                {
                    "title": "Код не є відкритим",
                    "content": "Основна реалізація вузла BounceBit наразі не є відкритою."
                }
            ]
        }
    ]
}
