{
    "slug": "starknet",
    "title": "Starknet",
    "layerType": "Rollup",
    "live": "Proposed",
    "staking": false,
    "bridge": false,
    "underReview": "yes",
    "riskFactors": ["", "", "", ""],
    "purpose": "-",
    "btcBridge": "-",
    "settlement": "-",
    "btcLocked": 0,
    "executionEnv": "-",
    "consensus": "-",
    "nativeToken": "-",
    "feeToken": "-",
    "enshrinedBtc": "-",
    "bitcoinOnly": false,
    "links": [
        "https://www.starknet.io/",
        "https://www.starknet.io/",
        "https://docs.btcwild.life/",
        "https://github.com/Bitcoin-Wildlife-Sanctuary/bitcoin-circle-stark",
        "https://github.com/Bitcoin-Wildlife-Sanctuary/bitcoin-circle-stark",
        "https://twitter.com/starknet"
    ],
    "description": "Starknet — це валідний роллап на Ethereum. Вони пропонують мульти-розрахунковий роллап, який буде проводити розрахунки на Bitcoin та Ethereum, якщо OP_CAT буде активовано. Наразі вони розробляють STARK верифікатор безпосередньо в Script з OP_CAT на signet.",
    "riskAnalysis": [
        {
            "category": "Unilateral Exits",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        },
        {
            "category": "Block Production",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        },
        {
            "category": "State Validation",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        }
    ],
    "sections": [
        {
            "id": "disclaimer",
            "title": "Відмова від відповідальності",
            "content": [
                {
                    "title": "😇 Ця сторінка не пройшла формальний процес перевірки",
                    "content": "Ця сторінка надає загальну оцінку запропонованого дизайну Layer 2, що потребує м'якого хардфорку. Цю сторінку не слід розглядати як оцінку ризиків."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Технології",
            "content": [
                {
                    "title": "Рекурсивні угоди",
                    "content": "OP_CAT — це запропонований опкод, який може активувати два примітиви, що підтримують покращені протоколи мостів для проектів, таких як Starknet. Перший дозволяє користувачам попередньо визначити умови витрат для окремих UTXO. Другий примітив — це верифікація гілок Меркле-дерева. Це дозволить постійно додавати хеші даних до Меркле-дерева, яке безперервно базується на обмеженнях, встановлених попередніми транзакціями.\n\nСтворюючи безперервний ланцюг обмежень для ряду транзакцій, ви дозволяєте рекурсивні угоди. Рекурсивні угоди дозволяють користувачам блокувати кошти в груповому UTXO, який може постійно додавати нові обмеження на основі нових депозитів користувачів і додатково впроваджувати зміни для часткових виведень, які повинні повертатися до скрипта роллапу."
                },
                {
                    "title": "STARK верифікатор з OP_CAT",
                    "content": "Проблема, що виникає через спільні UTXO, особливо для L2, полягає в тому, що вам потрібна надійна сторона для перевірки оффчейн переходів стану, щоб дозволити користувачам виводити кошти відносно їх оновленого балансу. Команда StarkWare (основні розробники Starknet) працює з L2 Iterative Ventures над розробкою STARK верифікатора безпосередньо в Bitcoin Script з OP_CAT.\n\nУ роллапах, різниці стану стискаються разом і надсилаються на Bitcoin L1 з відповідним доказом дійсності, яке підтверджує, що перехід стану було виконано правильно. Starknet пропонує механізм, який буде верифікувати ці STARK докази, підтверджуючи дійсність переходів стану L2. Верифікація оффчейн переходів стану безпосередньо в Script дозволила б спільним UTXO обробляти виведення користувачів на основі їх оновлених балансів. Рекурсивні угоди та ончейн STARK верифікація створили б програми мостів з мінімізацією довіри для L2."
                },
                {
                    "title": "Cairo Віртуальна Машина",
                    "content": "Cairo — це віртуальна машина з zk-доказовими виконаннями функцій за замовчуванням. Віртуальна машина Cairo використовує три мови: Cairo, ергономічну, основану на Rust мову для взаємодії з користувачами; SIERRA, безпечне проміжне подання, на яке Cairo компілюється, що уникає потенційно непідтверджуваних ситуацій, таких як твердження або ділення на нуль, що робить виконання функцій детермінованими; і нарешті CASM, низькорівневий доказовий код, до якого компілюється SIERRA.\n\nВіртуальна машина Cairo забезпечує, що всі виконання функцій можуть бути підтверджені, при цьому пропонуючи повністю виразне середовище, що відповідає принципам Turing-complete. Turing-completeness Cairo дозволяє йому емуляцію інших віртуальних машин, які можуть успадковувати доказові характеристики на Starknet. Ethereum Virtual Machine (EVM) є одним з таких прикладів з Kakarot ZK-EVM, що дозволяє виконувати та підтверджувати транзакції EVM на Starknet."
                },
                {
                    "title": "SHARP і Stwo",
                    "content": "Starknet, а також різні роллапи, побудовані на StarkEx, використовують спільну систему доказування для генерації доказів, звану SHARP. Перевага спільного доказування полягає в економії витрат. Конкретно, SHARP використовує побудований StarkWare провідник Stwo, ітерацію провідника STONE."
                },
                {
                    "title": "Послідовник Madara",
                    "content": "Madara — це послідовник, побудований для L3 на базі Starknet. Madara дозволяє L3 використовувати систему SHARP, з перевіреними доказами на Starknet/Ethereum, пропонуючи при цьому гнучкість DA, оскільки L3 можуть вибирати альтернативні шари DA, наприклад, Celestia."
                },
                {
                    "title": "Модель DA Volition",
                    "content": "Starknet досліджує гібридне рішення DA, відоме як volition. Модель volition пропонує кілька варіантів DA, таких як Ethereum blobspace, Starknet DA або сторонні рішення, такі як Celestia. Важливо, що ця модель дозволить користувачам вибирати їх переважне рішення DA для кожної транзакції. Транзакції з високою цінністю за байт віддаватимуть перевагу Ethereum DA, тоді як транзакції з низькою цінністю за байт логічно використовуватимуть альтернативну DA. Це особливо важливо для переходу до Bitcoin, оскільки DA Bitcoin значно більш обмежена, ніж Ethereum blobspace."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Додаткові міркування",
            "content": [
                {
                    "title": "Starknet є Роллапом Stage 0 на Ethereum",
                    "content": "Роллап Starknet на Ethereum, який додатково буде проводити розрахунки на Bitcoin, якщо OP_CAT буде активовано, є Роллапом Stage 0 згідно з фреймворком етапів L2Beat.\n\nОсновні проблеми з роллапом Starknet на Ethereum полягають у наступному:\n\n1️⃣ Якщо централізований послідовник (валидатор Starknet) зникне або буде цензурити користувачів, він не зможе примусово включити транзакцію в L1.\n\n2️⃣ Якщо централізований пропонент зникне або буде цензурити користувачів, він не зможе примусово здійснити виведення з Starknet до Layer 1.\n\n3️⃣ Смарт-контракт Starknet на L1 є відразу ж оновлювальним, і користувачі не можуть вивести свої кошти, якщо буде здійснено злочинне оновлення. Кошти можуть бути вкрадені, якщо буде впроваджено злочинне оновлення контракту."
                },
                {
                    "title": "Starknet, ймовірно, використовуватиме зовнішній послідовник, таким чином зменшуючи витік MEV до L1",
                    "content": "Занепокоєння щодо роллапів на Bitcoin полягає в потенційній появі MEV. Якщо майнери Bitcoin матимуть ексклюзивні права на порядок транзакцій роллапу, особливо тих, що мають більш виразні середовища виконання, майнери матимуть можливості витягувати MEV через різні механізми. Це відомо як засноване на послідовності. Якщо роллапи Bitcoin впровадять засноване на послідовності, майнери можуть інвестувати в більш складну інфраструктуру будування блоків, щоб витягувати більш шкідливий MEV за більший прибуток. Це може підвищити бар'єр входу для майнінгу і потенційно ввести централізуючі тиски.\n\nStarknet наразі послідовно (упорядковано) ведеться централізованим послідовником. Спільнота Starknet також досліджувала децентралізований послідовник, але зосередилася на альтернативних консенсусних протоколах, що виконують цю роль (наприклад, CometBFT).\n\nЯкщо буде використано альтернативний консенсусний механізм для децентралізації послідовника, порівняно з заснованим на послідовності, тоді MEV малоймовірно витече до майнерів Bitcoin."
                }
            ]
        },
        {
            "id": "knowledgeBits",
            "title": "Знання",
            "content": [
                {
                    "title": "Дізнайтеся більше",
                    "content": "[Дізнайтеся більше про OP_CAT](https://opcat.wtf/)\n[Огляд L2Beat про Ethereum Starknet](https://l2beat.com/scaling/projects/starknet)"
                }
            ]
        }
    ]
}
