{
    "slug": "zulu",
    "title": "Zulu",
    "layerType": "Суверенний ролап",
    "live": "Тестова мережа",
    "staking": false,
    "bridge": false,
    "underReview": "так",
    "riskFactors": ["", "", "", ""],
    "purpose": "Загальний",
    "btcBridge": "-",
    "settlement": "-",
    "btcLocked": 0,
    "executionEnv": "-",
    "consensus": "-",
    "nativeToken": "-",
    "feeToken": "-",
    "enshrinedBtc": "-",
    "bitcoinOnly": false,
    "links": [
        "https://zulunetwork.io/",
        "https://docs.zulunetwork.io/",
        "https://docs.zulunetwork.io/",
        "https://testnet.zuluscan.io/",
        "https://github.com/zulu-network",
        "https://x.com/zulu_network"
    ],
    "description": "Zulu Network прагне стати Bitvimium на Bitcoin, що дозволяє розробникам запускати dApps на обох шарах: EVM (ZKSync ZK Stack L2) та UTXO (кастомізований ZKVM L3). Мережа Zulu працює над програмою мосту з мінімізацією довіри і використовуватиме унікальний гібридний механізм видобутку PoS / PoW.",
    "riskAnalysis": [
        {
            "category": "Односторонні виходи",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        },
        {
            "category": "Доступність даних",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        },
        {
            "category": "Виробництво блоків",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        },
        {
            "category": "Валідація стану",
            "score": 0,
            "tier": "",
            "title": "",
            "content": ""
        }
    ],
    "sections": [
        {
            "id": "technology",
            "title": "Запропоновані технології",
            "content": [
                {
                    "title": "Для забезпечення правильності стану використовуватимуться докази дійсності",
                    "content": "Кожен перехід стану повинен містити доказ дійсності, який підтверджує, що виконання було виконано правильно для серії транзакцій користувачів. Якщо доказ містить недійсний перехід стану, будь-хто може подати доказ шахрайства, щоб оскаржити перехід стану. Докази дійсності будуть надсилатися через децентралізовану мережу перевіряючих, економічно захищених через Babylon, перед поданням до ZK перевіряча BitVM."
                },
                {
                    "title": "Використовується криптографія з нульовими знаннями",
                    "content": "Перехід станів доводиться через криптографічні докази, відомі як zk-докази. Якщо реалізація криптографії була виконана неправильно, кошти користувачів можуть бути під загрозою."
                },
                {
                    "title": "Мережа покладеться на окремий DA Layer для доступності даних",
                    "content": "Стан Zulu може бути реконструйований на основі даних, які зберігаються на окремому DA Layer. Останній корінь стану ланцюга буде записано в блокчейн Bitcoin."
                },
                {
                    "title": "Zulu Network працює над програмою мосту в стилі BitVM",
                    "content": "Zulu Network наразі працює над дизайном мосту з мінімізацією довіри. У їхньому дизайні користувачі будуть знімати свої кошти через атомарні свопи з суб'єктів, відомих як постачальники ліквідності (LP), які перенесли активи до ролапу, використовуючи реалізацію двостороннього зв’язку BitVM. Зняття BTC та/або біткойн-активів LP з ролапу не є бездостатнім. LP повинні довіряти, що один з будь-якої кількості перевіряючих BitVM у валідаційному мосту діє чесно, щоб обробити їхнє зняття."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Джерельний код",
            "content": [
                {
                    "title": "Базовий код та відкритий вихідний код",
                    "content": "Частина програмного забезпечення наразі є відкритим вихідним кодом і доступна, а решта буде поступово відкриватися."
                }
            ]
        }
    ]
}
