{
    "slug": "fedimint",
    "title": "Fedimint",
    "infrastructureType": "Federated Applications",
    "live": "Mainnet",
    "underReview": "yes",
    "riskFactors": ["High", "High"],
    "bitcoinSecurity": "No",
    "nativeToken": "None",
    "purpose": "Private payments",
    "associatedLayers": "-",
    "bitcoinOnly": true,
    "links": [
        "https://fedimint.org",
        "https://fedimint.org",
        "https://fedimint.org/docs/intro",
        "https://fedimint.org",
        "https://github.com/fedimint",
        "https://twitter.com/fedimint"
    ],
    "description": "Fedimint is a module-based open source framework for building federated applications, which can be collaboratively managed by a group of trusted entities.\n\nThe main application that is in production today is an open source federated Ecash mint. The construction of a Fedimint sees users lock their BTC into a federation's multi-sig, and receive a bearer Ecash IOU in return. The concept improves on the currently predominant form of third party custody, as the user has a socially known and trusted entity guarding their BTC; a concept that is termed “second party custody”.",
    "sections": [
        {
            "id": "riskbits",
            "title": "Risk Bits",
            "content": [
                {
                    "title": "Users do not have custody of their BTC and trust guardians to process withdrawals.",
                    "content": "Users deposit BTC into a multisig to interact with a Fedimint. Fedimints do not enable unilateral exits. Users explicitly trust the signers, known as guardians, of the federations’ multisig to not steal their funds. Stealing users’ funds needs a majority (e.g. 3/5 or 7/13) of guardians to collude. This is why “knowing your federation” is a key requirement when choosing second party custody."
                },
                {
                    "title": "More information coming soon.",
                    "content": "Our review of Fedimint will be available soon."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://fedimint.org",
            "displayText": "Fedimint documentation site covering technological components and use cases."
        },
        {
            "url": "https://www.fedi.xyz/product",
            "displayText": "Fedi offers a Fedimint wallet and shows how a Fedimint would work in practice."
        },
        {
            "url": "https://fedimint.org/docs/category/frequently-asked-questions",
            "displayText": "Fedimint's FAQs answer frequently asked questions."
        }
    ]
}
