{
    "slug": "bevm",
    "title": "BEVM",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "underReview": "no",
    "riskFactors": ["High", "Medium", "High", "High"],
    "purpose": "General",
    "btcBridge": "Federated Multisig",
    "settlement": "Offchain",
    "btcLocked": 116,
    "executionEnv": "Offchain",
    "consensus": "Proof-of-Stake",
    "nativeToken": "BEVM",
    "feeToken": "WBTC",
    "enshrinedBtc": "XBTC",
    "links": [
        "https://www.bevm.io/",
        "https://www.bevm.io/",
        "https://documents.bevm.io/",
        "https://scan.bevm.io/",
        "https://github.com/btclayer2/BEVM",
        "https://twitter.com/BTCLayer2"
    ],
    "description": "BEVM is an EVM-compatible sidechain, built on substrate, designed for Bitcoin. On the BEVM chain, the BTC is held in custody by a federated multi-signature address. Its goal is to make it easier for Bitcoin to be seamlessly integrated into the Ethereum ecosystem.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "Users trust a federation with the custody of their BTC",
            "content": "On the BEVM chain, BTC is locked in a multi signature address federated by up to 15 trustees. These trustees are the real custodians of BTC as they hold the multi-signature private keys.\n\nAt present, there are 17 validators on the BEVM chain who are responsible for verifying transactions. These validators are selected based on specific criteria defined by the BEVM governance model. These permissioned validators are responsible for selecting the trustees who will custody Bitcoin assets. Users trust that the trustees will not steal their BTC."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Data is stored on BEVM archive nodes. Anyone can run BEVM archive node",
            "content": "An archive node is responsible for preserving the historical blockchain data. Users can run their own archive node and access the data at any time by utilizing the node as an RPC. Public endpoints deploy archival nodes to facilitate blockchain data to the users."
        },
        {
            "category": "Network operators",
            "score": 0,
            "tier": "High",
            "title": "BEVM network is operated by permissioned validators",
            "content": "On a BEVM chain, a block is produced every 6s and is finalized by achieving consensus among permissioned validators. Only the permissioned validators have the rights to produce the block and include the transactions in the block. Consequently, users trust the permissioned validators that they will include their transactions in the block without censoring them.\n\nBEVM governance, determined delegating tokens to validators, is currently not live. This sees a permissioned validator set operate the network."
        },
        {
            "category": "Settlement assurance",
            "score": 0,
            "tier": "High",
            "title": "Transactions on BEVM chain are finalized by the permissioned validators",
            "content": "Permissioned validators on BEVM chain verify and include the transactions in BEVM block. Validators participate in a proof of stake consensus mechanism and see blocks produced, and finalized, every six seconds.\n\n2/3 of the validators need to agree on a state transition prior to it being finalized. This process sees no guarantees provided via Bitcoin consensus."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Bitcoin Security",
            "content": [
                {
                "title": "Users cannot unilaterally exit",
                "content": "Users cannot unilaterally exit from the BEVM chain with an L1 Bitcoin transaction."
                },
            {
                "title": "No base layer MEV, but users trust validators to not reorder their transactions",
                "content": "Base layer MEV does not exist. Users, on the BEVM chain, trust that the validators don’t reorder their transactions. Additionally, Validator elections take place every 1 hour."
              },
            {
                "title": "The BEVM token is used to incentivize network participants",
                "content": "BEVM token has been issued. BEVM tokens will potentially be used to incentivize the active and honest validators."
              },
            {
                "title": "The BEVM network does not pay fees to Bitcoin miners",
                "content": "BEVM does not pay fees to Bitcoin miners."
              }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Withdrawals",
            "content": [
                {
                    "title": "Users trust the trustees on BEVM chain to process their withdrawals",
                    "content": "Upon the initiation of a withdrawal transaction,  trustees sign the withdrawal and if the number of signatures reaches the multi-signature requirement, the transaction will be broadcast to the Bitcoin Network."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Technology",
            "content": [
                {
                    "title": "Taproot-related technologies",
                    "content": "Proposedly, every trustee in the BEVM system has a Bitcoin private key for the Schnorr signature, allowing for effective signature aggregation. The Musig2 multi-signature system generates an aggregated public key that joins to construct a huge MAST (Merkle Abstract Syntax Tree).\n\nFollowing the generation of the MAST tree's root hash value, the trustee carries out Bitcoin transfer and inscription operations to the threshold signature address produced by the MAST tree, fulfilling the purpose of the BTC mainnet's data submission to the BEVM network."
                },
                {
                    "title": "BFT PoS consensus network",
                    "content": "In BEVM, validators participate in a hybrid consensus mechanism. Hybrid consensus separates block production mechanism from block finalization. For block authoring, BABE consensus is run between the validators and it selects the block producers. In parallel, validators execute GRANDPA BFT consensus to finalize the block. Once more than ⅔ of validators agree on the new block, the chain containing a new block is finalized."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Use Cases",
            "content": [
                {
                    "title": "EVM compatibility",
                    "content": "BEVM facilitates the creation of smart contracts and dApps on the Bitcoin Network while integrating with EVM and using BTC as gas to enhance interoperability between the two networks."
                },
                {
                    "title": "Cross-chain processing",
                    "content": "BEVM employs Taproot technology and PoS consensus nodes to securely manage cross-chain transactions between BEVM and the Bitcoin mainnet."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Source Code",
            "content": [
                {
                    "title": "Code is open-source",
                    "content": "BEVM’s node software is open source."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://www.bevm.io/",
            "displayText": "BEVM Website"
        }
    ]
}
