{
    "slug": "bsquared",
    "title": "Bsquared Network",
    "layerType": "Sidechain Rollup",
    "live": "Mainnet",
    "underReview": "no",
    "riskFactors": ["Unverified", "High", "High", "High"],
    "purpose": "General",
    "btcBridge": "Federated Multi-sig",
    "settlement": "Offchain",
    "btcLocked": "-",
    "executionEnv": "Offchain",
    "consensus": "Federateded Sidechain",
    "nativeToken": "BSQ",
    "feeToken": "WBTC",
    "enshrinedBtc": "WBTC",
    "bitcoinOnly": false,
    "links": [
        "https://www.bsquared.network/",
        "https://www.bsquared.network/",
        "https://docs.bsquared.network/",
        "https://explorer.bsquared.network/",
        "https://github.com/b2network",
        "https://twitter.com/BSquaredNetwork"
    ],
    "description": "The current Bsquared Network mainnet consists of two different chains. The parent chain is a fork of an EVM implementation on Tendermint, and has three permissioned validators operating the network. The rollup chain is a fork of Polygon zkEVM that settles on the Bsquared parent chain.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "Users deposit funds into a MPC protocl managed by Bsquared Network and a custodian",
            "content": "When users deposit funds into Bsquared, they deposit funds into a MPC wallet managed by the Bsquared Network team and Cobo, a institutional custodian. Information on how many signers participate in this MPC scheme is not available. Bsquared has stated that more players are being added into this custody scheme."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "High",
            "title": "DA requirement is fulfilled by three permissioned validators",
            "content": "Sequencer batches are posted to the Bsquared Network L1. This network consists of a permissioned validator set who is responsible for making the data readily available."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "High",
            "title": "Both the rollup chain and parent chain are run by federated, centralized parties",
            "content": "Bsquared Network’s Polygon zkEVM implementation has a single sequencer that posts sequencer batches to its network of three L1 validators. In the event of censorship, users cannot force an exit to Bitcoin."
        },
        {
            "category": "Settlement Assurance",
            "score": 0,
            "tier": "High",
            "title": "No settlement assurances inherited from Bitcoin",
            "content": "Bsquared receives no settlement assurances from Bitcoin. Settlement is finalized by a group of three, federated validators who verify a validity proof submitted by the Bsquared Network zkEVM prover."
        }
    ],
    "sections": [
        {
            "id": "additionalconsiderations",
            "title": "Additional Considerations",
            "content": [
                {
                    "title": "All facets of Bsquared Network are managed by a centralized operator. Some code is not open-source.",
                    "content": "Bsquared Network is operated by permissioned validators on its L1 chain and its L2 chain. These validators are likely managed by the company building Bsquared Network. Code, and documentation, related to Bsquared Network's two-way pegs is not open-source. Users are trusting centralized parties to not steal their funds, extract MEV, or censor their transactions."
                }
            ]
        },
        {
            "id": "bitcoinsecurity",
            "title": "Bitcoin Security",
            "content": [
                {
                    "title": "Unilateral exits not possible",
                    "content": "Users cannot unilaterally exit from Bsquared Network. Users trust a centralized bridge program with the custody of their Bitcoin."
                },
                {
                    "title": "The protocol does not enable MEV on Bitcoin. Users trust a centralized operator to not reorder their transactions.",
                    "content": "Since Bsquared has no relationship with Bitcoin miners, it does not introduce MEV on the Bitcoin base layer. Users trust that the Bsquared Network zkEVM sequencer will not reorder transactions to extract MEV."
                },
                {
                    "title": "An alternative token exists, but is not being used for network security",
                    "content": "Bsquared Network has issued a token with the ticker BSQ on its L1 protocol. It has a supply of 210,000,000. One address owns the majority of this supply. Bsquared Network L1 validators do not currently stake this token."
                },
                {
                    "title": "Bsquared Network does not contribute to the security budget",
                    "content": "Bsquared Network’s current mainnet does not pay any fees to Bitcoin miners."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Withdrawals",
            "content": [
                {
                    "title": "Users can withdraw funds if permitted by centralized operators",
                    "content": "Users can withdraw their funds from Bsquared Network back to Bitcoin via two, centralized bridge providers. Information on the signers of these bridges is unavailable."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Technology",
            "content": [
                {
                    "title": "Currently testing further integrations with Bitcoin",
                    "content": "Bsquared Network is currently testing an OP Stack rollup on the Ethereum Sepolia testnet. In this implementation, they are running their “committer” that sees the OP Stack rollup post the rollup’s latest state root to Bitcoin."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Use Cases",
            "content": [
                {
                    "title": "EVM-based applications",
                    "content": "The potential use cases for Bsquared Network are similar to that of other EVM-based sidechains. Developers can deploy smart contracts that enable applications like borrowing and lending protocols, stablecoins, NFTs, and more. The primary, proposed use case for Bsquared Network is to act as an application layer for Bitcoin."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Operator",
            "content": [
                {
                    "title": "Bsquared Network is operated by centralized parties",
                    "content": "Users have transactions sequenced by a centralized rollup sequencer."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Source Code",
            "content": [
                {
                    "title": "Node software code is open-source",
                    "content": "The node software and Polygon zkEVM contracts are open-source. Its our understanding that these implementations of Polygon zkEVM and Ethermint have not been audited."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://github.com/b2network",
            "displayText": "Bsquared Network Github"
        },
        {
            "url": "https://hub-explorer.bsquared.network",
            "displayText": "Bsquared Network's L1 explorer"
        }
    ]
}
