{
    "slug": "core",
    "title": "Core",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "underReview": "no",
    "riskFactors": ["High", "Medium", "Medium", "Medium"],
    "purpose": "General",
    "btcBridge": "Federated Multisig",
    "settlement": "Offchain",
    "btcLocked": "1003",
    "executionEnv": "Offchain",
    "consensus": "Hybrid Consensus",
    "nativeToken": "CORE",
    "feeToken": "CORE",
    "enshrinedBtc": "coreBTC",
    "links": [
        "https://coredao.org/",
        "https://www.stacks.co/explore/discover-apps",
        "https://docs.coredao.org/developer/introduction/quick-links",
        "https://scan.coredao.org/",
        "https://github.com/coredao-org",
        "https://twitter.com/Coredao_Org"
    ],
    "description": "Core (in relation to Bitcoin) is an EVM sidechain with a hybrid consensus mechanism, Satoshi Plus, that leverages both DPoW and DPoS. It uses a permissionless multisig to bridge BTC. The native token of the network is CORE, which is used for transaction fees, staking, and governance in Core DAO.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "No Unilateral Exits",
            "content": "coreBTC does not support unilateral exits. Users must trust several roles on Bitcoin and Core Chain for the minting and burning of coreBTC. Specifically, to exit from coreBTC back to BTC, users must trust Lockers and Bitcoin Light Clients. All roles are financially incentivized to be good actors."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "No DA on Bitcoin",
            "content": "Core Chain does not use Bitcoin for data availability. Because of this, Core's state cannot be reconstructed using only data from Bitcoin. Core Chain has a network of nodes who esnsure data is readily available."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Medium",
            "title": "Permissionless Block Production",
            "content": "Core Chain has a network of 25 validators who participate as block producers. Each day, the 21 validators with the highest hybrid score (from DPOW and DPOS) are elected to participate in block production. Any Core chain full node can register to become a part of this set. Core Chain does not support exits that circumvent its validator set. This means that users must trust Core Chain validators to include their transactions in blocks."
        },
        {
            "category": "Settlement Assurance",
            "score": 0,
            "tier": "Medium",
            "title": "No settlement assurances inherited from Bitcoin",
            "content": "Settlement is done offchain, on Core Chain, rather than onchain, on Bitcoin. The validity of Core Chain state transitions is not enforced by Bitcoin."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Bitcoin Security",
            "content": [
                {
                    "title": "Core Chain requires another token to function",
                    "content": "The CORE token is required to pay for transaction fees and smart contract execution on Core Chain. It is also used for staking and governance. The token is directly required for the security of the network, as the staking of it is one of the two variables used to create a weighted score for validator election and leader selection."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Technology",
            "content": [
                {
                    "title": "Satoshi Plus",
                    "content": "Satoshi Plus is a hybrid model of Delegated Proof-of-Work (DPoW) and Delegated Proof-of-Stake (DPoS). DPOW and DPOS are used to select the validators participating in Core Chain consensus.\nDPoW is performed by Bitcoin miners and mining pools who delegate their existing Bitcoin hash rate to select validators on Core Chain. DPoS is performed by those who delegate their CORE tokens, or BTC, to select validators on Core Chain. A weighted score is assigned to a validator via the amount of Bitcoin hash rate and delegate stake they receive. The top 21 validators per this weighted score are the ones elected to participate in Core Chain consnesus.\nValidators who are elected to participate in block production earn block rewards through newly issued CORE tokens and fees. Validators choose how much of these rewards they share with miners and delegators, if any, but are incentivized to share as much as possible to ensure that miners and delegators continue to select them for block production.\nBy separating Proof-of-Work mining from block production, Satoshi Plus is able to mitigate against MEV extraction from Bitcoin miners."
                },
                {
                    "title": "Ethereum Virtual Machine",
                    "content": "Core Chain uses the Ethereum Virtual Machine (EVM) for its execution environment. While this environment was initially created for Ethereum, it has been adopted by many other networks.\nLike many other Bitcoin sidechains, Core Chain leverages the EVM to tap into existing developer resources and tooling."
                },
                {
                    "title": "coreBTC",
                    "content": "coreBTC is a native bridged BTC. Several permissionless roles are involved in the burning and minting of coreBTC.\nLockers hold BTC after minting and distribute it after burning. They must be overcollateralized at risk of liquidation by Liquidators. Porters monitor Bitcoin to communicate with Core Chain smart contracts to trigger coreBTC mints, which involves sending a proof. Other roles are involved as well, such as Guardians, Bitcoin Light Clients, Slashers, Relayers, and Verifiers."
                },
                {
                    "title": "Faster block times",
                    "content": "Core Chain produces a block every three seconds, as of March 2024."
                },
                {
                    "title": "Lower fees",
                    "content": "Core Chain fees average in the order of cents as of March 2024."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Use Cases",
            "content": [
                {
                    "title": "DeFi",
                    "content": "The most popular use case for Core Chain is DeFi. Core Chain has a number of DeFi applications, including lending, borrowing, and decentralized exchanges, with a focus on bridged BTC assets."
                },
                {
                    "title": "BTC Staking",
                    "content": "Core chain enables BTC holders to natively stake their BTC, as a part of DPOS in Satoshi Plus, and delegate that stake to a specific validator in the Core Chain network."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Operator",
            "content": [
                {
                    "title": "Core Chain is operated by validators",
                    "content": "Block production is managed by a permissionless set of validators. Users trust the majority of validators not to collude."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Withdrawals",
            "content": [
                {
                    "title": "Withdrawals from coreBTC rely on several permissionless roles.",
                    "content": "Core Chain’s consensus-enshrined bridged BTC, coreBTC, relies on several roles for withdrawals, although they are all permissionless. It also relies on the liveness of Core Chain, as one of those roles is a set of smart contracts on Core Chain."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Source Code",
            "content": [
                {
                    "title": "Code is open-source",
                    "content": "All code related to the Core Chain project is free and open source."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://messari.io/report/understanding-core-chain",
            "displayText": "Understanding Core Chain by Messari"
        },
        {
            "url": "https://github.com/coredao-org/whitepaper/blob/main/COREWhitepaper_v1.0.6.pdf",
            "displayText": "Core Chain Whitepaper"
        }
    ]
}
