{
  "slug": "core",
  "title": "Core",
  "layerType": "Sidechain",
  "live": "Mainnet",
  "underReview": "no",
  "riskFactors": ["High", "Medium", "Medium", "Medium"],
  "purpose": "General",
  "btcBridge": "Permissionless Multisig",
  "settlement": "Offchain",
  "btcLocked": 3.06,
  "executionEnv": "EVM",
  "consensus": "Satoshi Plus",
  "nativeToken": "CORE",
  "feeToken": "CORE",
  "enshrinedBtc": "coreBTC",
  "links": [
    "https://coredao.org/",
    "https://docs.coredao.org/developer/introduction/quick-links",
    "https://scan.coredao.org/",
    "https://github.com/coredao-org",
    "https://twitter.com/Coredao_Org"
  ],
  "sections": [
    {
      "id": "description",
      "title": "Description",
      "content": [
        {
          "title": "Core Chain is a sidechain",
          "content": "Core (in relation to Bitcoin) is an EVM sidechain with a hybrid consensus mechanism, Satoshi Plus, that leverages both DPoW and DPoS. It uses a permissionless multisig to bridge BTC. The native token of the network is CORE, which is used for transaction fees, staking, and governance in Core DAO."
        }
      ]
    },
    {
      "id": "riskanalysis",
      "title": "Risk Analysis",
      "content": [
        {
          "title": "No Unilateral Exits",
          "content": "coreBTC does not support unilateral exits. Users must trust several permissionless roles on Bitcoin and Core Chain throughout the lifecycle of minting and burning coreBTC. Specifically, to exit from coreBTC back to BTC, users must trust Lockers and Bitcoin Light Clients. All roles are financially incentivized to be good actors."
        },
        {
          "title": "No DA on Bitcoin",
          "content": "Core Chain does not post any data availability on Bitcoin. Because of this, Core's state cannot be reconstructed using only data from Bitcoin. However, Core Chain has a permissionless and decentralized validator set, which makes data availability readily available (unlike with a single centralized sequencer)."
        },
        {
          "title": "Decentralized Block Production",
          "content": "Core Chain has a sufficiently decentralized block production mechanism, but it does not support exits that circumvent its validator set. This means that users must trust Core Chain validators to include their transactions in blocks. Unlike merge-mined sidechains, Core Chain’s Satoshi Plus consensus separates block production from Bitcoin miners, which removes any possible incentives for Bitcoin miners to censor Core Chain."
        },
        {
          "title": "Self-Enforcement of State Validation",
          "content": "Settlement is done offchain, on Core Chain, rather than onchain, on Bitcoin. The validity of Core Chain state transitions is not enforced by Bitcoin. However, Core Chain has a permissionless and decentralized validator set which enforces transaction validity, removing centralization concerns."
        }
      ]
    },
    {
      "id": "bitcoinsecurity",
      "title": "Bitcoin Security",
      "content": [
        {
          "title": "Core Chain nodes are required for data availability",
          "content": "Core Chain's state cannot be reconstructed using only data from Bitcoin. Core Chain nodes are the sole providers of data availability. However, Core Chain has a permissionless and sufficiently decentralized validator/node set, so this is not a serious concern"
        },
        {
          "title": "Core Chain requires another token to function",
          "content": "The CORE token is required to pay for transaction fees and smart contract execution on Core Chain. It is also used for staking and governance. The token is directly required for the security of the network, as the staking of it is one of the two variables used to create a weighted score for validator election and leader selection."
        }
      ]
    },
    {
      "id": "technology",
      "title": "Technology",
      "content": [
        {
          "title": "Satoshi Plus",
          "content": "Satoshi Plus is a hybrid model of Delegated Proof -of -Work (DPoW) and Delegated Proof -of -Stake (DPoS).\nDPoW is performed by Bitcoin miners and mining pools who delegate their existing Bitcoin hash rate to select validators on Core Chain. DPoS is performed by CORE token holders staking (or delegating) their CORE tokens to select validators on Core Chain. The DPoW hash and DPoS stake contribute to the calculation of a weighted score that determines which Validators qualify for the next round of block creation. Certain parameters of the weighting are variable and set by the Core DAO; currently, the weighting ratio is two-thirds to hash and one-third to stake.\nThis hybrid model separates block production from Bitcoin miners, which removes any possible incentives for Bitcoin miners to censor Core Chain. This is a novel approach to combating the classic issue with merge-mining (and other forms of parent-child shared security) in which the security provider network can perform MEV or censorship on the child chain with no penalties and no incentives not to, as they are theoretically more aligned with the parent chain than the child chain."
        },
        {
          "title": "Ethereum Virtual Machine",
          "content": "Core Chain uses the Ethereum Virtual Machine (EVM) for its execution environment. While this environment was initially created for Ethereum, it has been adopted by many other networks.\nThe EVM is the most robust execution environment in crypto, with the most active developers. Core Chain gains access to this pervasive ecosystem, including all developer tools and crypto infrastructure known by EVM developers. Toolings include Remix, Hardhat, Solidity, Truffle, ethers.js, and more. Infrastructure includes MetaMask, token standards (e.g., ERC721 or ERC20), blockchain scanners, smart contracts, and connections to middleware such as IPFS."
        },
        {
          "title": "coreBTC",
          "content": "coreBTC is a native bridged BTC. Several permissionless roles are involved in the burning and minting of coreBTC.\nLockers hold BTC after minting and distribute it after burning. They must be overcollateralized at risk of liquidation by Liquidators. Porters monitor Bitcoin to communicate with Core Chain smart contracts to trigger coreBTC mints, which involves sending a proof. Other roles are involved as well, such as Guardians, Bitcoin Light Clients, Slashers, Relayers, and Verifiers."
        },
        {
          "title": "Faster block times",
          "content": "Core Chain produces a block every three seconds, as of March 2024."
        },
        {
          "title": "Lower fees",
          "content": "Core Chain fees average in the order of cents as of March 2024."
        }
      ]
    },
    {
      "id": "usecases",
      "title": "Use Cases",
      "content": [
        {
          "title": "DeFi",
          "content": "The most popular use case for Core Chain is DeFi. Core Chain has a number of DeFi applications, including lending, borrowing, and decentralized exchanges, with a focus on bridged BTC assets."
        }
      ]
    },
    {
      "id": "operator",
      "title": "Operator",
      "content": [
        {
          "title": "Core Chain is operated by validators",
          "content": "Block production is managed by a decentralized set of validators. Users trust the majority of validators not to collude."
        }
      ]
    },
    {
      "id": "withdrawals",
      "title": "Withdrawals",
      "content": [
        {
          "title": "Withdrawals from coreBTC rely on several permissionless roles.",
          "content": "Core Chain’s consensus-enshrined bridged BTC, coreBTC, relies on several roles for withdrawals, although they are all permissionless. It also relies on the liveness of Core Chain, as one of those roles is a set of smart contracts on Core Chain."
        }
      ]
    },
    {
      "id": "sourcecode",
      "title": "Source Code",
      "content": [
        {
          "title": "Code is open-source",
          "content": "All code related to the Core Chain project is free and open source."
        }
      ]
    }
  ],
  "knowledgeBits": [
    {
      "url": "https://messari.io/report/understanding-core-chain",
      "displayText": "Understanding Core Chain by Messari"
    },
    {
      "url": "https://github.com/coredao-org/whitepaper/blob/main/COREWhitepaper_v1.0.6.pdf",
      "displayText": "Core Chain Whitepaper"
    }
  ]
}
