{
  "slug": "mercurylayer",
  "title": "Mercury Layer",
  "layerType": "Statechain",
  "live": "no",
  "underReview": "yes",
  "riskFactors": ["High", "Medium", "Medium", "High", "High"],
  "purpose": "Private payments",
  "btcBridge": "Smart Contract",
  "settlement": "Offchain",
  "btcLocked": 0,
  "executionEnv": "Statechain",
  "consensus": "Statechain",
  "nativeToken": "BTC",
  "feeToken": "BTC",
  "enshrinedBtc": "sBTC",
  "links": [
    "https://mercurylayer.com/",
    "https://mercurylayer.com/",
    "https://mercurylayer.com/",
    "https://mercurylayer.com/",
    "https://mercurylayer.com/",
    "https://mercurylayer.com/"
  ],
  "sections": [
    {
      "id": "description",
      "title": "Description",
      "content": [
        {
          "title": "xxxx",
          "content": "Stacks is a programmability layer with a novel execution environment, Clarity."
        }
      ]
    },
    {
      "id": "riskanalysis",
      "title": "Risk Analysis",
      "content": [
        {
          "title": "No Enforcement of State Validation",
          "content": "The validity of Stacks state transitions is not enforced by Bitcoin. However, Stacks has a permissionless and sufficiently decentralized validator set which enforces transaction validity, which is why this risk is Medium and not High."
        },
        {
          "title": "State Roots Only",
          "content": "Stacks posts state roots to Bitcoin, but not full transaction calldata. Because of this, Stacks' state cannot be reconstructed using only data from Bitcoin."
        },
        {
          "title": "Decentralized Block Production",
          "content": "Stacks has a sufficiently decentralized block production mechanism, but it does not support exits that circumvent its validator set. This is why the risk is Medium and not Low."
        },
        {
          "title": "No Enshrined BTC Bridge",
          "content": "Stacks has no consensus-enshrined BTC bridge. It does have two custodial multisig bridges, which are not trustless."
        },
        {
          "title": "No Enshrined BTC Bridge",
          "content": "Stacks has no consensus-enshrined BTC bridge. It does have two custodial multisig bridges, which are not trustless."
        }
      ]
    },
    {
      "id": "bitcoinsecurity",
      "title": "Bitcoin Security",
      "content": [
        {
          "title": "The rollup relies on Bitcoin for data availability and consensus",
          "content": "Moneta's state can be reconstructed based on the data that is stored on the Bitcoin blockchain."
        },
        {
          "title": "Bitcoin Hashpower is used in securing Moneta",
          "content": "Bitcoin hashpower used to mine blocks containing transactions that include Citrea's state transitions."
        },
        {
          "title": "Moneta does not have an alternative token",
          "content": "Moneta uses a BTC voucher to operate the rollup."
        }
      ]
    },
    {
      "id": "technology",
      "title": "Technology",
      "content": [
        {
          "title": "Validity proofs ensure state correctness",
          "content": "Each state transition must contain a validity proof that proves that execution was done correctly to a series of user transactions. If these a proof includes an invalid state transition, then a verifier in the BitVM set up can submit a fraud proof to challenge the state transition."
        },
        {
          "title": "Zero knowledge STARK cryptography is used",
          "content": "State transitions are proven through cryptographic proofs known as zkSTARKs. If an implementation of the cryptography was done incorrectly, user funds can be at risk. STARKs do not require a trusted set up."
        }
      ]
    },
    {
      "id": "operator",
      "title": "Operator",
      "content": [
        {
          "title": "The system has a centralized operator",
          "content": "Block production is managed by one entity. Users trust this entity to act in the best interests of the system."
        }
      ]
    },
    {
      "id": "withdrawals",
      "title": "Withdrawals",
      "content": [
        {
          "title": "Withdrawals rely on 1-N trust assumptions",
          "content": "In the event that the systems are operators are acting honestly, users trust that 1 party in the BitVM bridge set up is acting honestly and will permit their withdrawals from the L2."
        }
      ]
    },
    {
      "id": "sourcecode",
      "title": "Source Code",
      "content": [
        {
          "title": "The node software is open-source and available",
          "content": "The node software is open-source, and its source code can be found here. Users can run a node with their own hardware, or through a cloud service provider."
        }
      ]
    },
    {
      "id": "knowledgebits",
      "title": "Knowledge Bits",
      "content": [
        {
          "title": "Bitcoin.org",
          "content": "<a href='https://bitcoin.org/en/'>Visit Bitcoin.org</a>"
        }
      ]
    }
  ]
}
