{
    "slug": "merlin",
    "title": "Merlin",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "underReview": "no",
    "riskFactors": ["Unverified", "High", "High", "Unverified"],
    "purpose": "General",
    "btcBridge": "Limited information",
    "settlement": "External",
    "btcLocked": 0,
    "executionEnv": "Offchain",
    "consensus": "Centralized Sequencer",
    "nativeToken": "MERL",
    "feeToken": "WBTC",
    "enshrinedBtc": "WBTC",
    "bitcoinOnly": false,
    "links": [
        "https://merlinchain.io/",
        "https://docs.merlinchain.io/merlin-docs",
        "https://docs.merlinchain.io/merlin-docs",
        "https://docs.merlinchain.io/merlin-docs/developers",
        "https://docs.merlinchain.io/merlin-docs/developers",
        "https://twitter.com/MerlinLayer2"
    ],
    "description": "Merlin is an implementation of Polygon CDK chain. It likely is running a Polygon chain on top of a permissioned fork of the EVM. It plans to integrate with the Bsquared Hub L1 in the future.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "Users deposit funds into a MPC wallet managed by a custodian",
            "content": "When users deposit funds into Merlin, they deposit funds into a MPC wallet managed by Cobo, a institutional custodian. Information on how many signers participate in this MPC scheme is not available. Merlin has stated that more players are being added into this custody scheme."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "High",
            "title": "State data is stored and made available by a permissioned data availability committee. The identities of its members are under review",
            "content": "Merlin chain is built on the Polygon CDK stack. In its Github, it has a copy of the Polygon CDK Committee contract. In the contract, it states that the admin has the control to set up the committee, so it is likely that the members of this committee are permissioned and selected by the Merlin Chain operator. We have not been able to verify the members of this committee."
        },
        {
            "category": "Network Operator",
            "score": 0,
            "tier": "High",
            "title": "Blocks are produced by a centralized sequencer and forced inclusion mechanism is unverified",
            "content": "Merlin chain blocks are currently produced by a centralized sequencer. If the sequencer were to go down, or censor users, users would force include transactions to an L1 that is not Bitcoin. We have not verified if Merlin's forced inclusion mechanism is currently live."
        },
        {
            "category": "Settlement Assurance",
            "score": 0,
            "tier": "Unverified",
            "title": "zkSNARKs are proposedly used to ensure state correctness, but state validation occurs offchain and inherits no settlement guarantees from Bitcoin. ❓ We are unable to verify Merlin Chain's L1 contracts",
            "content": "Merlin propsedly uses zkSNARKS to ensure state correctness. The Merlin prover posts validity proofs of execution to its L1 contract to finalize state transitions. It is unknown which chain Merlin settles to. Its documentation previously pointed to Ethereum, but recent contracts cannot be verified on Ethereum."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Bitcoin Security",
            "content": [
                {
                    "title": "Merlin currently inherits no security from Bitcoin",
                    "content": "Merlin's L1 contracts and data availability mechanism point to participants in an alternative consensus protocol that is not Bitcoin."
                },
                {
                    "title": "MERL token is live, but not currently used to pay transaction fees",
                    "content": "Gas on the Merlin chain is currently paid in a BTC-synthetic. It is unknown if Merlin will use the MERL token for network security in the future.\n\nWhen Merlin integrates with Bsquared Network, it will rely on the BSQ token for security."
                },
                {
                    "title": "No MEV introduced to Bitcoin, but a centralized sequencer can reorder transactions",
                    "content": "Merlin does not introduce any MEV on the Bitcoin L1. Users trust the Merlin sequencer to not reorder their transactions to extract MEV."
                },
                {
                    "title": "Merlin does not contribute to the security budget",
                    "content": "Merlin does not currently contribute to the Bitcoin security budget."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Additional Considerations",
            "content": [
                {
                    "title": "Some code is not open-source",
                    "content": "Merlin Chain contracts are all currently upgradeable by an admin. The contracts it has listed on its CDKValdidium can not be verified on its respective L1 blockchain."
                }
            ]
        },
        {
            "id": "additionalconsiderations",
            "title": "Additional Considerations",
            "content": [
                {
                    "title": "Some code is not open-source",
                    "content": "Merlin Chain contracts are all currently upgradeable by an admin. The contracts it has listed on its CDKValdidium can not be verified on its respective L1 blockchain."
                },
                {
                    "title": "Merlin L1 smart contract not verified",
                    "content": "We are currenly unable to verify if the smart contracts listed in Merlin's Github are in fact the contracts used on its mainnet. The main contract for Polygoin CDKValidium on Ethereum was previously listed as the Merlin L1 contract in its documentation, but that was removed and no longer listed. Merlin chain have announced they will deploy their chain on Bsquared Network's L1 blockchain, which is a permissioned network. New contracts have been listed in its Github, but their L1 RPC points to a different chain that is not Bsquared Network."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Technology",
            "content": [
                {
                    "title": "Leveraging the Polygon zkEVM stack",
                    "content": "Merlin was deployed by Lumoz, a Rollup-as-a-Service provider that supports the Polygon zkEVM stack. This sees the Merlin chain be EVM-compatible and proposedly mimic a similar architecture to Polygon Validiums on Ethereum, albeit the security of its host chain is unknown."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Use Cases",
            "content": [
                {
                    "title": "EVM-based applications",
                    "content": "The potential use cases for Bsquared Network are similar to that of other EVM-based sidechains. Developers can deploy smart contracts that enable applications like borrowing and lending protocols, stablecoins, NFTs, and more. The primary, proposed use case for Bsquared Network is to act as an application layer for Bitcoin."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://merlinchain.io/",
            "displayText": "Merlin Chain website"
        },
        {
            "url": "https://docs.merlinchain.io/merlin-docs/resources/merlin-contracts",
            "displayText": "Merlin documentation"
        },
        {
            "url": "https://github.com/MerlinLayer2/",
            "displayText": "Merlin Chain's Github"
        }
    ]
}
