{
    "slug": "rootstock",
    "title": "Rootstock",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "underReview": "no",
    "riskFactors": ["High", "Medium", "Medium", "Medium"],
    "purpose": "General",
    "btcBridge": "Federated Multisig",
    "settlement": "Offchain",
    "btcLocked": 2898,
    "executionEnv": "Offchain",
    "consensus": "Merge-Mining",
    "nativeToken": "RBTC",
    "feeToken": "RBTC",
    "enshrinedBtc": "RBTC",
    "bitcoinOnly": true,
    "links": [
        "https://rootstock.io/",
        "https://dev.rootstock.io",
        "https://dev.rootstock.io",
        "https://explorer.rsk.co/",
        "https://github.com/rsksmart",
        "https://twitter.com/rootstock_io"
    ],
    "description": "Rootstock is a merge-mined, EVM-compatible bitcoin sidechain. As a merge-mined network, bitcoin miners can concurrently mine for Rootstock's consensus. The network is not secured by another token. As an EVM-compatible network, developers can deploy Solidity and other EVM-compatible smart contracts with arbitrary logic, creating a host of new applications for BTC. Rootstock has an enshrined cross-chain BTC asset called ''Smart Bitcoin'' (RBTC), which is pegged 1:1 to BTC and secured by a permissioned multisig federation.",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "A federated multi-sig known as the Powpeg is used to custody users' BTC",
            "content": "The bridge between bitcoin and Rootstock is secured by a 5-of-9 federated multisig, referred to as the Powpeg (Proof of Work Peg). Users trust this mechanism to not steal their BTC and to also permit withdrawals. Learn more about the Powpeg in the technology section below."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Data is stored and made available via Rootstock nodes. Running a node is permissionless",
            "content": "The data for Rootstock's state updates is stored on the Rootstock blockchain. Anyone can run a Rootstock node and verify the state of the Rootstock blockchain. So long as there is at least one non-pruned Rootstock full node online, users will be able to recover the full history and state of the Rootstock blockchain."
        },
        {
            "category": "Network Operators",
            "score": 0,
            "tier": "Medium",
            "title": "Any Bitcoin miner can participate in merge-mining Rootstock",
            "content": "Block production is permissionless. Anyone who is willing and able to merge-mine Rootstock and bitcoin can produce Rootstock blocks and earn rewards. If interested parties do not possess enough hashpower to competitively solo mine, they can join a mining pool that supports Rootstock merged mining."
        },
        {
            "category": "Settlement Assurances",
            "score": 0,
            "tier": "Medium",
            "title": "Settlement assurances are provided by Rootstock's consensus mechanism",
            "content": "Sidechain miners sign proposed blocks in the sidechain. Rootstock does not directly receive settlement assurances from Bitcoin consensus participants."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Bitcoin Security",
            "content": [
                {
                    "title": "Rootstock enables Bitcoin miners to merge-mine Rootstock",
                    "content": "Rootstock indirectly inherits security from Bitcoin's consensus participants. Bitcoin miners can permissionlessly opt-in to merge-mining Rootstock and secure the network."
                },
                {
                    "title": "Another token is not used for network security",
                    "content": "The Full Block Reward is paid out in RBTC. Its distribution is : 20% to Rootstock Labs, 0.8% to Powpeg Federation, 79.2% to miners. Miners only receive rewards from transaction fees. Fees dedicated to the federation and miners serve to incentivize the continued security, whereas the 20% dedicated to Rootstock Labs is dedicated to the maintenance and development of the network."
                },
                {
                    "title": "No MEV introduced to Bitcoin, but Bitcoin miners can extract sidechain MEV",
                    "content": "Rootstock does not leak MEV to Bitcoin directly. Due to the nature of Rootstocks execution environment, Bitcoin miners may take advantage of opportunies to extract MEV if the network is experiencing high activity."
                },
                {
                    "title": "Merge-mining enables Bitcoin miners to earn more fees",
                    "content": "Rootstock contributes to Bitcoin's security budget indirectly by providing Bitcoin miners an exclusive opportunity to earn fee revenue via merge-mining."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Technology",
            "content": [
                {
                    "title": "Merge-mining",
                    "content": "Merged mining is a crucial part of Rootstock’s consensus mechanism that allows coupling between bitcoin and Rootstock. Essentially, BTC mining pools add references to Rootstock blocks in mining jobs sent to mining participants. Additionally, because the Rootstock mining algorithm is the same as bitcoin’s, there is little added energy expenditure. This combined with miners earning a portion of transaction fees from Rootstock block mining creates an incentive for providing security to both BTC and to Rootstock.\n\nCurrently, more than 50% of the bitcoin hashrate is participating in Rootstock merged mining. Rootstock Labs states to have three phases for merged mining growth, a bootstrap phase (<30% of BTC hashrate), stable phase (60% ≥ Rootstock ≥ 30%), and its mature phase (≥60%). Currently, Rootstock is in its stable phase.\n\nIn order to pay out miners, every block executes the Reward Manager Smart Contract (REMASC). The contract keeps record of the Reward Balance account, which exists to change value during new block production. When a block reaches maturity, the appropriate portions of rewards are distributed according to REMASC specified rules."
                },
                {
                    "title": "Powpeg",
                    "content": "The Powpeg is operated by special nodes referred to as Powpeg functionaries. The Powpeg functionaries are: BlockVenture, Collider, Constata, Luxor, MyCointainer, pNetwork, Rootstock Labs, Sovryn, and Xapo.\n\nEach functionary operates a Powpeg node. A Powpeg node combines a specialized Rootstock full node with a Proof of Work Hardware Security Module (PowHSM). A PowHSM is a hardware device designed to remove human control over the bitcoin private keys used to sign Powpeg multisig transactions. PowHSM operators cannot manually sign transactions, extract private keys, or perform any other functions with the private keys. The PowHSM firmware is open source and available in the Rootstock GitHub repo. PowHSM operators are publicly verifiable using remote attestation.\n\nRequests by users to withdraw BTC from the Powpeg bridge must be approved by a majority of Powpeg functionaries. If a functionary's PowHSM is online, then it will automatically sign a withdrawal transaction after the withdrawal request reaches a sufficient number of confirmations on the Rootstock blockchain.\n\nBTC held in the Powpeg bridge can be stolen if a majority of PowHSM devices are compromised.\n\nAdditionally, the Powpeg uses a time-locked emergency 3-of-4 federated multisig as a safeguard against PowHSM device failures or possible external intervention. The emergency multisig automatically gains spending authority over the funds in the Powpeg bridge if a majority of PowHSM devices are unresponsive for a period of one year. The emergency multisig signers are: Rootstock Labs, MoneyOnChain, Jameson Lopp, and Adrian Eidelman. In the event of an emergency, these signatories will evaluate the situation and coordinate for the recovery of funds.\n\nBTC held in the emergency multisig can be lost or stolen if a majority of the emergency multisig signers are compromised.\n\nIf BTC held in the Powpeg bridge (or emergency multisig, if the emergency multisig procedure has been activated) is lost or stolen, then users will not be able to convert RBTC to BTC and exit the bridge.\n\nTo potentially improve the trust assumptions of the Rootstock bitcoin bridge, Rootstock Labs is funding research into BitVMX, a protocol that can be used to develop a trust-minimized 1-of-N federated bitcoin bridge."
                },
                {
                    "title": "Ethereum Virtual Machine",
                    "content": "Rootstock uses a forked version of the Ethereum Virtual Machine (EVM), which it calls the Rootstock Virtual Machine (RVM). The EVM is a Turing-complete execution environment developed for Ethereum and adopted by various other networks. Solidity is the primary coding language used for smart contract development on the EVM. Solidity and the EVM are the dominant language and environment for smart contracts in the broader cryptocurrency ecosystem, respectively. Smart contracts created for the EVM are directly compatible with the RVM. The RVM is EVM-compatible at both the bytecode and opcode level, and can interact with Ethereum developer tooling. The RVM uses RBTC as its gas cost for smart contract execution."
                },
                {
                    "title": "Faster block times",
                    "content": "Rootstock achieves block confirmation around every 30s."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Use Cases",
            "content": [
                {
                    "title": "Decentralized finance",
                    "content": "With its low fees and smart contract execution environment, Rootstock is designed to be an application-friendly ecosystem. It hosts a few apps fundamental to the development of a healthy DeFi sector: Sovryn (Lending), Uniswap (DEX), and MoneyOnChain (Stablecoins)."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Operator",
            "content": [
                {
                    "title": "Any bitcoin miner can merge-mine Rootstock",
                    "content": "Block production is permissionless. Anyone who is willing to merge-mine can produce blocks and earn rewards. If interested parties do not possess enough capital to competitively solo mine, they can join a mining pool that supports Rootstock merged mining."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Withdrawals",
            "content": [
                {
                    "title": "Users trust permissioned operators to process their withdrawals",
                    "content": "Withdrawals are currently permissioned by a federated group of signers. Users must trust that when they deposit BTC into the Rootstock blockchain, the signers will not collude and steal their BTC. Learn more about the Powpeg multisig in the Knowledge Bits section."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Source Code",
            "content": [
                {
                    "title": "Code is open-source",
                    "content": "All code related to the Rootstock project is open source."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://dev.rootstock.io/",
            "displayText": "Rootstock developer portal"
        },
        {
            "url": "https://rootstock.io/static/a79b27d4889409602174df4710102056/RS-whitepaper.pdf",
            "displayText": "Rootstock Whitepaper"
        },
        {
            "url": "https://dev.rootstock.io/rsk/architecture/powpeg/",
            "displayText": "Powpeg documentation"
        },
        {
            "url": "https://rootstock.io/powpeg/",
            "displayText": "Powpeg remote attestation"
        }
    ]
}
