{
  "slug": "rootstock",
  "title": "Rootstock",
  "layerType": "Sidechain",
  "live": "Mainnet",
  "underReview": "no",
  "riskFactors": ["High", "Medium", "Medium", "Medium"],
  "purpose": "General",
  "btcBridge": "Federated Multisig",
  "settlement": "Offchain",
  "btcLocked": 2911,
  "executionEnv": "EVM",
  "consensus": "Merge-mined",
  "nativeToken": "rBTC",
  "feeToken": "rBTC",
  "enshrinedBtc": "rBTC",
  "links": [
    "https://rootstock.io/",
    "https://dev.rootstock.io",
    "https://dev.rootstock.io",
    "https://explorer.rsk.co/",
    "https://github.com/rsksmart",
    "https://twitter.com/rootstock_io"
  ],
  "sections": [
    {
      "id": "description",
      "title": "Rootstock is a merge-mined sidechain",
      "content": [
        {
          "content": "Rootstock is a merge-mined, EVM-compatible Bitcoin sidechain. As a merge-mined network, Bitcoin miners can concurrently mine for Rootstock's consensus. The network is not secured by another token. As an EVM-compatible network, developers can deploy Solidity smart contracts with arbitrary logic, creating a host of new applications for Bitcoin the asset. Rootstock has an enshrined cross-chain BTC asset called ''Smart Bitcoin'' (RBTC), which is pegged 1:1 to BTC and secured by a permissioned, 12-seat multi-sig federation."
        }
      ]
    },
    {
      "id": "riskanalysis",
      "title": "Risk Analysis",
      "content": [
        {
          "title": "No unilateral exits permitted",
          "content": "The current Bitcoin bridge between Bitcoin and Rootstock is operated by a federated multi-sig of 8 signers, referred to as the Powpeg (Proof of Work Peg). Powpeg nodes are specialized Rootstock nodes connected to Pow Hardware Security Modules (PowHSMs). Signatories in the bridge contract are functionaries operating PowHSMs. PowHSMs are specialized hardware to protect private keys. The objective behind PowHSMs is to remove private key control from humans. PowHSM members cannot manually sign transactions, extract private keys, or other functions. Moreover, PowHSM firmware is open source and available in the RSK github repo. Users' Bitcoin can be stolen if a majority of these seats collude with each other. In order for malicious collusion to occur and compromise the network, the organization/owner of the PowHSM device must be corrupt, and the PowHSM device itself must be compromised. The signers are the following: Sovryn, pNetwork, Collider, Constata, Luxor, Mycointainer, BlockVenture, and Rootstock Labs. Additionally, Powpeg uses a time-locked emergency multisig as a safeguard against PowHSM device failures or possible external intervention. The emergency multisig operates under a ¾ cooperation scheme with the following members: Rootstock Labs, MoneyOnChain, Jameson Lopp, and Adrian Eidelman. In the event of an emergency, signatories will evaluate the situation and coordinate for the recovery of funds. To potentially improve the trust assumptions of this bridge model, Rootstock Labs is also funding research related to BitVMX, a proposed trust-minimized bridge program."
        },
        {
          "title": "Offchain via sidechain nodes",
          "content": "The data for Rootstock' state updates is stored on the Rootstock blockchain. Anyone can run an RSK node and verify the state of the RSK blockchain."
        },
        {
          "title": "Block production is permissionless",
          "content": "Block production is permissionless. Anyone who is willing to merge-mine can produce blocks and earn rewards. If interested parties do not possess enough capital to compete in the Bitcoin mining market, they can join a mining pool."
        },
        {
          "title": "Sidechain miners sign proposed blocks",
          "content": "Sidechain miners sign proposed blocks in the sidechain. Any Bitcoin miner can opt into merge-mining the RSK blockchain."
        }
      ]
    },
    {
      "id": "bitcoinsecurity",
      "title": "Bitcoin Security",
      "content": [
        {
          "title": "Merge-mining is used for consensus",
          "content": "Rootstock is merge-mined. Currently, more than 35% of Bitcoin miners are engaged in RSK merge-mining. RSK claims to have three phases for merge-mining growth, a bootstrap phase (<30% of BTC hashrate), stable phase (60% ≥ RSK ≥ 30%), and its mature phase (≥60%). Currently, Rootstock is in its stable phase. In order to pay out miners, every block executes the Reward Manager Smart Contract (REMASC). The contract keeps record of the Reward Balance account, which exists to change value during new block production. When a block reaches maturity, the appropriate portions of rewards are distributed according to REMASC specified rules. The Full Block Reward is paid out in the following breakdown: 20% to RSK, .8% to RSK Federation, 79.2% to miners. Miners only receive rewards from transaction fees, as there is no issuance since the network native currency is RBTC. Fees dedicated to the federation and miners serve to incentivize the continued security, whereas the 20% dedicated to RSK/RSK Labs is dedicated to the future maintenance and development of the network."
        },
        {
          "title": "No alternative token needed for security",
          "content": "Rootstock does not have a custom token. The native token on the Rootstock blockchain is RBTC, which is a token 1:1 backed by BTC."
        }
      ]
    },
    {
      "id": "technology",
      "title": "Technology",
      "content": [
        {
          "title": "Merge-mining",
          "content": "Merge mining is a crucial part of RSK’s consensus mechanism that allows coupling between Bitcoin and Rootstock. Essentially, BTC mining pools add references to RSK blocks in mining jobs sent to mining participants. Additionally, because the Rootstock mining algorithm is similar to Bitcoin’s, there is little added energy expenditure. This combined with miners earning a portion of transaction fees from RSK block mining creates an incentive for both providing security to BTC and to Rootstock."
        },
        {
          "title": "Ethereum Virtual Machine",
          "content": "Rootstock uses a forked version of the Ethereum Virtual Machine (EVM), which it calls the Rootstock Virtual Machine (RVM). The EVM is a Turing-complete execution environment developed for Ethereum and adopted by various other networks. Solidity is the primary coding language used for smart contract development on the EVM. Solidity and the EVM are the dominant language and environment for smart contracts in the broader cryptocurrency ecosystem, respectively. Smart contracts created for the EVM are directly compatible with the RVM. The RVM is EVM-compatible at both the bytecode and opcode level, and can interact with Ethereum developer tooling. The RVM uses RBTC as its gas cost for smart contract execution."
        },
        {
          "title": "Faster block times",
          "content": "Rootstock achieves block confirmation around every 30s. However, payment systems that use Rootstock to facilitate the payment process may face delays. The average delay is recorded to be 6 minutes. The transactional throughput for the network depends on the block gas limit and block confirmation rate.The current block gas limit is 6.8M gas units per block, meaning that Rootstock using p2p transactions only can achieve 11 tps."
        }
      ]
    },
    {
      "id": "usecases",
      "title": "Use Cases",
      "content": [
        {
          "title": "Decentralized finance",
          "content": "With its low fees and smart contract execution environment, Rootstock is designed to be an application-friendly ecosystem. It hosts a few apps fundamental to the development of a healthy DeFi sector: Sovryn (Lending), Uniswap (DEX), and MoneyOnChain (Stablecoins)."
        }
      ]
    },
    {
      "id": "operator",
      "title": "Operator",
      "content": [
        {
          "title": "Any Bitcoin miner can merge-mine Rootstock",
          "content": "Block production is permissionless. Anyone who is willing to merge-mine can produce blocks and earn rewards. If interested parties do not possess enough capital to compete in the Bitcoin mining market, they can join a mining pool."
        }
      ]
    },
    {
      "id": "withdrawals",
      "title": "Withdrawals",
      "content": [
        {
          "title": "Users trust permissioned operators to process their withdrawals",
          "content": "Withdrawals are currently permissioned by a federated group of signers. Users must trust that when they deposit BTC into the Roostock blockchain, the signers will not collude and steal their BTC. Learn more about the Powpeg multi-sig in the Knowledge Bits section."
        }
      ]
    },
    {
      "id": "sourcecode",
      "title": "Source Code",
      "content": [
        {
          "title": "Code is open-source",
          "content": "All code related to the Rootstock project is open source."
        }
      ]
    }
  ],
  "knowledgeBits": [
    {
      "url": "https://dev.rootstock.io/",
      "displayText": "Rootstock developer portal"
    },
    {
      "url": "https://rootstock.io/static/a79b27d4889409602174df4710102056/RS-whitepaper.pdf",
      "displayText": "Rootstock Whitepaper"
    },
    {
      "url": "https://dev.rootstock.io/rsk/architecture/powpeg/",
      "displayText": "Powpeg documentation"
    }
  ]
}
