{
    "slug": "stacks",
    "title": "Stacks",
    "layerType": "Sidechain",
    "live": "Mainnet",
    "underReview": "no",
    "riskFactors": ["High", "Medium", "Medium", "Medium"],
    "purpose": "General",
    "btcBridge": "Centralized Multisig(s)",
    "settlement": "Offchain",
    "btcLocked": 867,
    "executionEnv": "Offchain",
    "consensus": "Proof-of-Transfer",
    "nativeToken": "STX",
    "feeToken": "STX",
    "enshrinedBtc": "sBTC",
    "bitcoinOnly": false,
    "links": [
        "https://www.stacks.co/",
        "https://www.stacks.co/explore/discover-apps",
        "https://docs.stacks.co/docs/intro",
        "https://explorer.hiro.so/transactions?chain=mainnet",
        "https://github.com/stacks-network",
        "https://twitter.com/Stacks"
    ],
    "description": "Stacks is a sidechain that aims to be programmability layer for Bitcoin. It uses a novel execution environment, Clarity. Stacks uses a hybrid PoS mechanism (PoX) and derives economic security from its native token (STX).",
    "riskAnalysis": [
        {
            "category": "Bridge Custody",
            "score": 0,
            "tier": "High",
            "title": "Users must trust centralized companies with custody of their BTC",
            "content": "Stacks has no consensus-enshrined BTC bridge. It does have two third-party bridges, which are both custodial multisigs. Users must trust the operators of these bridges to not steal their BTC, as they do not support unilateral exits."
        },
        {
            "category": "Data Availability",
            "score": 0,
            "tier": "Medium",
            "title": "Only Stacks' state roots posted to Bitcoin. Data availability requirement is fulfilled through Stacks' full nodes",
            "content": "Stacks posts state roots to Bitcoin, but not full transaction calldata. Because of this, Stacks' state cannot be reconstructed using only data from Bitcoin. Stacks has a permissionless validator and node operator set which participate in making data availability readily available."
        },
        {
            "category": "Network Operator",
            "score": 0,
            "tier": "Medium",
            "title": "Leverages a permissionless consensus mechanism",
            "content": "Stacks has a permissionless block production mechanism, but it does not support exits that circumvent its miner/validator set. This means that users must trust Stacks validators to include their transactions in blocks. Anyone with sufficient capital and resources can participate as a Stacks miner. The large majority of Stacks blocks are built by Bitcoin miners additionally mining Stacks."
        },
        {
            "category": "Settlement Assurance",
            "score": 0,
            "tier": "Medium",
            "title": "State transitions finalized by permissionless, alternative consensus mechanism",
            "content": "Settlement is done offchain, on Stacks, rather than onchain, on Bitcoin. The validity of Stacks state transitions are not enforced by Bitcoin."
        }
    ],
    "sections": [
        {
            "id": "bitcoinsecurity",
            "title": "Bitcoin Security",
            "content": [
                {
                    "title": "Unilateral exits to Bitcoin not possible",
                    "content": "Users cannot unilaterally exit from the Stacks sidechain with an L1 Bitcoin transaction. They currently trust centralized operators to process their withdrawals."
                },
                {
                    "title": "The protocol does not enable MEV on Bitcoin, but Bitcoin miners can extract MEV from Stacks",
                    "content": "Stacks' mining process requires a Bitcoin miner to submit a block commit as a bid to build a Stacks block. It is possible for a Bitcoin miner to censor all bids to build Stacks' blocks when building a Bitcoin block. Since the active Bitcoin miner would be the only entity with the ability to win a Stacks block, they could submit a minimal amount of funds to win the block and receive all STX rewards. This MEV-extraction scenario looks to be solved in the upcoming Nakamoto upgrade."
                },
                {
                    "title": "An alternative token plays a role in network security",
                    "content": "The STX token is required to pay for transaction fees and smart contract execution on the Stacks network. It is also used as a reward for miners who participate in the PoX consensus mechanism. The token is indirectly required for the security of the network, as block production by miners is incentivized by STX."
                },
                {
                    "title": "Stacks indirectly contributes to the security budget",
                    "content": "Stacks sees Bitcoin miners bid on the opportunity to win Stacks blocks and earn fees for doing so. However, miners rewards are paid out in STX tokens via a distinct mining set up."
                }
            ]
        },
        {
            "id": "withdrawals",
            "title": "Withdrawals",
            "content": [
                {
                    "title": "Users trust centralized operators to process their withdrawals",
                    "content": "Stacks users deposit BTC into Stacks through custodial bridge mechanisms. They trust that the operators of these bridges (e.g. aBTC and xBTC) will not steal their Bitcoin assets, or censor their withdrawals."
                }
            ]
        },
        {
            "id": "technology",
            "title": "Technology",
            "content": [
                {
                    "title": "Clarity",
                    "content": "Stacks leveraages the Clarity execution environment. The Clarity language is a subset of Lisp, and is not Turing-complete as a design choice. However, it is still expressive enough to build complex smart contracts and replicate much of the functionalities from Turing-complete environments like the EVM (i.e., DeFi, NFTs, etc.). Stacks is able to read Bitcoin state, due to both Clarity and its integrated PoX consensus mechanism. This allows for events on Stacks to be triggered by Bitcoin activity, or for smart contracts to read Bitcoin state during their execution."
                },
                {
                    "title": "Proof-of-Transfer",
                    "content": "Proof-of-Transfer (PoX) is Stacks' consensus mechanism, based on Proof-of-Burn. PoX involves Bitcoin miners bidding BTC for the right to mint a Stacks block. The winning miner creates the block, and is rewarded with the STX block reward and STX transaction fees from the block. The miner's bid is paid to STX stackers (stakers). This system allows for STX stackers to earn native BTC yield, and creates an additional revenue stream for miners, similar to merge-mining."
                },
                {
                    "title": "sBTC",
                    "content": "sBTC is still in development as of March 2024. It is a bridged version of BTC on Stacks. sBTC is minted by locking up BTC on Bitcoin, and is redeemable for BTC at a 1:1 ratio. sBTC is not yet permissionless, as withdrawals are permissioned by the validator set."
                },
                {
                    "title": "Faster block times",
                    "content": "Stacks operates at the same block times as Bitcoin as of March 2024, roughly 10 minutes per block. However, the upcoming Nakamoto Upgrade in April 2024 will reduce block times to an order of seconds."
                },
                {
                    "title": "Lower fees",
                    "content": "Stacks fees average in the order of tens of cents as of March 2024."
                }
            ]
        },
        {
            "id": "usecases",
            "title": "Use Cases",
            "content": [
                {
                    "title": "DeFi",
                    "content": "The most popular use case for Stacks is DeFi. Stacks has a number of DeFi applications, including lending, borrowing, and decentralized exchanges."
                },
                {
                    "title": "NFTs",
                    "content": "Stacks is home to a number of NFT projects, including digital art, collectibles, and indentity."
                }
            ]
        },
        {
            "id": "operator",
            "title": "Operator",
            "content": [
                {
                    "title": "Stacks is operated by miners and validators",
                    "content": "Block production is managed by Stacks miners (which are typically also Bitcoin miners, similar to the node overlap with classic merge-mining), by combining microblocks created by Stacks validators. Users trust the majority of validators and miners to not collude or censor."
                }
            ]
        },
        {
            "id": "sourcecode",
            "title": "Source Code",
            "content": [
                {
                    "title": "Code is open-source",
                    "content": "All code related to the Stacks project is free and open source."
                }
            ]
        }
    ],
    "knowledgeBits": [
        {
            "url": "https://messari.io/report/state-of-stacks-q4-2023",
            "displayText": "State of Stacks Q4 2023 from Messari"
        },
        {
            "url": "https://docs.stacks.co/stacks-101/bitcoin-connection",
            "displayText": "Bitcoin Connection from Stacks Docs"
        },
        {
            "url": "https://docs.stacks.co/stacks-101/proof-of-transfer",
            "displayText": "Proof of Transfer from Stacks Docs"
        }
    ]
}
