{
  "slug": "stacks",
  "title": "Stacks",
  "layerType": "Sidechain",
  "live": "yes",
  "underReview": "yes",
  "riskFactors": ["", "Medium", "Medium", "High", "High"],
  "purpose": "General",
  "btcBridge": "Custodial Multisig",
  "settlement": "Offchain",
  "btcLocked": 0,
  "executionEnv": "Clarity",
  "consensus": "PoX",
  "nativeToken": "STX",
  "feeToken": "STX",
  "enshrinedBtc": "sBTC",
  "links": [
    "https://www.stacks.co/",
    "https://www.stacks.co/explore/discover-apps",
    "https://docs.stacks.co/docs/intro",
    "https://explorer.hiro.so/transactions?chain=mainnet",
    "https://github.com/stacks-network",
    "https://twitter.com/Stacks"
  ],
  "sections": [
    {
      "id": "description",
      "title": "Description",
      "content": [
        {
          "title": "Stacks is a sidechain",
          "content": "Stacks is a programmability layer with a novel execution environment, Clarity. Stacks is a sidechain, with its a hybrid PoS mechanism called PoX and native gas token (STX)."
        }
      ]
    },
    {
      "id": "riskanalysis",
      "title": "Risk Analysis",
      "content": [
        {
          "title": "No Enshrined BTC Bridge",
          "content": "Stacks has no consensus-enshrined BTC bridge. It does have two third-party bridges, which are both custodial multisigs. Users must trust the operators of these bridges to not steal their BTC."
        },
        {
          "title": "No Enforcement of State Validation",
          "content": "The validity of Stacks state transitions is not enforced by Bitcoin. However, Stacks has a permissionless and sufficiently decentralized validator set which enforces transaction validity, which is why this risk is Medium and not High."
        },
        {
          "title": "State Roots Only",
          "content": "Stacks posts state roots to Bitcoin, but not full transaction calldata. Because of this, Stacks' state cannot be reconstructed using only data from Bitcoin."
        },
        {
          "title": "Decentralized Block Production",
          "content": "Stacks has a sufficiently decentralized block production mechanism, but it does not support exits that circumvent its validator set. This means that users must trust Stacks validators to include their transactions in blocks."
        },
        
        {
          "title": "Users do not need to interact with Bitcoin to get started",
          "content": "Users can onboard to Stacks directly without having to first transact ."
        }
      ]
    },
    {
      "id": "bitcoinsecurity",
      "title": "Bitcoin Security",
      "content": [
        {
          "title": "Stacks nodes are required for data availability",
          "content": "While state roots are posted to Bitcoin, these timestamps do not include enough data to recreate the state of Stacks. To do that, users must rely on Stacks nodes to provide that data. Stacks has a decentralized and permissionless set of nodes, so getting access to this information is not a serious concern."
        },
        {
          "title": "Stacks requires another token to function",
          "content": "The STX token is required to pay for transaction fees and smart contract execution on the Stacks network. It is also used as a reward for miners who participate in the PoX consensus mechanism. The token is not required for the security of the network, but it is necessary for its operation."
        }
      ]
    },
    {
      "id": "technology",
      "title": "Technology",
      "content": [
        {
          "title": "Clarity",
          "content": "Stacks uses the novel execution environment Clarity. The Clarity language is a subset of Lisp, and is not Turing-complete as a design choice. However, it is still expressive enough to build complex smart contracts and replicate much of the functionalities from Turing-complete environments like the EVM (i.e., DeFi, NFTs, etc.). Stacks is able to read Bitcoin state, due to both Clarity and its integrated PoX consensus mechanism. This allows for events on Stacks to be triggered by Bitcoin activity, or for smart contracts to read Bitcoin state during their execution."
        },
        {
          "title": "Proof-of-Transfer",
          "content": ""
        },
        {
          "title": "sBTC",
          "content": ""
        },
        {
          "title": "Faster block times",
          "content": "Stacks currently operates at the same block times as Bitcoin, roughly 10 minutes per block. However, the upcoming Nakamoto Upgrade in April 2024 will reduce block times to an order of seconds."
        },
        {
          "title": "Lower fees",
          "content": "Stacks fees average in the order of tens of cents."
        }
      ]
    },
    {
      "id": "usecases",
      "title": "Use Cases",
      "content": [
        {
          "title": "DeFi",
          "content": "The most popular use case for Stacks is DeFi. Stacks has a number of DeFi applications, including lending, borrowing, and decentralized exchanges."
        },
        {
          "title": "NFTs",
          "content": "Stacks is home to a number of NFT projects, including digital art, collectibles, and indentity."
        }
      ]
    },
    {
      "id": "operator",
      "title": "Operator",
      "content": [
        {
          "title": "Stacks is operated by validators",
          "content": "Block production is managed by a decentralized set of validators (aka Stackers). Users trust the majority of validators to not collude."
        }
      ]
    },
    {
      "id": "withdrawals",
      "title": "Withdrawals",
      "content": [
        {
          "title": "Withdrawals from sBTC will be permissioned by the validator set",
          "content": "Stacks does not yet have a consensus-enshrined BTC bridge. It does have two third-party bridges, which are both custodial multisigs. Users must trust the operators of these bridges to not steal their BTC."
        }
      ]
    },
    {
      "id": "sourcecode",
      "title": "Source Code",
      "content": [
        {
          "title": "Code is open-source",
          "content": "All code related to the Stacks project is free and open source."
        }
      ]
    }
  ],
  "knowledgeBits": [
    {
      "url": "https://messari.io/report/state-of-stacks-q4-2023",
      "displayText": "State of Stacks Q4 2023 from Messari"
    },
    {
      "url": "https://docs.stacks.co/stacks-101/bitcoin-connection",
      "displayText": "Bitcoin Connection from Stacks Docs"
    },
    {
      "url": "https://docs.stacks.co/stacks-101/proof-of-transfer",
      "displayText": "Proof of Transfer from Stacks Docs"
    }
  ]
}
